{
  "_written_by": "skill_extract.py",
  "_comment": "Skill vocabulary harvested from MyCareersFuture's structured tags, used to read skills out of descriptions from sources that publish none. `doc_freq` counts how many descriptions each term appeared in -- terms common enough to be filler are filtered out at extraction time. Safe to delete; it rebuilds from the next fetch.",
  "term_count": 904,
  "documents": 992,
  "terms": {
    "AI Agents": 194,
    "Artificial Intelligence": 171,
    "Design": 161,
    "LLMs": 139,
    "Python": 126,
    "Machine Learning": 125,
    "Data Science": 117,
    "Azure AI": 104,
    "AI Safety": 100,
    "Generative AI Application Development and Deployment": 96,
    "Language Models": 94,
    "AI Evaluation": 88,
    "Retrieval-Augmented Generation (RAG)": 85,
    "Kubernetes": 80,
    "Liaising with cross functional teams": 79,
    "Development": 67,
    "Enterprise Integration Solution": 66,
    "CI/CD": 62,
    "Prompt Engineering": 61,
    "Scalability": 57,
    "Chatbot": 55,
    "Fine Tuning": 55,
    "Cost Management": 54,
    "Programming": 53,
    "PyTorch": 52,
    "Engaging Stakeholders": 49,
    "Security": 48,
    "Enterprise Software": 46,
    "TensorFlow": 45,
    "AWS": 44,
    "Data Pipeline": 44,
    "Generative AI Model Evaluation": 44,
    "Governance": 44,
    "Liaising With Internal Stakeholders": 44,
    "Modelling": 44,
    "Operational Workflow": 44,
    "Responsible AI": 44,
    "Rest Apis": 44,
    "AI Models": 43,
    "Artificial Intelligence Application": 42,
    "Java": 42,
    "Pinecone": 42,
    "Model Deployment": 35,
    "Deep Learning": 34,
    "C++": 33,
    "Platform Management": 33,
    "Data Engineering": 31,
    "Pipelines": 31,
    "GCP": 29,
    "Google Cloud Platform": 29,
    "Model Training": 29,
    "AI Governance": 27,
    "Computer Vision": 26,
    "Natural Language Processing": 25,
    "API Development": 24,
    "Automation Management in Product Development": 24,
    "Knowledge Sharing": 23,
    "Benchmarking": 22,
    "Analytical and Problem-Solving Skills": 21,
    "Cloud Deployment": 21,
    "Docker Container": 20,
    "Evaluation": 20,
    "FAISS": 20,
    "Algorithm Optimization": 19,
    "Deployment": 19,
    "SQL": 19,
    "Software Engineering": 19,
    "Model Evaluation": 18,
    "Stakeholder Management": 18,
    "Statistics": 18,
    "Artificial Intelligence Ethics and Governance": 17,
    "Utility Industry": 17,
    "integrated workflow": 17,
    "Agent Management System": 16,
    "Generative AI": 16,
    "Mathematics": 16,
    "Multi-Agent Systems": 16,
    "Optimization": 16,
    "Agents": 15,
    "Cross Functional Project Management": 15,
    "Monitoring": 15,
    "Process Flows": 15,
    "Statistical Knowledge": 15,
    "Pipeline Development": 14,
    "Predictive Analytics": 14,
    "Production Support": 14,
    "Authorization": 13,
    "Build and Deploy": 13,
    "Cloud Technologies": 13,
    "Coding Standards": 13,
    "Collaborate With Engineers": 13,
    "Continuous Improvement Techniques": 13,
    "Electrical Engineering": 13,
    "Enterprise Security Solutions": 13,
    "Ethical and Responsible Generative AI Adoption": 13,
    "Generative AI Application Development and Deployment in Financial Services": 13,
    "Generative AI Prompt Engineering": 13,
    "Keras": 13,
    "Knowledge Database": 13,
    "Platform Modernization": 13,
    "Practice Development": 13,
    "Reinforcement Learning": 13,
    "Technology Expertise": 13,
    "Vision Language Models (VLMs)": 13,
    "Work in A Fast Paced Environment": 13,
    "large datasets": 13,
    "Architecture": 12,
    "Data Mining": 12,
    "Data Warehousing": 12,
    "Database DevOps": 12,
    "Digital and Physical Prototyping": 12,
    "Energy": 12,
    "Experimentation": 12,
    "Liaising with departments": 12,
    "Performance Tuning": 12,
    "React.js": 12,
    "API": 11,
    "Academic Writing": 11,
    "Adversarial Machine Learning": 11,
    "Agentic Memory Management": 11,
    "Application Architecture": 11,
    "Big Data Framework": 11,
    "Cisco": 11,
    "Cloudera": 11,
    "Code Maintenance": 11,
    "Code Repository": 11,
    "Collaborate With Internal Team": 11,
    "Collaboration Solutions": 11,
    "Communicating With Business": 11,
    "Competitive Advantage": 11,
    "Conferences": 11,
    "Context Engineering": 11,
    "Create Documentation": 11,
    "Data Solutions": 11,
    "Data Visualisation": 11,
    "Deployment Automation": 11,
    "Design-Build": 11,
    "Enterprise Integration": 11,
    "Feature Engineering": 11,
    "Gemini": 11,
    "Generative AI Innovation, Research and Development, and Innovation Management": 11,
    "Genesys": 11,
    "Hadoop Database": 11,
    "Implemented Code": 11,
    "Innovator": 11,
    "Intelligent Reasoning": 11,
    "Job Descriptions": 11,
    "Large Systems Integration": 11,
    "Linux": 11,
    "LlamaIndex": 11,
    "Manuscript Development": 11,
    "Microsoft Azure": 11,
    "Mission Critical Systems": 11,
    "Open Source": 11,
    "Open-Source Intelligence (OSINT)": 11,
    "POS": 11,
    "Partner Solutions": 11,
    "Power Plants": 11,
    "Productivity Improvement": 11,
    "Professional Experience": 11,
    "Profiling": 11,
    "Project Leadership": 11,
    "Prompt Design": 11,
    "PySpark": 11,
    "Reliability Testing": 11,
    "Resolve Technical and Operational Issues": 11,
    "Robust Design": 11,
    "SIP": 11,
    "Saas Solutions": 11,
    "Software Debugging": 11,
    "Software Development Tools": 11,
    "Software Product Development": 11,
    "Software Verification": 11,
    "Software as a Service (SaaS)": 11,
    "Systems Architecture": 11,
    "Technical Development": 11,
    "Technical Infrastructure": 11,
    "Technology Implementation": 11,
    "Training Delivery": 11,
    "Validation": 11,
    "Virtual Production Workflow Design": 11,
    "Virtual Server": 11,
    "Voice Solutions": 11,
    "automation applications": 11,
    "knowledge of the latest developments": 11,
    "leading technical teams": 11,
    "mentorship to junior staff": 11,
    "mid-term adjustments": 11,
    "Alteryx": 10,
    "Autonomous Maintenance": 10,
    "Backend Development": 10,
    "Business Intelligence and Data Analytics": 10,
    "Deep Foundations": 10,
    "Extensive Work Experience": 10,
    "Generative Model": 10,
    "Model Driven Development": 10,
    "Testing": 10,
    ".NET": 9,
    "AI Content Generation for Visual Art Images": 9,
    "Adobe Edge Animate": 9,
    "Android NDK": 9,
    "Apache OpenNLP": 9,
    "Architectural Technology": 9,
    "Audit Tools": 9,
    "Authentication": 9,
    "AutoGen": 9,
    "Automatic Storage and Retrieval System": 9,
    "Azure DevOps": 9,
    "Batch Processing": 9,
    "Benchmark Test": 9,
    "Compiler": 9,
    "Compression technology": 9,
    "Cybersecurity Engineering": 9,
    "Data Orchestration": 9,
    "Development Tools": 9,
    "Docker": 9,
    "Edge": 9,
    "Feature Selection": 9,
    "GPT Models": 9,
    "Generative AI Models Technical Aspects of Security and Ethics": 9,
    "Generative AI Models Technical Aspects of Security and Ethics in Financial Services": 9,
    "Image Processing Software": 9,
    "LangChain": 9,
    "Manufacturing Automation": 9,
    "Model Context Protocol (MCP)": 9,
    "Ontology": 9,
    "Operations Capability": 9,
    "Performance Management": 9,
    "Problem Identification": 9,
    "Providing expert advice": 9,
    "Qwen": 9,
    "Reinforcement Learning from Human Feedback (RLHF)": 9,
    "Relational Databases": 9,
    "Reliability Analysis": 9,
    "Representation Learning": 9,
    "Semantic Layer": 9,
    "Semantic Search": 9,
    "SoC": 9,
    "Software Development Methodologies": 9,
    "Stochastic": 9,
    "Supply chain management software": 9,
    "Television Research": 9,
    "Tuning": 9,
    "hardware acceleration": 9,
    "Algorithm Development": 8,
    "Business Analysis Planning": 8,
    "Clustering": 8,
    "Computer Proficiency": 8,
    "Develops Software Solutions": 8,
    "Enterprise Architecture": 8,
    "Enterprise Software Industry": 8,
    "Flutter": 8,
    "Lifecycle Management": 8,
    "MLOps": 8,
    "Project Management Support": 8,
    "Roadmap": 8,
    "Stakeholder Engagement": 8,
    "Technical Leadership": 8,
    "Workflow Solutions": 8,
    "Classification": 7,
    "Collaboration With Stakeholders": 7,
    "Data Infrastructure": 7,
    "Data Structures": 7,
    "Debugging": 7,
    "Full Stack Development": 7,
    "MCITP": 7,
    "Management": 7,
    "SSO": 7,
    "Scala": 7,
    "Software Development": 7,
    "Workflow": 7,
    "Workflow Analysis": 7,
    "Analytical Methods Development": 6,
    "Application Development": 6,
    "Cloud Services": 6,
    "Continuous Quality Improvement": 6,
    "Cybersecurity": 6,
    "Dashboards": 6,
    "Design Patterns": 6,
    "Design of Experiments": 6,
    "Industry Experience": 6,
    "Information Technology": 6,
    "JavaScript": 6,
    "Learning Platform": 6,
    "Liaise With Technical Teams": 6,
    "Low Latency": 6,
    "MES": 6,
    "Model Validation": 6,
    "Operational Management": 6,
    "Prediction": 6,
    "Prescriptive Analytics": 6,
    "Process Modelling": 6,
    "Product Improvement": 6,
    "Product Management": 6,
    "Production Deployment": 6,
    "Regulated Financial Services": 6,
    "Scalable Architecture": 6,
    "Scripting": 6,
    "Site Reliability Engineering": 6,
    "Solution Architecture": 6,
    "Statistical Analysis": 6,
    "Technical Design": 6,
    "Technology Planning": 6,
    "TypeScript": 6,
    "Unix Scripting": 6,
    "data cube": 6,
    "data integration projects": 6,
    "Agent Orchestration": 5,
    "Azure Machine Learning": 5,
    "Business Optimization": 5,
    "C Language": 5,
    "Data Analysis": 5,
    "Engineering Support": 5,
    "Front-end Development": 5,
    "Function Calling": 5,
    "GitHub": 5,
    "Hand Tools": 5,
    "Improve Usability": 5,
    "Middleware Components": 5,
    "OpenAI Codex": 5,
    "Operations Management": 5,
    "Partnerships": 5,
    "Single Sign-On": 5,
    "Software": 5,
    "Software Integration": 5,
    "Subject Matter Expert": 5,
    "Technical Skillset": 5,
    "Technological Proficiency": 5,
    "Test Automation": 5,
    "Workflow Software": 5,
    "delivering KPIs": 5,
    "requirements assessment": 5,
    "scikit-learn": 5,
    "AIOps": 4,
    "AWS Lambda": 4,
    "Analysis of Business Problemsandneeds": 4,
    "Applied Mathematics": 4,
    "Architectural Visualization": 4,
    "Automated Operation Monitoring": 4,
    "Automation Studio": 4,
    "Back End Infrastructure": 4,
    "Business Requirement Analysis": 4,
    "Cloud Infrastructure": 4,
    "Computational Intelligence": 4,
    "Computer Hardware": 4,
    "Creative Thinking": 4,
    "Cross-Functional Team Leadership": 4,
    "Data Governance": 4,
    "Data Quality Assurance": 4,
    "Database Optimization": 4,
    "Design for Maintainability": 4,
    "Distillation": 4,
    "ETL Tools": 4,
    "Education": 4,
    "Endpoint Security": 4,
    "Enterprise Search": 4,
    "Enterprise Systems": 4,
    "Failure Analysis": 4,
    "Failure Modes": 4,
    "Feature-Driven Development": 4,
    "GPU Programming": 4,
    "GitHub Copilot": 4,
    "Incident Handling": 4,
    "Interpret Business Needs": 4,
    "LLM Security": 4,
    "LLMOps": 4,
    "Liaising With Architects": 4,
    "Lifestyle": 4,
    "Mathematical Skills": 4,
    "Mentoring for Developers": 4,
    "Monitor Kpis": 4,
    "Monitoring Trends": 4,
    "Neural Networks": 4,
    "OEE": 4,
    "Operations": 4,
    "Oracle Machine Learning": 4,
    "Orchestration": 4,
    "Physics": 4,
    "Pico": 4,
    "Pipeline Management": 4,
    "Predictive Modeling": 4,
    "Process Engineering": 4,
    "Product Lifecycle Management": 4,
    "Product Strategy": 4,
    "Production System": 4,
    "Project Coordination": 4,
    "Project Team Management": 4,
    "Quantitative Analysis": 4,
    "REST APIs development": 4,
    "Reproducibility": 4,
    "Research Design": 4,
    "Root Cause Analysis": 4,
    "SIEM": 4,
    "Service Level Agreement": 4,
    "Software Architecture": 4,
    "Software Development Lifecycle": 4,
    "Software Testing": 4,
    "Technology Commercialization": 4,
    "Therapeutic Areas": 4,
    "User Interface Design": 4,
    "Validation Procedures": 4,
    "WIP": 4,
    "Work Under Pressure": 4,
    "Work With Product Managers": 4,
    "Workflow Automation": 4,
    "health monitoring software": 4,
    "policies & procedures": 4,
    "A/B testing": 3,
    "CVS": 3,
    "Containerization": 3,
    "DBMS": 3,
    "Data Ingestion": 3,
    "Data Modelling": 3,
    "Data Quality Management": 3,
    "Large-scale Data Analysis": 3,
    "Monetization": 3,
    "Multimodal AI": 3,
    "Performance Improvement": 3,
    "Problem Analysis": 3,
    "Recommender Systems": 3,
    "Researching New Technologies": 3,
    "Statistical Modelling": 3,
    "Tools Software": 3,
    "Working alongside Product Teams": 3,
    "computational skills": 3,
    "requirements from stakeholders": 3,
    "scalable solutions": 3,
    "ACL": 2,
    "AI Red Teaming": 2,
    "AOP": 2,
    "API Gateway": 2,
    "ARIMA": 2,
    "ATP": 2,
    "ATS": 2,
    "Access Control Management": 2,
    "Access Control System": 2,
    "Accountability": 2,
    "Accuracy and Precision": 2,
    "Adobe Spark": 2,
    "Adoption": 2,
    "Advanced Engineering": 2,
    "Advanced Robotics": 2,
    "Agile": 2,
    "Agile & Waterfall Methodologies": 2,
    "Agile Delivery": 2,
    "Agile Software Development": 2,
    "Airflow": 2,
    "Algorithm Analysis": 2,
    "Algorithms": 2,
    "Amazon Bedrock": 2,
    "Analyse Product Performance": 2,
    "Analytical Approach": 2,
    "Analytics Support": 2,
    "Ansible": 2,
    "Apache Spark": 2,
    "Application Maintenance Support": 2,
    "Applications Integration": 2,
    "Architectural Details": 2,
    "Articulate Communicator": 2,
    "Audit Frameworks": 2,
    "Automated Software Testing": 2,
    "Automation Strategy": 2,
    "Automation Tools": 2,
    "Automotive Industry": 2,
    "Autonomous Vehicles": 2,
    "Autonomy iManage": 2,
    "Azure AI Search": 2,
    "Azure OpenAI": 2,
    "BIM (Building Information Modeling)": 2,
    "BIRT (Business Intelligence and Reporting Tools)": 2,
    "Big Data Analytics": 2,
    "Biomedical Devices": 2,
    "Biomedical Sciences": 2,
    "Budget": 2,
    "Bug Fixing": 2,
    "Build Prototypes": 2,
    "Building Science": 2,
    "Business Applications": 2,
    "Business Data Analysis": 2,
    "Business Performance Analysis": 2,
    "Business Systems": 2,
    "Business Unit Purchasing": 2,
    "CDM": 2,
    "CMMS": 2,
    "Candidate Screening": 2,
    "Certifications": 2,
    "Clean Code": 2,
    "Clinical Data Management": 2,
    "Cloud Storage": 2,
    "Code Development": 2,
    "Code Review": 2,
    "Collaborating With Product Managers": 2,
    "Commercial Opportunities": 2,
    "Communicating With Agents": 2,
    "Competency Mapping": 2,
    "Component Based Development": 2,
    "Computer Programming": 2,
    "Computerized Maintenance Management System": 2,
    "Computing Infrastructure": 2,
    "Concept Development": 2,
    "Confidentiality": 2,
    "Construction": 2,
    "Content Ingest Operations": 2,
    "Creating communication strategies": 2,
    "Customer Experience Innovation": 2,
    "Customer Segmentation": 2,
    "Customer Support": 2,
    "DCS": 2,
    "Data Access": 2,
    "Data Acquisition": 2,
    "Data Acquisition System": 2,
    "Data Architecture": 2,
    "Data Center Architecture": 2,
    "Data Exploration": 2,
    "Data Handling": 2,
    "Data Integration": 2,
    "Data Integrity": 2,
    "Data Lake": 2,
    "Data Lineage": 2,
    "Data Maintenance": 2,
    "Data Marketing": 2,
    "Data Marts": 2,
    "Data Migration Services": 2,
    "Data Planning": 2,
    "Data Retrieval": 2,
    "Data Services Business": 2,
    "Data Storytelling and Visualisation": 2,
    "Data Transformation": 2,
    "Database Administration": 2,
    "Database Analysis": 2,
    "Database Systems": 2,
    "Decision Support Systems": 2,
    "Develop Business Applications": 2,
    "Development Reviews": 2,
    "Digital Business": 2,
    "Digital Insight & Analytics": 2,
    "Diversity": 2,
    "Drive Awareness": 2,
    "Dynamics": 2,
    "E-Commerce": 2,
    "E-Commerce Platforms": 2,
    "E2e Testing": 2,
    "EDA": 2,
    "ESP": 2,
    "ETL": 2,
    "Educational Background": 2,
    "Elastic": 2,
    "Electrical": 2,
    "Embedding": 2,
    "Embedding Models": 2,
    "End-User Marketing": 2,
    "Energy Consultancy": 2,
    "Engineering Leadership": 2,
    "Engineering Management": 2,
    "Engineering Opportunities-": 2,
    "Enterprise Applications": 2,
    "Enterprise Valuation": 2,
    "EnterpriseDB": 2,
    "Environmental Monitoring": 2,
    "Equipment Design": 2,
    "Equipment Quality": 2,
    "Equities": 2,
    "Evaluation Methodology": 2,
    "Event-Driven Architecture (EDA)": 2,
    "Exploratory Data Analysis": 2,
    "FOCAL": 2,
    "Facilities Management": 2,
    "FastAPI": 2,
    "Ffmpeg": 2,
    "Financial Services": 2,
    "Focus Groups": 2,
    "Forecasting Models": 2,
    "Foundation Design": 2,
    "Foundations": 2,
    "Front-End Architecture": 2,
    "GCC": 2,
    "GPGPU": 2,
    "GUI Testing Tools": 2,
    "Gather Feedback": 2,
    "Generative AI Model Development and Fine Tuning": 2,
    "Global E-commerce": 2,
    "Global Engineering": 2,
    "Go to Market Strategies": 2,
    "Google Analytics": 2,
    "Google Cloud": 2,
    "Graduate Recruitment": 2,
    "Hardware Interfacing": 2,
    "Hardware delivery": 2,
    "Healthcare": 2,
    "High Level Architecture": 2,
    "High Speed Ethernet": 2,
    "Hyperparameter Tuning": 2,
    "Identifying New Business Opportunities": 2,
    "Image Classification": 2,
    "Image Processing and Industrial Vision Inspection": 2,
    "Implementation of Best Practices": 2,
    "Implementation of Digital Strategy": 2,
    "Implementing Budgets": 2,
    "Industrial Engineering": 2,
    "Industry Research": 2,
    "Industry Stakeholders": 2,
    "Infiniband": 2,
    "Influencing Key Stakeholders": 2,
    "Information Retrieval": 2,
    "Infrastructure Automation": 2,
    "Integrated Planning": 2,
    "Integration Modules": 2,
    "Intelligent Agents": 2,
    "Interacting with team members": 2,
    "International Conferences": 2,
    "Interviewing": 2,
    "Issue Escalation": 2,
    "Issue Handling": 2,
    "Iteration Planning": 2,
    "Knowledge Transfer": 2,
    "LEED AP": 2,
    "LSTM": 2,
    "Language Services": 2,
    "Learning Framework Development": 2,
    "Library Science": 2,
    "MES Software": 2,
    "MFC": 2,
    "MLflow": 2,
    "Managing Ambiguity": 2,
    "Mandarin Chinese": 2,
    "Manufacturing Execution Systems": 2,
    "Market Research": 2,
    "Mathematical Modeling": 2,
    "Mechanical Engineering": 2,
    "Mechanical Engineering Management": 2,
    "Medical Degree": 2,
    "Methods&techniques": 2,
    "Metrics": 2,
    "Middleware Solution": 2,
    "Model Based Software Development": 2,
    "Model Quantisation": 2,
    "Modern Architecture": 2,
    "MongoDB": 2,
    "Monitor Hardware": 2,
    "Natural Language Programming": 2,
    "Network Performance": 2,
    "New Venture Development": 2,
    "Node.js": 2,
    "OAuth": 2,
    "Object Detection": 2,
    "Online Advertising": 2,
    "Online Services": 2,
    "Operational Metrics": 2,
    "Operational Planning": 2,
    "Operational Process Analysis": 2,
    "Operations & Services": 2,
    "Optimize Production Processes": 2,
    "Options Trading": 2,
    "Partnership Development": 2,
    "Passionate about Work": 2,
    "Pattern Recognition": 2,
    "Patterns": 2,
    "Peer Review": 2,
    "Performance Enhancement": 2,
    "Physical Education": 2,
    "Policy Management": 2,
    "Portfolio Administration": 2,
    "PostgreSQL": 2,
    "Potential Risks": 2,
    "Power BI": 2,
    "Predictive Maintenance": 2,
    "Presentation Skills": 2,
    "Product Launch": 2,
    "Production Design": 2,
    "Production Engineering": 2,
    "Production Environment": 2,
    "Production Work": 2,
    "Programming Languages": 2,
    "Programming tools": 2,
    "Project Management": 2,
    "Project Quality Management": 2,
    "Project Status Reporting": 2,
    "Prototype": 2,
    "Quality and Performance": 2,
    "Quick Learning": 2,
    "R Programming": 2,
    "RESTful API": 2,
    "Real-time Simulation": 2,
    "Recovery Procedures": 2,
    "Registration": 2,
    "Regression": 2,
    "Regulatory Compliance": 2,
    "Reliability Requirements": 2,
    "Requirements Gathering": 2,
    "Research Methods": 2,
    "Research Support": 2,
    "Resource Allocation": 2,
    "Responsible AI and Generative AI Practices in Financial Services": 2,
    "Retention Management": 2,
    "SQL Programming": 2,
    "Salary Negotiation": 2,
    "Search Algorithm": 2,
    "Security Compliance": 2,
    "Security Controls": 2,
    "Security Test": 2,
    "Shipping Management": 2,
    "Soft Skills": 2,
    "Software Deployment": 2,
    "Software Design": 2,
    "Software Implementation": 2,
    "Software Quality Engineering": 2,
    "Software Standards": 2,
    "Solution Delivery": 2,
    "Spark SQL": 2,
    "Stakeholder Engagement and Management": 2,
    "Statistical Consulting": 2,
    "Statistical forecasting": 2,
    "Storage Layout": 2,
    "Strategic Workforce Planning": 2,
    "System Deployment": 2,
    "System Implementation": 2,
    "System Specification": 2,
    "System Testing": 2,
    "Systems Integration": 2,
    "Systems Thinking Application": 2,
    "Tailwind CSS": 2,
    "Tape": 2,
    "Team Mentoring": 2,
    "Technical Consultation": 2,
    "Technical Deployment": 2,
    "Technical Instruction": 2,
    "Technical Presentations": 2,
    "Technical Product Development": 2,
    "Technical Project Delivery": 2,
    "Technical Report Writing": 2,
    "Technology Adoption and Innovation": 2,
    "Technology Consulting": 2,
    "Technology Education": 2,
    "Tenancy Management": 2,
    "Tenure": 2,
    "Test Engineering": 2,
    "Time Series Analysis": 2,
    "Time Series Forecasting": 2,
    "Timely Delivery": 2,
    "Tooling": 2,
    "Tools Development": 2,
    "Total Rewards Strategies": 2,
    "Track Record Of Dependability": 2,
    "Training Needs Analysis": 2,
    "Transformer": 2,
    "Transition Planning": 2,
    "Translate Into Technical Requirements": 2,
    "Travel Agency": 2,
    "Travel Technology": 2,
    "Use Case Analysis": 2,
    "User Feedback": 2,
    "User Stories": 2,
    "Vector Search": 2,
    "Virtual Worlds": 2,
    "Web Applications": 2,
    "Windows Azure platform": 2,
    "Work Life Balance": 2,
    "Work Preparation": 2,
    "Workflow Development": 2,
    "Workflow Management": 2,
    "Workflow Orchestration": 2,
    "Writing": 2,
    "Written English": 2,
    "Xcode": 2,
    "benchmarking analysis": 2,
    "computing solutions": 2,
    "conference papers": 2,
    "design database schemas": 2,
    "development of test strategies": 2,
    "evaluation of software": 2,
    "governance requirements": 2,
    "implementing monitoring tools": 2,
    "leading stakeholders": 2,
    "operational knowledge": 2,
    "organizational pain-points": 2,
    "product roadmap strategies": 2,
    "scientific software": 2,
    "software lifecycle methodologies": 2,
    "software-engineering concepts": 2,
    "support of IT projects": 2,
    "work processes": 2,
    "AI Literacy": 1,
    "Android": 1,
    "Apple Ios": 1,
    "Application Deployment": 1,
    "Application Frameworks": 1,
    "Archtics": 1,
    "Assisting Executives": 1,
    "Audio": 1,
    "BDD": 1,
    "Build Automation": 1,
    "Business Impact Analysis": 1,
    "CPT": 1,
    "CUDA": 1,
    "Capacity Planning": 1,
    "Collaborative Filtering": 1,
    "Commodities": 1,
    "Competitive Strategies": 1,
    "Complex Problem Solving": 1,
    "Computational Mathematics": 1,
    "Computer Vision Technology": 1,
    "Conceptualization": 1,
    "Container Operations": 1,
    "Content Security": 1,
    "Core Analysis": 1,
    "Creative Solutions": 1,
    "CrewAI": 1,
    "Cross Functional Team Building": 1,
    "Customer Retention": 1,
    "Cyber Security": 1,
    "Data Warehouse Systems": 1,
    "Data Wrangling": 1,
    "Databricks": 1,
    "Developing Frameworks": 1,
    "Developing Skills": 1,
    "Digital Image Processing": 1,
    "Digital Scanner": 1,
    "E-Commerce Strategy": 1,
    "Ecosystem Services": 1,
    "Factor Analysis": 1,
    "Factoring": 1,
    "Git": 1,
    "Grant Administration": 1,
    "Hardware": 1,
    "Head Injury": 1,
    "High Availability": 1,
    "Hive": 1,
    "IBM Cloud or Watson": 1,
    "Idea Generation": 1,
    "Impact Assessment": 1,
    "Improve User Experience": 1,
    "Information Literacy": 1,
    "Information Visualization": 1,
    "Intellectual Property Law": 1,
    "Interface with engineers": 1,
    "Internships": 1,
    "Journals": 1,
    "LangGraph": 1,
    "Logic": 1,
    "Logistic Regression": 1,
    "Logistics": 1,
    "Machine Vision": 1,
    "Mining": 1,
    "NIR": 1,
    "NumPy": 1,
    "OpenCV": 1,
    "Organisational Strategy Formulation": 1,
    "Organization and Coordination Skills": 1,
    "Pain Management": 1,
    "Pandas": 1,
    "Personalization": 1,
    "Photo Research": 1,
    "Photojournalism": 1,
    "Precipitation": 1,
    "Preparation of Technical Documents": 1,
    "Pricing Strategy": 1,
    "Privacy Law": 1,
    "Product Demonstration": 1,
    "Project Lifecycle Management": 1,
    "Project Portfolio Management": 1,
    "Project Specification": 1,
    "Quality Improvement and Safe Practices": 1,
    "Relationship Building": 1,
    "Represent team": 1,
    "Research": 1,
    "Research & Development": 1,
    "Research Industry": 1,
    "Resolving Product Problems": 1,
    "Response Rate": 1,
    "Sand Control": 1,
    "Search Analysis": 1,
    "Search Engine Optimisation (SEO)": 1,
    "Search Server": 1,
    "Segmentation": 1,
    "Semantics": 1,
    "Signal Processing Algorithms": 1,
    "Solve Technical Problems": 1,
    "Stability": 1,
    "Standards Compliance": 1,
    "Statistical Analysis Software": 1,
    "Task Completion": 1,
    "Technical Support": 1,
    "Technical Writing": 1,
    "TikTok": 1,
    "Traceability": 1,
    "Training Courses": 1,
    "Training Set": 1,
    "Transportation Planning": 1,
    "Unix Administration": 1,
    "Video Analytics": 1,
    "Vision": 1,
    "Web Content Optimization": 1,
    "Workflow Engine": 1,
    "Yahoo! Search Marketing": 1,
    "candidate searches": 1,
    "cutting-edge technology": 1,
    "enhance user experience": 1,
    "hands-on skills": 1,
    "improve system performance": 1,
    "knowledge of data networking": 1,
    "online competitions": 1,
    "product development strategies": 1,
    "proposal documents": 1,
    "visualization system": 1
  },
  "doc_freq": {
    "Design": 852,
    "Development": 712,
    "Python": 701,
    "Software": 584,
    "Pipelines": 472,
    "Programming": 467,
    "Management": 454,
    "Security": 418,
    "Machine Learning": 408,
    "AWS": 404,
    "Governance": 355,
    "LLMs": 341,
    "Scalability": 334,
    "Data Science": 328,
    "Agents": 326,
    "Software Engineering": 288,
    "Kubernetes": 281,
    "Optimization": 273,
    "PyTorch": 273,
    "Evaluation": 272,
    "CI/CD": 267,
    "Monitoring": 266,
    "API": 261,
    "Language Models": 261,
    "Testing": 260,
    "Deployment": 253,
    "Artificial Intelligence": 251,
    "TensorFlow": 248,
    "AI Agents": 237,
    "Prompt Engineering": 219,
    "Deep Learning": 182,
    "AI Governance": 174,
    "Architecture": 159,
    "Data Engineering": 157,
    "Retrieval-Augmented Generation (RAG)": 156,
    "Model Deployment": 155,
    "Workflow": 152,
    "Java": 150,
    "Docker": 149,
    "Model Training": 149,
    "Azure AI": 147,
    "Pinecone": 146,
    "LlamaIndex": 144,
    "Validation": 141,
    "Generative AI": 139,
    "AI Models": 138,
    "Responsible AI": 138,
    "FAISS": 132,
    "MLOps": 128,
    "Rest Apis": 126,
    "Energy": 124,
    "GCP": 124,
    "Operations": 123,
    "Gemini": 118,
    "SQL": 117,
    "LangChain": 113,
    "Computer Vision": 105,
    "Stakeholder Management": 100,
    "Orchestration": 95,
    "Model Evaluation": 89,
    "AutoGen": 88,
    "Tuning": 84,
    "Software Development": 83,
    "Edge": 82,
    "C++": 77,
    "Feature Engineering": 75,
    "Statistics": 75,
    "Patterns": 74,
    "Diversity": 72,
    "Knowledge Sharing": 70,
    "Modelling": 70,
    "Experimentation": 68,
    "Agile": 67,
    "Mathematics": 65,
    "Analytical and Problem-Solving Skills": 63,
    "Tooling": 60,
    "scikit-learn": 60,
    "Google Cloud": 59,
    "Metrics": 59,
    "Microsoft Azure": 59,
    "Roadmap": 59,
    "Application Development": 57,
    "Certifications": 56,
    "Scripting": 55,
    "API Development": 54,
    "Programming Languages": 54,
    "Containerization": 51,
    "Writing": 51,
    "Authentication": 50,
    "Multi-Agent Systems": 47,
    "Performance Tuning": 47,
    "Reinforcement Learning": 47,
    "Data Analysis": 46,
    "Open Source": 46,
    "Dashboards": 44,
    "Google Cloud Platform": 44,
    "TypeScript": 44,
    "Data Solutions": 42,
    "Debugging": 42,
    "Technical Leadership": 40,
    "Azure OpenAI": 39,
    "GitHub": 39,
    "Information Technology": 39,
    "JavaScript": 39,
    "Enterprise Applications": 38,
    "Algorithms": 37,
    "Classification": 37,
    "Enterprise Systems": 36,
    "Prototype": 35,
    "Data Governance": 34,
    "Financial Services": 34,
    "Authorization": 33,
    "Predictive Analytics": 33,
    "Workflow Automation": 33,
    "FastAPI": 32,
    "Coding Standards": 31,
    "Benchmarking": 30,
    "Conferences": 30,
    "Enterprise Software": 30,
    "Partnerships": 30,
    "PySpark": 30,
    "Linux": 29,
    "Scala": 29,
    "Adoption": 28,
    "Chatbot": 28,
    "Education": 28,
    "Cloud Services": 27,
    "Product Management": 27,
    "Production Deployment": 27,
    "Stakeholder Engagement": 27,
    "Model Context Protocol (MCP)": 26,
    "Registration": 26,
    "Solution Architecture": 26,
    "Cloud Technologies": 25,
    "Context Engineering": 24,
    "ETL": 24,
    "Function Calling": 24,
    "Keras": 24,
    "Profiling": 24,
    "Batch Processing": 23,
    "Electrical Engineering": 23,
    "Regulatory Compliance": 23,
    "Data Mining": 22,
    "Design Patterns": 22,
    "Regression": 22,
    "Soft Skills": 22,
    "AI Safety": 21,
    "MongoDB": 21,
    "Relational Databases": 21,
    "Alteryx": 20,
    "Backend Development": 20,
    "Data Integration": 20,
    "Healthcare": 20,
    "Lifecycle Management": 20,
    "Project Management": 20,
    "Transformer": 20,
    "Web Applications": 20,
    "Data Transformation": 19,
    "MLflow": 19,
    "Node.js": 19,
    "Reproducibility": 19,
    "Root Cause Analysis": 19,
    "Subject Matter Expert": 19,
    "leading technical teams": 19,
    "Data Structures": 18,
    "PostgreSQL": 18,
    "Prediction": 18,
    "Production Support": 18,
    "large datasets": 18,
    "Data Ingestion": 17,
    "Embedding": 17,
    "Power BI": 17,
    "scalable solutions": 17,
    "Azure AI Search": 16,
    "Build and Deploy": 16,
    "Natural Language Processing": 16,
    "Predictive Maintenance": 16,
    "Professional Experience": 16,
    "SSO": 16,
    "Stability": 16,
    "Cloud Infrastructure": 15,
    "Data Architecture": 15,
    "Data Infrastructure": 15,
    "Failure Modes": 15,
    "Git": 15,
    "LLMOps": 15,
    "LangGraph": 15,
    "Semantic Search": 15,
    "User Feedback": 15,
    "ATS": 14,
    "Accountability": 14,
    "Airflow": 14,
    "Cloudera": 14,
    "Data Warehousing": 14,
    "Global Engineering": 14,
    "Industry Experience": 14,
    "Software Development Lifecycle": 14,
    "Technical Design": 14,
    "Budget": 13,
    "Cloud Deployment": 13,
    "Data Access": 13,
    "Pico": 13,
    "Statistical Modelling": 13,
    "Academic Writing": 12,
    "Clustering": 12,
    "Deployment Automation": 12,
    "Distillation": 12,
    "Electrical": 12,
    "Fine Tuning": 12,
    "MES": 12,
    "Representation Learning": 12,
    "Single Sign-On": 12,
    "Stochastic": 12,
    "Technical Development": 12,
    "Vector Search": 12,
    "Agent Orchestration": 11,
    "Business Applications": 11,
    "Cisco": 11,
    "Competitive Advantage": 11,
    "Cost Management": 11,
    "CrewAI": 11,
    "Data Modelling": 11,
    "Data Pipeline": 11,
    "Genesys": 11,
    "Intelligent Reasoning": 11,
    "Security Controls": 11,
    "SoC": 11,
    "Software Architecture": 11,
    "Software Verification": 11,
    "Workflow Orchestration": 11,
    "AI Evaluation": 10,
    "Apache Spark": 10,
    "Applied Mathematics": 10,
    "Build Prototypes": 10,
    "Cybersecurity": 10,
    "Data Lake": 10,
    "Data Retrieval": 10,
    "Data Visualisation": 10,
    "Development Tools": 10,
    "Exploratory Data Analysis": 10,
    "GitHub Copilot": 10,
    "High Availability": 10,
    "Learning Platform": 10,
    "Mining": 10,
    "Object Detection": 10,
    "Platform Modernization": 10,
    "Prescriptive Analytics": 10,
    "Product Strategy": 10,
    "Site Reliability Engineering": 10,
    "API Gateway": 9,
    "Compiler": 9,
    "Construction": 9,
    "Middleware Components": 9,
    "Neural Networks": 9,
    "Pandas": 9,
    "Qwen": 9,
    "Tailwind CSS": 9,
    "Technology Consulting": 9,
    ".NET": 8,
    "Azure Machine Learning": 8,
    "Customer Segmentation": 8,
    "Engineering Management": 8,
    "Enterprise Architecture": 8,
    "Flutter": 8,
    "Hive": 8,
    "Vision": 8,
    "Automation Tools": 7,
    "Code Review": 7,
    "Embedding Models": 7,
    "Image Classification": 7,
    "Information Retrieval": 7,
    "Innovator": 7,
    "Knowledge Transfer": 7,
    "Physics": 7,
    "Recommender Systems": 7,
    "Research": 7,
    "cutting-edge technology": 7,
    "AIOps": 6,
    "Azure DevOps": 6,
    "Design of Experiments": 6,
    "Educational Background": 6,
    "Endpoint Security": 6,
    "Full Stack Development": 6,
    "Presentation Skills": 6,
    "Prompt Design": 6,
    "Segmentation": 6,
    "Test Automation": 6,
    "Timely Delivery": 6,
    "User Stories": 6,
    "data cube": 6,
    "A/B testing": 5,
    "AI Red Teaming": 5,
    "AWS Lambda": 5,
    "Confidentiality": 5,
    "Customer Support": 5,
    "Foundations": 5,
    "Front-end Development": 5,
    "Improve Usability": 5,
    "Incident Handling": 5,
    "OpenCV": 5,
    "Operational Metrics": 5,
    "Production Environment": 5,
    "RESTful API": 5,
    "SIEM": 5,
    "System Testing": 5,
    "Traceability": 5,
    "governance requirements": 5,
    "ACL": 4,
    "Agile Delivery": 4,
    "Ansible": 4,
    "Clean Code": 4,
    "Data Marts": 4,
    "Database Systems": 4,
    "Databricks": 4,
    "E-Commerce": 4,
    "Engineering Leadership": 4,
    "Enterprise Search": 4,
    "Internships": 4,
    "LSTM": 4,
    "Lifestyle": 4,
    "Mathematical Skills": 4,
    "NumPy": 4,
    "OEE": 4,
    "Platform Management": 4,
    "Reliability Requirements": 4,
    "Software Design": 4,
    "Solution Delivery": 4,
    "Spark SQL": 4,
    "Tenure": 4,
    "TikTok": 4,
    "WIP": 4,
    "Written English": 4,
    "Agile Software Development": 3,
    "Audio": 3,
    "Bug Fixing": 3,
    "DBMS": 3,
    "Data Wrangling": 3,
    "Dynamics": 3,
    "ETL Tools": 3,
    "Ffmpeg": 3,
    "Global E-commerce": 3,
    "Infrastructure Automation": 3,
    "Intelligent Agents": 3,
    "Monetization": 3,
    "Potential Risks": 3,
    "Software Integration": 3,
    "Software Testing": 3,
    "Validation Procedures": 3,
    "scientific software": 3,
    "AOP": 2,
    "ARIMA": 2,
    "ATP": 2,
    "Algorithm Development": 2,
    "Automotive Industry": 2,
    "Autonomous Vehicles": 2,
    "Big Data Analytics": 2,
    "Business Systems": 2,
    "CMMS": 2,
    "Candidate Screening": 2,
    "Commercial Opportunities": 2,
    "Conceptualization": 2,
    "Cyber Security": 2,
    "DCS": 2,
    "Data Acquisition": 2,
    "Data Exploration": 2,
    "Data Lineage": 2,
    "Database Administration": 2,
    "EDA": 2,
    "ESP": 2,
    "Elastic": 2,
    "Engineering Support": 2,
    "Environmental Monitoring": 2,
    "Equities": 2,
    "Facilities Management": 2,
    "Feature Selection": 2,
    "Forecasting Models": 2,
    "GCC": 2,
    "Hyperparameter Tuning": 2,
    "Infiniband": 2,
    "Journals": 2,
    "LEED AP": 2,
    "Logistic Regression": 2,
    "Market Research": 2,
    "Mechanical Engineering": 2,
    "Model Validation": 2,
    "Online Advertising": 2,
    "Peer Review": 2,
    "Performance Management": 2,
    "Personalization": 2,
    "Pipeline Development": 2,
    "Product Launch": 2,
    "Production Engineering": 2,
    "Programming tools": 2,
    "Quantitative Analysis": 2,
    "Real-time Simulation": 2,
    "Relationship Building": 2,
    "Research Methods": 2,
    "Resource Allocation": 2,
    "Software Development Tools": 2,
    "Software as a Service (SaaS)": 2,
    "Storage Layout": 2,
    "Technical Infrastructure": 2,
    "Technical Support": 2,
    "Time Series Analysis": 2,
    "Video Analytics": 2,
    "enhance user experience": 2,
    "operational knowledge": 2,
    "Android": 1,
    "CPT": 1,
    "CUDA": 1,
    "Code Repository": 1,
    "Content Security": 1,
    "Data Handling": 1,
    "Data Quality Management": 1,
    "Digital Image Processing": 1,
    "FOCAL": 1,
    "Failure Analysis": 1,
    "GPT Models": 1,
    "Google Analytics": 1,
    "Improve User Experience": 1,
    "Industrial Engineering": 1,
    "International Conferences": 1,
    "Logic": 1,
    "Logistics": 1,
    "Multimodal AI": 1,
    "OAuth": 1,
    "Online Services": 1,
    "Precipitation": 1,
    "Predictive Modeling": 1,
    "Project Leadership": 1,
    "Search Algorithm": 1,
    "Semantics": 1,
    "Software Deployment": 1,
    "Statistical Analysis": 1,
    "System Deployment": 1,
    "System Implementation": 1,
    "Technical Writing": 1,
    "Transportation Planning": 1
  }
}