{
  "_written_by": "skill_extract.py",
  "_comment": "Skill vocabulary harvested from MyCareersFuture's structured tags, used to read skills out of descriptions from sources that publish none. `doc_freq` counts how many descriptions each term appeared in -- terms common enough to be filler are filtered out at extraction time. Safe to delete; it rebuilds from the next fetch.",
  "term_count": 904,
  "documents": 1734,
  "terms": {
    "AI Agents": 246,
    "Artificial Intelligence": 236,
    "Design": 208,
    "Machine Learning": 186,
    "LLMs": 174,
    "Python": 166,
    "Data Science": 158,
    "Azure AI": 132,
    "AI Safety": 130,
    "Language Models": 120,
    "Generative AI Application Development and Deployment": 118,
    "AI Evaluation": 112,
    "Liaising with cross functional teams": 110,
    "Retrieval-Augmented Generation (RAG)": 106,
    "Kubernetes": 98,
    "PyTorch": 88,
    "Development": 82,
    "Enterprise Integration Solution": 82,
    "Programming": 78,
    "Prompt Engineering": 76,
    "CI/CD": 74,
    "Scalability": 72,
    "TensorFlow": 72,
    "Chatbot": 70,
    "Fine Tuning": 70,
    "Cost Management": 68,
    "Engaging Stakeholders": 64,
    "Data Pipeline": 62,
    "Artificial Intelligence Application": 60,
    "Security": 60,
    "AI Models": 58,
    "Enterprise Software": 58,
    "Generative AI Model Evaluation": 56,
    "Governance": 56,
    "Java": 56,
    "Liaising With Internal Stakeholders": 56,
    "Modelling": 56,
    "Operational Workflow": 56,
    "Rest Apis": 56,
    "Pinecone": 54,
    "Responsible AI": 54,
    "Pipelines": 52,
    "AWS": 50,
    "Deep Learning": 46,
    "Computer Vision": 44,
    "Model Deployment": 44,
    "Model Training": 44,
    "C++": 42,
    "Platform Management": 42,
    "Data Engineering": 40,
    "Natural Language Processing": 38,
    "AI Governance": 34,
    "GCP": 34,
    "Google Cloud Platform": 34,
    "API Development": 32,
    "Analytical and Problem-Solving Skills": 30,
    "Automation Management in Product Development": 30,
    "Knowledge Sharing": 30,
    "Algorithm Optimization": 28,
    "Benchmarking": 28,
    "large datasets": 28,
    "Cloud Deployment": 26,
    "Collaborate With Engineers": 26,
    "Docker Container": 26,
    "Evaluation": 26,
    "FAISS": 26,
    "Model Evaluation": 24,
    "Statistics": 24,
    "Agent Management System": 22,
    "Continuous Improvement Techniques": 22,
    "Data Mining": 22,
    "Data Structures": 22,
    "Deployment": 22,
    "Reinforcement Learning": 22,
    "SQL": 22,
    "Software Development": 22,
    "Software Engineering": 22,
    "Stakeholder Management": 22,
    "Utility Industry": 22,
    "Artificial Intelligence Ethics and Governance": 20,
    "Generative AI": 20,
    "Linux": 20,
    "Mathematics": 20,
    "Multi-Agent Systems": 20,
    "Optimization": 20,
    "Practice Development": 20,
    "integrated workflow": 20,
    "Agents": 18,
    "Cross Functional Project Management": 18,
    "Data Warehousing": 18,
    "Experimentation": 18,
    "Monitoring": 18,
    "Performance Tuning": 18,
    "Process Flows": 18,
    "Statistical Knowledge": 18,
    "Authorization": 16,
    "Build and Deploy": 16,
    "C Language": 16,
    "Cloud Technologies": 16,
    "Coding Standards": 16,
    "Database DevOps": 16,
    "Deep Foundations": 16,
    "Digital and Physical Prototyping": 16,
    "Electrical Engineering": 16,
    "Enterprise Security Solutions": 16,
    "Ethical and Responsible Generative AI Adoption": 16,
    "Extensive Work Experience": 16,
    "Generative AI Application Development and Deployment in Financial Services": 16,
    "Generative AI Prompt Engineering": 16,
    "Keras": 16,
    "Knowledge Database": 16,
    "Liaising with departments": 16,
    "Pipeline Development": 16,
    "Platform Modernization": 16,
    "Technology Expertise": 16,
    "Therapeutic Areas": 16,
    "Vision Language Models (VLMs)": 16,
    "Work in A Fast Paced Environment": 16,
    "API": 14,
    "Academic Writing": 14,
    "Adversarial Machine Learning": 14,
    "Agentic Memory Management": 14,
    "Alteryx": 14,
    "Application Architecture": 14,
    "Autonomous Maintenance": 14,
    "Big Data Framework": 14,
    "Cisco": 14,
    "Cloudera": 14,
    "Code Maintenance": 14,
    "Code Repository": 14,
    "Collaborate With Internal Team": 14,
    "Collaboration Solutions": 14,
    "Communicating With Business": 14,
    "Competitive Advantage": 14,
    "Conferences": 14,
    "Context Engineering": 14,
    "Create Documentation": 14,
    "Data Solutions": 14,
    "Data Visualisation": 14,
    "Deployment Automation": 14,
    "Design-Build": 14,
    "Development Tools": 14,
    "Energy": 14,
    "Enterprise Integration": 14,
    "Feature Engineering": 14,
    "Gemini": 14,
    "Generative AI Innovation, Research and Development, and Innovation Management": 14,
    "Generative Model": 14,
    "Genesys": 14,
    "Hadoop Database": 14,
    "Implemented Code": 14,
    "Innovator": 14,
    "Intelligent Reasoning": 14,
    "Job Descriptions": 14,
    "Large Systems Integration": 14,
    "LlamaIndex": 14,
    "Manuscript Development": 14,
    "Microsoft Azure": 14,
    "Mission Critical Systems": 14,
    "Model Driven Development": 14,
    "Open Source": 14,
    "Open-Source Intelligence (OSINT)": 14,
    "POS": 14,
    "Partner Solutions": 14,
    "Power Plants": 14,
    "Predictive Analytics": 14,
    "Production Support": 14,
    "Productivity Improvement": 14,
    "Professional Experience": 14,
    "Profiling": 14,
    "Project Leadership": 14,
    "Prompt Design": 14,
    "PySpark": 14,
    "React.js": 14,
    "Reliability Testing": 14,
    "Resolve Technical and Operational Issues": 14,
    "Robust Design": 14,
    "SIP": 14,
    "Saas Solutions": 14,
    "Software Debugging": 14,
    "Software Development Tools": 14,
    "Software Product Development": 14,
    "Software Verification": 14,
    "Software as a Service (SaaS)": 14,
    "Systems Architecture": 14,
    "Technical Development": 14,
    "Technical Infrastructure": 14,
    "Technology Implementation": 14,
    "Testing": 14,
    "Training Delivery": 14,
    "Validation": 14,
    "Virtual Production Workflow Design": 14,
    "Virtual Server": 14,
    "Voice Solutions": 14,
    "knowledge of the latest developments": 14,
    "leading technical teams": 14,
    "mentorship to junior staff": 14,
    "mid-term adjustments": 14,
    ".NET": 12,
    "AI Content Generation for Visual Art Images": 12,
    "Adobe Edge Animate": 12,
    "Android NDK": 12,
    "Apache OpenNLP": 12,
    "Architectural Technology": 12,
    "Architecture": 12,
    "Audit Tools": 12,
    "AutoGen": 12,
    "Automatic Storage and Retrieval System": 12,
    "Azure DevOps": 12,
    "Backend Development": 12,
    "Batch Processing": 12,
    "Benchmark Test": 12,
    "CVS": 12,
    "Compiler": 12,
    "Compression technology": 12,
    "Cybersecurity Engineering": 12,
    "DBMS": 12,
    "Data Orchestration": 12,
    "Docker": 12,
    "Edge": 12,
    "Feature Selection": 12,
    "GPT Models": 12,
    "Generative AI Models Technical Aspects of Security and Ethics": 12,
    "Generative AI Models Technical Aspects of Security and Ethics in Financial Services": 12,
    "Image Processing Software": 12,
    "Manufacturing Automation": 12,
    "Model Context Protocol (MCP)": 12,
    "Model Validation": 12,
    "Multimodal AI": 12,
    "Ontology": 12,
    "Operations Capability": 12,
    "Performance Management": 12,
    "Problem Analysis": 12,
    "Problem Identification": 12,
    "Providing expert advice": 12,
    "Qwen": 12,
    "Reinforcement Learning from Human Feedback (RLHF)": 12,
    "Relational Databases": 12,
    "Representation Learning": 12,
    "Scripting": 12,
    "Semantic Layer": 12,
    "Semantic Search": 12,
    "SoC": 12,
    "Software Development Methodologies": 12,
    "Stakeholder Engagement": 12,
    "Stochastic": 12,
    "Supply chain management software": 12,
    "Television Research": 12,
    "Tuning": 12,
    "automation applications": 12,
    "hardware acceleration": 12,
    "Analysis of Business Problemsandneeds": 10,
    "Authentication": 10,
    "Business Intelligence and Data Analytics": 10,
    "Business Requirement Analysis": 10,
    "Classification": 10,
    "Collaboration With Stakeholders": 10,
    "Computational Intelligence": 10,
    "Data Governance": 10,
    "Data Infrastructure": 10,
    "Debugging": 10,
    "Flutter": 10,
    "LangChain": 10,
    "Prediction": 10,
    "Reliability Analysis": 10,
    "Scala": 10,
    "Workflow Analysis": 10,
    "ACL": 8,
    "Agent Orchestration": 8,
    "Agile & Waterfall Methodologies": 8,
    "Algorithm Development": 8,
    "Algorithms": 8,
    "Applications Integration": 8,
    "Azure Machine Learning": 8,
    "Business Analysis Planning": 8,
    "Business Optimization": 8,
    "Clustering": 8,
    "Computer Proficiency": 8,
    "Computer Programming": 8,
    "Data Analysis": 8,
    "Database Administration": 8,
    "Design Patterns": 8,
    "Develops Software Solutions": 8,
    "EDA": 8,
    "Enterprise Architecture": 8,
    "Enterprise Software Industry": 8,
    "Full Stack Development": 8,
    "GitHub": 8,
    "Hand Tools": 8,
    "Hyperparameter Tuning": 8,
    "Information Retrieval": 8,
    "International Conferences": 8,
    "Learning Platform": 8,
    "Lifecycle Management": 8,
    "MCITP": 8,
    "MLOps": 8,
    "Management": 8,
    "Online Advertising": 8,
    "Operational Management": 8,
    "Passionate about Work": 8,
    "Production Environment": 8,
    "Project Management Support": 8,
    "Roadmap": 8,
    "SSO": 8,
    "Search Algorithm": 8,
    "Technical Consultation": 8,
    "Technical Leadership": 8,
    "Technological Proficiency": 8,
    "Workflow": 8,
    "Workflow Solutions": 8,
    "conference papers": 8,
    "scikit-learn": 8,
    "Analytical Approach": 6,
    "Analytical Methods Development": 6,
    "Application Development": 6,
    "Cloud Services": 6,
    "Containerization": 6,
    "Continuous Quality Improvement": 6,
    "Cybersecurity": 6,
    "Dashboards": 6,
    "Data Ingestion": 6,
    "Data Modelling": 6,
    "Data Quality Management": 6,
    "Design of Experiments": 6,
    "E-Commerce": 6,
    "Engineering Support": 6,
    "Front-end Development": 6,
    "Function Calling": 6,
    "Global E-commerce": 6,
    "Improve Usability": 6,
    "Industrial Engineering": 6,
    "Industry Experience": 6,
    "Information Technology": 6,
    "JavaScript": 6,
    "Liaise With Technical Teams": 6,
    "Low Latency": 6,
    "MES": 6,
    "Middleware Components": 6,
    "Monetization": 6,
    "OpenAI Codex": 6,
    "Operations Management": 6,
    "Partnerships": 6,
    "Prescriptive Analytics": 6,
    "Process Modelling": 6,
    "Product Improvement": 6,
    "Product Management": 6,
    "Production Deployment": 6,
    "Recommender Systems": 6,
    "Regulated Financial Services": 6,
    "Researching New Technologies": 6,
    "Scalable Architecture": 6,
    "Single Sign-On": 6,
    "Site Reliability Engineering": 6,
    "Software": 6,
    "Software Integration": 6,
    "Solution Architecture": 6,
    "Statistical Analysis": 6,
    "Statistical Modelling": 6,
    "Subject Matter Expert": 6,
    "Technical Design": 6,
    "Technical Skillset": 6,
    "Technology Planning": 6,
    "Test Automation": 6,
    "Tools Software": 6,
    "TypeScript": 6,
    "Unix Scripting": 6,
    "Workflow Software": 6,
    "Working alongside Product Teams": 6,
    "computational skills": 6,
    "data cube": 6,
    "data integration projects": 6,
    "delivering KPIs": 6,
    "requirements assessment": 6,
    "requirements from stakeholders": 6,
    "A/B testing": 4,
    "AI Literacy": 4,
    "AIOps": 4,
    "AWS Lambda": 4,
    "Android": 4,
    "Apple Ios": 4,
    "Application Deployment": 4,
    "Application Frameworks": 4,
    "Applied Mathematics": 4,
    "Architectural Visualization": 4,
    "Archtics": 4,
    "Assisting Executives": 4,
    "Audio": 4,
    "Automated Operation Monitoring": 4,
    "Automation Studio": 4,
    "Back End Infrastructure": 4,
    "Build Automation": 4,
    "CUDA": 4,
    "Cloud Infrastructure": 4,
    "Collaborative Filtering": 4,
    "Commodities": 4,
    "Competitive Strategies": 4,
    "Complex Problem Solving": 4,
    "Computational Mathematics": 4,
    "Computer Hardware": 4,
    "Computer Vision Technology": 4,
    "Conceptualization": 4,
    "Container Operations": 4,
    "Content Security": 4,
    "Creative Solutions": 4,
    "Creative Thinking": 4,
    "Cross Functional Team Building": 4,
    "Cross-Functional Team Leadership": 4,
    "Cyber Security": 4,
    "Data Quality Assurance": 4,
    "Data Warehouse Systems": 4,
    "Data Wrangling": 4,
    "Database Optimization": 4,
    "Databricks": 4,
    "Design for Maintainability": 4,
    "Developing Skills": 4,
    "Digital Image Processing": 4,
    "Distillation": 4,
    "E-Commerce Strategy": 4,
    "ETL Tools": 4,
    "Ecosystem Services": 4,
    "Education": 4,
    "Endpoint Security": 4,
    "Enterprise Search": 4,
    "Enterprise Systems": 4,
    "Factor Analysis": 4,
    "Factoring": 4,
    "Failure Analysis": 4,
    "Failure Modes": 4,
    "Feature-Driven Development": 4,
    "GPU Programming": 4,
    "Git": 4,
    "GitHub Copilot": 4,
    "Grant Administration": 4,
    "Hardware": 4,
    "Head Injury": 4,
    "High Availability": 4,
    "Hive": 4,
    "Idea Generation": 4,
    "Impact Assessment": 4,
    "Improve User Experience": 4,
    "Incident Handling": 4,
    "Information Literacy": 4,
    "Information Visualization": 4,
    "Intellectual Property Law": 4,
    "Interface with engineers": 4,
    "Internships": 4,
    "Interpret Business Needs": 4,
    "Journals": 4,
    "LLM Security": 4,
    "LLMOps": 4,
    "Large-scale Data Analysis": 4,
    "Liaising With Architects": 4,
    "Lifestyle": 4,
    "Logic": 4,
    "Logistic Regression": 4,
    "Machine Vision": 4,
    "Mathematical Skills": 4,
    "Mentoring for Developers": 4,
    "Mining": 4,
    "Monitor Kpis": 4,
    "Monitoring Trends": 4,
    "NIR": 4,
    "Neural Networks": 4,
    "NumPy": 4,
    "OEE": 4,
    "OpenCV": 4,
    "Operations": 4,
    "Oracle Machine Learning": 4,
    "Orchestration": 4,
    "Organisational Strategy Formulation": 4,
    "Organization and Coordination Skills": 4,
    "Pain Management": 4,
    "Pandas": 4,
    "Performance Improvement": 4,
    "Personalization": 4,
    "Photo Research": 4,
    "Photojournalism": 4,
    "Physics": 4,
    "Pico": 4,
    "Pipeline Management": 4,
    "Precipitation": 4,
    "Predictive Modeling": 4,
    "Preparation of Technical Documents": 4,
    "Privacy Law": 4,
    "Process Engineering": 4,
    "Product Demonstration": 4,
    "Product Lifecycle Management": 4,
    "Product Strategy": 4,
    "Production System": 4,
    "Project Coordination": 4,
    "Project Lifecycle Management": 4,
    "Project Portfolio Management": 4,
    "Project Specification": 4,
    "Project Team Management": 4,
    "Quality Improvement and Safe Practices": 4,
    "Quantitative Analysis": 4,
    "REST APIs development": 4,
    "Relationship Building": 4,
    "Represent team": 4,
    "Reproducibility": 4,
    "Research": 4,
    "Research & Development": 4,
    "Research Design": 4,
    "Research Industry": 4,
    "Resolving Product Problems": 4,
    "Response Rate": 4,
    "Root Cause Analysis": 4,
    "SIEM": 4,
    "Sand Control": 4,
    "Search Analysis": 4,
    "Search Engine Optimisation (SEO)": 4,
    "Search Server": 4,
    "Segmentation": 4,
    "Semantics": 4,
    "Service Level Agreement": 4,
    "Signal Processing Algorithms": 4,
    "Software Architecture": 4,
    "Software Development Lifecycle": 4,
    "Software Testing": 4,
    "Solve Technical Problems": 4,
    "Stability": 4,
    "Standards Compliance": 4,
    "Statistical Analysis Software": 4,
    "Task Completion": 4,
    "Technical Support": 4,
    "Technical Writing": 4,
    "Technology Commercialization": 4,
    "TikTok": 4,
    "Traceability": 4,
    "Training Courses": 4,
    "Training Set": 4,
    "Unix Administration": 4,
    "User Interface Design": 4,
    "Validation Procedures": 4,
    "Video Analytics": 4,
    "Vision": 4,
    "WIP": 4,
    "Web Content Optimization": 4,
    "Work Under Pressure": 4,
    "Work With Product Managers": 4,
    "Workflow Automation": 4,
    "Workflow Engine": 4,
    "Yahoo! Search Marketing": 4,
    "candidate searches": 4,
    "cutting-edge technology": 4,
    "enhance user experience": 4,
    "hands-on skills": 4,
    "health monitoring software": 4,
    "improve system performance": 4,
    "knowledge of data networking": 4,
    "online competitions": 4,
    "policies & procedures": 4,
    "product development strategies": 4,
    "proposal documents": 4,
    "scalable solutions": 4,
    "visualization system": 4,
    "AI Red Teaming": 2,
    "AOP": 2,
    "API Gateway": 2,
    "ARIMA": 2,
    "ATP": 2,
    "ATS": 2,
    "Access Control Management": 2,
    "Access Control System": 2,
    "Accountability": 2,
    "Accuracy and Precision": 2,
    "Adobe Spark": 2,
    "Adoption": 2,
    "Advanced Engineering": 2,
    "Advanced Robotics": 2,
    "Agile": 2,
    "Agile Delivery": 2,
    "Agile Software Development": 2,
    "Airflow": 2,
    "Algorithm Analysis": 2,
    "Amazon Bedrock": 2,
    "Analyse Product Performance": 2,
    "Analytics Support": 2,
    "Ansible": 2,
    "Apache Spark": 2,
    "Application Maintenance Support": 2,
    "Architectural Details": 2,
    "Articulate Communicator": 2,
    "Audit Frameworks": 2,
    "Automated Software Testing": 2,
    "Automation Strategy": 2,
    "Automation Tools": 2,
    "Automotive Industry": 2,
    "Autonomous Vehicles": 2,
    "Autonomy iManage": 2,
    "Azure AI Search": 2,
    "Azure OpenAI": 2,
    "BDD": 2,
    "BIM (Building Information Modeling)": 2,
    "BIRT (Business Intelligence and Reporting Tools)": 2,
    "Big Data Analytics": 2,
    "Biomedical Devices": 2,
    "Biomedical Sciences": 2,
    "Budget": 2,
    "Bug Fixing": 2,
    "Build Prototypes": 2,
    "Building Science": 2,
    "Business Applications": 2,
    "Business Data Analysis": 2,
    "Business Impact Analysis": 2,
    "Business Performance Analysis": 2,
    "Business Systems": 2,
    "Business Unit Purchasing": 2,
    "CDM": 2,
    "CMMS": 2,
    "CPT": 2,
    "Candidate Screening": 2,
    "Capacity Planning": 2,
    "Certifications": 2,
    "Clean Code": 2,
    "Clinical Data Management": 2,
    "Cloud Storage": 2,
    "Code Development": 2,
    "Code Review": 2,
    "Collaborating With Product Managers": 2,
    "Commercial Opportunities": 2,
    "Communicating With Agents": 2,
    "Competency Mapping": 2,
    "Component Based Development": 2,
    "Computerized Maintenance Management System": 2,
    "Computing Infrastructure": 2,
    "Concept Development": 2,
    "Confidentiality": 2,
    "Construction": 2,
    "Content Ingest Operations": 2,
    "Core Analysis": 2,
    "Creating communication strategies": 2,
    "CrewAI": 2,
    "Customer Experience Innovation": 2,
    "Customer Retention": 2,
    "Customer Segmentation": 2,
    "Customer Support": 2,
    "DCS": 2,
    "Data Access": 2,
    "Data Acquisition": 2,
    "Data Acquisition System": 2,
    "Data Architecture": 2,
    "Data Center Architecture": 2,
    "Data Exploration": 2,
    "Data Handling": 2,
    "Data Integration": 2,
    "Data Integrity": 2,
    "Data Lake": 2,
    "Data Lineage": 2,
    "Data Maintenance": 2,
    "Data Marketing": 2,
    "Data Marts": 2,
    "Data Migration Services": 2,
    "Data Planning": 2,
    "Data Retrieval": 2,
    "Data Services Business": 2,
    "Data Storytelling and Visualisation": 2,
    "Data Transformation": 2,
    "Database Analysis": 2,
    "Database Systems": 2,
    "Decision Support Systems": 2,
    "Develop Business Applications": 2,
    "Developing Frameworks": 2,
    "Development Reviews": 2,
    "Digital Business": 2,
    "Digital Insight & Analytics": 2,
    "Digital Scanner": 2,
    "Diversity": 2,
    "Drive Awareness": 2,
    "Dynamics": 2,
    "E-Commerce Platforms": 2,
    "E2e Testing": 2,
    "ESP": 2,
    "ETL": 2,
    "Educational Background": 2,
    "Elastic": 2,
    "Electrical": 2,
    "Embedding": 2,
    "Embedding Models": 2,
    "End-User Marketing": 2,
    "Energy Consultancy": 2,
    "Engineering Leadership": 2,
    "Engineering Management": 2,
    "Engineering Opportunities-": 2,
    "Enterprise Applications": 2,
    "Enterprise Valuation": 2,
    "EnterpriseDB": 2,
    "Environmental Monitoring": 2,
    "Equipment Design": 2,
    "Equipment Quality": 2,
    "Equities": 2,
    "Evaluation Methodology": 2,
    "Event-Driven Architecture (EDA)": 2,
    "Exploratory Data Analysis": 2,
    "FOCAL": 2,
    "Facilities Management": 2,
    "FastAPI": 2,
    "Ffmpeg": 2,
    "Financial Services": 2,
    "Focus Groups": 2,
    "Forecasting Models": 2,
    "Foundation Design": 2,
    "Foundations": 2,
    "Front-End Architecture": 2,
    "GCC": 2,
    "GPGPU": 2,
    "GUI Testing Tools": 2,
    "Gather Feedback": 2,
    "Generative AI Model Development and Fine Tuning": 2,
    "Global Engineering": 2,
    "Go to Market Strategies": 2,
    "Google Analytics": 2,
    "Google Cloud": 2,
    "Graduate Recruitment": 2,
    "Hardware Interfacing": 2,
    "Hardware delivery": 2,
    "Healthcare": 2,
    "High Level Architecture": 2,
    "High Speed Ethernet": 2,
    "IBM Cloud or Watson": 2,
    "Identifying New Business Opportunities": 2,
    "Image Classification": 2,
    "Image Processing and Industrial Vision Inspection": 2,
    "Implementation of Best Practices": 2,
    "Implementation of Digital Strategy": 2,
    "Implementing Budgets": 2,
    "Industry Research": 2,
    "Industry Stakeholders": 2,
    "Infiniband": 2,
    "Influencing Key Stakeholders": 2,
    "Infrastructure Automation": 2,
    "Integrated Planning": 2,
    "Integration Modules": 2,
    "Intelligent Agents": 2,
    "Interacting with team members": 2,
    "Interviewing": 2,
    "Issue Escalation": 2,
    "Issue Handling": 2,
    "Iteration Planning": 2,
    "Knowledge Transfer": 2,
    "LEED AP": 2,
    "LSTM": 2,
    "LangGraph": 2,
    "Language Services": 2,
    "Learning Framework Development": 2,
    "Library Science": 2,
    "Logistics": 2,
    "MES Software": 2,
    "MFC": 2,
    "MLflow": 2,
    "Managing Ambiguity": 2,
    "Mandarin Chinese": 2,
    "Manufacturing Execution Systems": 2,
    "Market Research": 2,
    "Mathematical Modeling": 2,
    "Mechanical Engineering": 2,
    "Mechanical Engineering Management": 2,
    "Medical Degree": 2,
    "Methods&techniques": 2,
    "Metrics": 2,
    "Middleware Solution": 2,
    "Model Based Software Development": 2,
    "Model Quantisation": 2,
    "Modern Architecture": 2,
    "MongoDB": 2,
    "Monitor Hardware": 2,
    "Natural Language Programming": 2,
    "Network Performance": 2,
    "New Venture Development": 2,
    "Node.js": 2,
    "OAuth": 2,
    "Object Detection": 2,
    "Online Services": 2,
    "Operational Metrics": 2,
    "Operational Planning": 2,
    "Operational Process Analysis": 2,
    "Operations & Services": 2,
    "Optimize Production Processes": 2,
    "Options Trading": 2,
    "Partnership Development": 2,
    "Pattern Recognition": 2,
    "Patterns": 2,
    "Peer Review": 2,
    "Performance Enhancement": 2,
    "Physical Education": 2,
    "Policy Management": 2,
    "Portfolio Administration": 2,
    "PostgreSQL": 2,
    "Potential Risks": 2,
    "Power BI": 2,
    "Predictive Maintenance": 2,
    "Presentation Skills": 2,
    "Pricing Strategy": 2,
    "Product Launch": 2,
    "Production Design": 2,
    "Production Engineering": 2,
    "Production Work": 2,
    "Programming Languages": 2,
    "Programming tools": 2,
    "Project Management": 2,
    "Project Quality Management": 2,
    "Project Status Reporting": 2,
    "Prototype": 2,
    "Quality and Performance": 2,
    "Quick Learning": 2,
    "R Programming": 2,
    "RESTful API": 2,
    "Real-time Simulation": 2,
    "Recovery Procedures": 2,
    "Registration": 2,
    "Regression": 2,
    "Regulatory Compliance": 2,
    "Reliability Requirements": 2,
    "Requirements Gathering": 2,
    "Research Methods": 2,
    "Research Support": 2,
    "Resource Allocation": 2,
    "Responsible AI and Generative AI Practices in Financial Services": 2,
    "Retention Management": 2,
    "SQL Programming": 2,
    "Salary Negotiation": 2,
    "Security Compliance": 2,
    "Security Controls": 2,
    "Security Test": 2,
    "Shipping Management": 2,
    "Soft Skills": 2,
    "Software Deployment": 2,
    "Software Design": 2,
    "Software Implementation": 2,
    "Software Quality Engineering": 2,
    "Software Standards": 2,
    "Solution Delivery": 2,
    "Spark SQL": 2,
    "Stakeholder Engagement and Management": 2,
    "Statistical Consulting": 2,
    "Statistical forecasting": 2,
    "Storage Layout": 2,
    "Strategic Workforce Planning": 2,
    "System Deployment": 2,
    "System Implementation": 2,
    "System Specification": 2,
    "System Testing": 2,
    "Systems Integration": 2,
    "Systems Thinking Application": 2,
    "Tailwind CSS": 2,
    "Tape": 2,
    "Team Mentoring": 2,
    "Technical Deployment": 2,
    "Technical Instruction": 2,
    "Technical Presentations": 2,
    "Technical Product Development": 2,
    "Technical Project Delivery": 2,
    "Technical Report Writing": 2,
    "Technology Adoption and Innovation": 2,
    "Technology Consulting": 2,
    "Technology Education": 2,
    "Tenancy Management": 2,
    "Tenure": 2,
    "Test Engineering": 2,
    "Time Series Analysis": 2,
    "Time Series Forecasting": 2,
    "Timely Delivery": 2,
    "Tooling": 2,
    "Tools Development": 2,
    "Total Rewards Strategies": 2,
    "Track Record Of Dependability": 2,
    "Training Needs Analysis": 2,
    "Transformer": 2,
    "Transition Planning": 2,
    "Translate Into Technical Requirements": 2,
    "Transportation Planning": 2,
    "Travel Agency": 2,
    "Travel Technology": 2,
    "Use Case Analysis": 2,
    "User Feedback": 2,
    "User Stories": 2,
    "Vector Search": 2,
    "Virtual Worlds": 2,
    "Web Applications": 2,
    "Windows Azure platform": 2,
    "Work Life Balance": 2,
    "Work Preparation": 2,
    "Workflow Development": 2,
    "Workflow Management": 2,
    "Workflow Orchestration": 2,
    "Writing": 2,
    "Written English": 2,
    "Xcode": 2,
    "benchmarking analysis": 2,
    "computing solutions": 2,
    "design database schemas": 2,
    "development of test strategies": 2,
    "evaluation of software": 2,
    "governance requirements": 2,
    "implementing monitoring tools": 2,
    "leading stakeholders": 2,
    "operational knowledge": 2,
    "organizational pain-points": 2,
    "product roadmap strategies": 2,
    "scientific software": 2,
    "software lifecycle methodologies": 2,
    "software-engineering concepts": 2,
    "support of IT projects": 2,
    "work processes": 2
  },
  "doc_freq": {
    "Design": 1379,
    "Development": 1170,
    "Python": 1135,
    "Software": 995,
    "Programming": 770,
    "Pipelines": 759,
    "Management": 745,
    "Machine Learning": 667,
    "Security": 660,
    "AWS": 630,
    "Scalability": 525,
    "Governance": 520,
    "Deployment": 514,
    "Agents": 500,
    "LLMs": 492,
    "Data Science": 486,
    "Software Engineering": 458,
    "Kubernetes": 445,
    "Optimization": 443,
    "PyTorch": 432,
    "Evaluation": 428,
    "API": 416,
    "Monitoring": 406,
    "Testing": 397,
    "TensorFlow": 394,
    "Artificial Intelligence": 390,
    "CI/CD": 389,
    "Language Models": 370,
    "Architecture": 356,
    "AI Agents": 342,
    "Docker": 337,
    "Prompt Engineering": 301,
    "Deep Learning": 300,
    "Operations": 279,
    "MLOps": 270,
    "Generative AI": 269,
    "Java": 269,
    "Data Engineering": 262,
    "SQL": 246,
    "Model Deployment": 242,
    "LangChain": 235,
    "AI Governance": 233,
    "Model Training": 232,
    "Energy": 229,
    "AI Models": 226,
    "Workflow": 226,
    "LlamaIndex": 215,
    "Pinecone": 213,
    "Validation": 211,
    "Azure AI": 210,
    "Retrieval-Augmented Generation (RAG)": 206,
    "Diversity": 196,
    "FAISS": 196,
    "Orchestration": 193,
    "GCP": 191,
    "Software Development": 189,
    "Computer Vision": 183,
    "Responsible AI": 182,
    "Rest Apis": 176,
    "Algorithms": 175,
    "Patterns": 174,
    "Research": 171,
    "Gemini": 170,
    "Vision": 167,
    "Tooling": 151,
    "Programming Languages": 143,
    "C++": 142,
    "Edge": 139,
    "Mathematics": 138,
    "Model Evaluation": 138,
    "Tuning": 135,
    "Agile": 134,
    "Containerization": 132,
    "Stakeholder Management": 130,
    "Scripting": 128,
    "Writing": 128,
    "scikit-learn": 127,
    "Application Development": 122,
    "AutoGen": 121,
    "Feature Engineering": 117,
    "Statistics": 117,
    "Google Cloud": 112,
    "Knowledge Sharing": 112,
    "Modelling": 110,
    "Roadmap": 110,
    "Analytical and Problem-Solving Skills": 104,
    "Data Analysis": 100,
    "Certifications": 97,
    "Debugging": 97,
    "Open Source": 97,
    "Metrics": 95,
    "Microsoft Azure": 95,
    "Experimentation": 93,
    "TypeScript": 90,
    "Azure OpenAI": 89,
    "Enterprise Applications": 89,
    "Prototype": 89,
    "GitHub": 86,
    "JavaScript": 85,
    "Reinforcement Learning": 85,
    "Authentication": 84,
    "Technical Leadership": 84,
    "Classification": 83,
    "Data Solutions": 82,
    "FastAPI": 75,
    "API Development": 74,
    "Stability": 74,
    "Financial Services": 73,
    "Data Governance": 72,
    "Performance Tuning": 72,
    "Linux": 71,
    "Enterprise Systems": 70,
    "Multi-Agent Systems": 67,
    "ETL": 65,
    "Education": 65,
    "LangGraph": 64,
    "Workflow Automation": 64,
    "Predictive Analytics": 62,
    "Scala": 61,
    "MongoDB": 59,
    "Cloud Services": 58,
    "Dashboards": 58,
    "Data Integration": 58,
    "Git": 58,
    "Conferences": 57,
    "Information Technology": 57,
    "Web Applications": 57,
    "Google Cloud Platform": 56,
    "Partnerships": 53,
    "Product Management": 53,
    "PostgreSQL": 51,
    "Solution Architecture": 51,
    "Chatbot": 50,
    "Data Structures": 50,
    "Authorization": 49,
    "Regulatory Compliance": 49,
    "Soft Skills": 49,
    "Data Mining": 48,
    "Healthcare": 47,
    "Keras": 47,
    "Regression": 47,
    "Coding Standards": 45,
    "Hardware": 45,
    "Pandas": 45,
    "cutting-edge technology": 45,
    "CrewAI": 44,
    "large datasets": 44,
    "Adoption": 43,
    "Mining": 43,
    "Production Deployment": 43,
    "Data Ingestion": 42,
    "Data Transformation": 42,
    "TikTok": 42,
    "Global Engineering": 41,
    "Node.js": 41,
    "PySpark": 41,
    "Registration": 41,
    "Budget": 40,
    "Design Patterns": 40,
    "Natural Language Processing": 40,
    "Project Management": 40,
    "Benchmarking": 39,
    "Context Engineering": 39,
    "Data Infrastructure": 39,
    "ATS": 38,
    "Batch Processing": 38,
    "High Availability": 38,
    "Data Architecture": 37,
    "Electrical Engineering": 37,
    "Enterprise Software": 37,
    "Airflow": 36,
    "Lifecycle Management": 36,
    "Pico": 36,
    "Power BI": 36,
    "scalable solutions": 36,
    "Backend Development": 35,
    "Model Context Protocol (MCP)": 35,
    "Stakeholder Engagement": 35,
    "Azure AI Search": 34,
    "Cloud Technologies": 34,
    "Function Calling": 34,
    "Prediction": 34,
    "Segmentation": 34,
    "AI Safety": 33,
    "Profiling": 33,
    "Relational Databases": 33,
    "Cloud Infrastructure": 32,
    "Embedding": 32,
    "MLflow": 32,
    "Transformer": 32,
    "Distillation": 31,
    "Electrical": 31,
    "Industry Experience": 31,
    "Internships": 31,
    "Root Cause Analysis": 30,
    "Software Architecture": 30,
    "Build and Deploy": 29,
    "Data Lake": 29,
    "Exploratory Data Analysis": 29,
    "Hive": 29,
    "Professional Experience": 29,
    "Accountability": 28,
    "Build Prototypes": 28,
    "LLMOps": 28,
    "Statistical Modelling": 28,
    "User Feedback": 28,
    "Alteryx": 27,
    "Data Modelling": 27,
    "Information Retrieval": 27,
    "Apache Spark": 26,
    "Object Detection": 26,
    "SSO": 26,
    "Data Access": 25,
    "E-Commerce": 25,
    "Reproducibility": 25,
    "leading technical teams": 25,
    "Data Retrieval": 24,
    "Data Warehousing": 24,
    "Representation Learning": 24,
    "Subject Matter Expert": 24,
    "Vector Search": 24,
    "Failure Modes": 23,
    "OpenCV": 23,
    "Physics": 23,
    "Semantic Search": 23,
    "Azure Machine Learning": 22,
    "Construction": 22,
    "Databricks": 22,
    "GitHub Copilot": 22,
    "Single Sign-On": 22,
    "Workflow Orchestration": 22,
    "Agent Orchestration": 21,
    "Applied Mathematics": 21,
    "MES": 21,
    "Predictive Maintenance": 21,
    "Production Support": 21,
    "Recommender Systems": 21,
    "AWS Lambda": 20,
    "Competitive Advantage": 20,
    "Cybersecurity": 20,
    "Data Pipeline": 20,
    "Engineering Management": 20,
    "Neural Networks": 20,
    "Technical Design": 20,
    "Technical Writing": 20,
    "NumPy": 19,
    "Production Environment": 19,
    "Site Reliability Engineering": 19,
    "Traceability": 19,
    "Academic Writing": 18,
    "Cloudera": 18,
    "Fine Tuning": 18,
    "Product Strategy": 18,
    "Software Development Lifecycle": 18,
    "Tailwind CSS": 18,
    "Code Review": 17,
    "Customer Segmentation": 17,
    "ACL": 16,
    "Cloud Deployment": 16,
    "Image Classification": 16,
    "Learning Platform": 16,
    "Prescriptive Analytics": 16,
    "Stochastic": 16,
    "Audio": 15,
    "Data Wrangling": 15,
    "Deployment Automation": 15,
    "Innovator": 15,
    "Intelligent Reasoning": 15,
    "Software Verification": 15,
    "Technical Development": 15,
    "Technology Consulting": 15,
    "Business Applications": 14,
    "Cisco": 14,
    "Confidentiality": 14,
    "Cost Management": 14,
    "Development Tools": 14,
    "Genesys": 14,
    "Qwen": 14,
    "RESTful API": 14,
    "Security Controls": 14,
    "SoC": 14,
    "Technical Support": 14,
    "DBMS": 13,
    "Embedding Models": 13,
    "Engineering Leadership": 13,
    "Platform Modernization": 13,
    "Reliability Requirements": 13,
    "Tenure": 13,
    "Written English": 13,
    "Android": 12,
    "Automation Tools": 12,
    "Clustering": 12,
    "Compiler": 12,
    "System Testing": 12,
    "AI Evaluation": 11,
    "API Gateway": 11,
    "Data Visualisation": 11,
    "Database Administration": 11,
    "Knowledge Transfer": 11,
    ".NET": 10,
    "Ansible": 10,
    "Data Marts": 10,
    "EDA": 10,
    "ETL Tools": 10,
    "Flutter": 10,
    "Lifestyle": 10,
    "Logic": 10,
    "Middleware Components": 10,
    "AI Literacy": 9,
    "Dynamics": 9,
    "Educational Background": 9,
    "Full Stack Development": 9,
    "Hyperparameter Tuning": 9,
    "Journals": 9,
    "Personalization": 9,
    "Prompt Design": 9,
    "Spark SQL": 9,
    "Test Automation": 9,
    "Timely Delivery": 9,
    "Video Analytics": 9,
    "AI Red Teaming": 8,
    "Azure DevOps": 8,
    "CUDA": 8,
    "Conceptualization": 8,
    "Cyber Security": 8,
    "Enterprise Architecture": 8,
    "Foundations": 8,
    "GCC": 8,
    "Logistic Regression": 8,
    "Online Advertising": 8,
    "Relationship Building": 8,
    "governance requirements": 8,
    "A/B testing": 7,
    "Database Systems": 7,
    "Platform Management": 7,
    "Software Design": 7,
    "Statistical Analysis": 7,
    "AIOps": 6,
    "Collaborative Filtering": 6,
    "Customer Support": 6,
    "Data Lineage": 6,
    "Design of Experiments": 6,
    "Elastic": 6,
    "Endpoint Security": 6,
    "Failure Analysis": 6,
    "Ffmpeg": 6,
    "Front-end Development": 6,
    "Global E-commerce": 6,
    "Improve Usability": 6,
    "Infrastructure Automation": 6,
    "Intelligent Agents": 6,
    "Monetization": 6,
    "Presentation Skills": 6,
    "Programming tools": 6,
    "Software Integration": 6,
    "Software Testing": 6,
    "User Stories": 6,
    "Validation Procedures": 6,
    "data cube": 6,
    "enhance user experience": 6,
    "scientific software": 6,
    "Incident Handling": 5,
    "Mechanical Engineering": 5,
    "Multimodal AI": 5,
    "Operational Metrics": 5,
    "Production Engineering": 5,
    "Real-time Simulation": 5,
    "Research Methods": 5,
    "SIEM": 5,
    "Agile Delivery": 4,
    "Clean Code": 4,
    "Code Repository": 4,
    "Content Security": 4,
    "Data Quality Management": 4,
    "Digital Image Processing": 4,
    "Enterprise Search": 4,
    "GPT Models": 4,
    "Google Analytics": 4,
    "Improve User Experience": 4,
    "International Conferences": 4,
    "LSTM": 4,
    "Mathematical Skills": 4,
    "OAuth": 4,
    "OEE": 4,
    "Online Services": 4,
    "Precipitation": 4,
    "Search Algorithm": 4,
    "Semantics": 4,
    "Software Deployment": 4,
    "Solution Delivery": 4,
    "System Deployment": 4,
    "System Implementation": 4,
    "WIP": 4,
    "Agile Software Development": 3,
    "Bug Fixing": 3,
    "Logistics": 3,
    "Model Validation": 3,
    "Potential Risks": 3,
    "Task Completion": 3,
    "AOP": 2,
    "ARIMA": 2,
    "ATP": 2,
    "Algorithm Development": 2,
    "Automotive Industry": 2,
    "Autonomous Vehicles": 2,
    "Big Data Analytics": 2,
    "Business Systems": 2,
    "CMMS": 2,
    "CPT": 2,
    "Candidate Screening": 2,
    "Capacity Planning": 2,
    "Commercial Opportunities": 2,
    "DCS": 2,
    "Data Acquisition": 2,
    "Data Exploration": 2,
    "ESP": 2,
    "Engineering Support": 2,
    "Environmental Monitoring": 2,
    "Equities": 2,
    "Facilities Management": 2,
    "Feature Selection": 2,
    "Forecasting Models": 2,
    "Industrial Engineering": 2,
    "Infiniband": 2,
    "LEED AP": 2,
    "Market Research": 2,
    "Operational Planning": 2,
    "Peer Review": 2,
    "Performance Management": 2,
    "Pipeline Development": 2,
    "Predictive Modeling": 2,
    "Product Launch": 2,
    "Quantitative Analysis": 2,
    "Resource Allocation": 2,
    "Software Development Tools": 2,
    "Software as a Service (SaaS)": 2,
    "Storage Layout": 2,
    "Technical Infrastructure": 2,
    "Time Series Analysis": 2,
    "Transportation Planning": 2,
    "Work Under Pressure": 2,
    "improve system performance": 2,
    "operational knowledge": 2,
    "Customer Retention": 1,
    "Data Handling": 1,
    "FOCAL": 1,
    "Pattern Recognition": 1,
    "Project Leadership": 1
  }
}