{
  "_written_by": "skill_extract.py",
  "_comment": "Skill vocabulary harvested from MyCareersFuture's structured tags, used to read skills out of descriptions from sources that publish none. `doc_freq` counts how many descriptions each term appeared in -- terms common enough to be filler are filtered out at extraction time. Safe to delete; it rebuilds from the next fetch.",
  "term_count": 755,
  "documents": 764,
  "terms": {
    "AI Agents": 176,
    "Artificial Intelligence": 148,
    "Design": 144,
    "LLMs": 126,
    "Python": 110,
    "Machine Learning": 104,
    "Data Science": 102,
    "Azure AI": 94,
    "AI Safety": 88,
    "Generative AI Application Development and Deployment": 88,
    "Language Models": 84,
    "AI Evaluation": 80,
    "Retrieval-Augmented Generation (RAG)": 78,
    "Kubernetes": 74,
    "Liaising with cross functional teams": 66,
    "Development": 62,
    "Enterprise Integration Solution": 60,
    "CI/CD": 58,
    "Prompt Engineering": 56,
    "Scalability": 52,
    "Chatbot": 50,
    "Fine Tuning": 50,
    "Cost Management": 48,
    "Engaging Stakeholders": 44,
    "Security": 44,
    "AWS": 42,
    "Enterprise Software": 42,
    "Programming": 42,
    "Generative AI Model Evaluation": 40,
    "Governance": 40,
    "Liaising With Internal Stakeholders": 40,
    "Modelling": 40,
    "Operational Workflow": 40,
    "PyTorch": 40,
    "Responsible AI": 40,
    "Rest Apis": 40,
    "AI Models": 38,
    "Data Pipeline": 38,
    "Pinecone": 38,
    "Artificial Intelligence Application": 36,
    "Java": 36,
    "TensorFlow": 36,
    "Model Deployment": 32,
    "C++": 30,
    "Deep Learning": 30,
    "Platform Management": 30,
    "Data Engineering": 28,
    "GCP": 26,
    "Google Cloud Platform": 26,
    "AI Governance": 24,
    "Model Training": 24,
    "Pipelines": 24,
    "Automation Management in Product Development": 22,
    "API Development": 20,
    "Benchmarking": 20,
    "Computer Vision": 20,
    "Knowledge Sharing": 20,
    "Natural Language Processing": 20,
    "Analytical and Problem-Solving Skills": 18,
    "Cloud Deployment": 18,
    "Deployment": 18,
    "Docker Container": 18,
    "Evaluation": 18,
    "FAISS": 18,
    "SQL": 18,
    "Software Engineering": 18,
    "Algorithm Optimization": 16,
    "Artificial Intelligence Ethics and Governance": 16,
    "Model Evaluation": 16,
    "Stakeholder Management": 16,
    "Statistics": 16,
    "integrated workflow": 16,
    "Agent Management System": 14,
    "Agents": 14,
    "Cross Functional Project Management": 14,
    "Generative AI": 14,
    "Mathematics": 14,
    "Monitoring": 14,
    "Multi-Agent Systems": 14,
    "Optimization": 14,
    "Predictive Analytics": 14,
    "Process Flows": 14,
    "Production Support": 14,
    "Statistical Knowledge": 14,
    "Utility Industry": 14,
    "Architecture": 12,
    "Authorization": 12,
    "Build and Deploy": 12,
    "Cloud Technologies": 12,
    "Coding Standards": 12,
    "Electrical Engineering": 12,
    "Enterprise Security Solutions": 12,
    "Ethical and Responsible Generative AI Adoption": 12,
    "Generative AI Application Development and Deployment in Financial Services": 12,
    "Generative AI Prompt Engineering": 12,
    "Keras": 12,
    "Knowledge Database": 12,
    "Pipeline Development": 12,
    "Platform Modernization": 12,
    "Technology Expertise": 12,
    "Vision Language Models (VLMs)": 12,
    "Work in A Fast Paced Environment": 12,
    "API": 10,
    "Academic Writing": 10,
    "Adversarial Machine Learning": 10,
    "Agentic Memory Management": 10,
    "Application Architecture": 10,
    "Big Data Framework": 10,
    "Business Intelligence and Data Analytics": 10,
    "Cisco": 10,
    "Cloudera": 10,
    "Code Maintenance": 10,
    "Code Repository": 10,
    "Collaborate With Internal Team": 10,
    "Collaboration Solutions": 10,
    "Communicating With Business": 10,
    "Competitive Advantage": 10,
    "Conferences": 10,
    "Context Engineering": 10,
    "Continuous Improvement Techniques": 10,
    "Create Documentation": 10,
    "Data Solutions": 10,
    "Data Visualisation": 10,
    "Data Warehousing": 10,
    "Database DevOps": 10,
    "Deployment Automation": 10,
    "Design-Build": 10,
    "Digital and Physical Prototyping": 10,
    "Energy": 10,
    "Enterprise Integration": 10,
    "Experimentation": 10,
    "Feature Engineering": 10,
    "Gemini": 10,
    "Generative AI Innovation, Research and Development, and Innovation Management": 10,
    "Genesys": 10,
    "Hadoop Database": 10,
    "Implemented Code": 10,
    "Innovator": 10,
    "Intelligent Reasoning": 10,
    "Job Descriptions": 10,
    "Large Systems Integration": 10,
    "Liaising with departments": 10,
    "LlamaIndex": 10,
    "Manuscript Development": 10,
    "Microsoft Azure": 10,
    "Mission Critical Systems": 10,
    "Open Source": 10,
    "Open-Source Intelligence (OSINT)": 10,
    "POS": 10,
    "Partner Solutions": 10,
    "Performance Tuning": 10,
    "Power Plants": 10,
    "Practice Development": 10,
    "Productivity Improvement": 10,
    "Professional Experience": 10,
    "Profiling": 10,
    "Project Leadership": 10,
    "Prompt Design": 10,
    "PySpark": 10,
    "React.js": 10,
    "Reinforcement Learning": 10,
    "Reliability Testing": 10,
    "Resolve Technical and Operational Issues": 10,
    "Robust Design": 10,
    "SIP": 10,
    "Saas Solutions": 10,
    "Software Debugging": 10,
    "Software Development Tools": 10,
    "Software Product Development": 10,
    "Software Verification": 10,
    "Software as a Service (SaaS)": 10,
    "Systems Architecture": 10,
    "Technical Development": 10,
    "Technical Infrastructure": 10,
    "Technology Implementation": 10,
    "Training Delivery": 10,
    "Validation": 10,
    "Virtual Production Workflow Design": 10,
    "Virtual Server": 10,
    "Voice Solutions": 10,
    "automation applications": 10,
    "knowledge of the latest developments": 10,
    "leading technical teams": 10,
    "mentorship to junior staff": 10,
    "mid-term adjustments": 10,
    ".NET": 8,
    "AI Content Generation for Visual Art Images": 8,
    "Adobe Edge Animate": 8,
    "Algorithm Development": 8,
    "Alteryx": 8,
    "Android NDK": 8,
    "Apache OpenNLP": 8,
    "Architectural Technology": 8,
    "Audit Tools": 8,
    "Authentication": 8,
    "AutoGen": 8,
    "Automatic Storage and Retrieval System": 8,
    "Autonomous Maintenance": 8,
    "Azure DevOps": 8,
    "Backend Development": 8,
    "Batch Processing": 8,
    "Benchmark Test": 8,
    "Business Analysis Planning": 8,
    "Clustering": 8,
    "Collaborate With Engineers": 8,
    "Compiler": 8,
    "Compression technology": 8,
    "Computer Proficiency": 8,
    "Cybersecurity Engineering": 8,
    "Data Mining": 8,
    "Data Orchestration": 8,
    "Deep Foundations": 8,
    "Develops Software Solutions": 8,
    "Docker": 8,
    "Edge": 8,
    "Enterprise Architecture": 8,
    "Enterprise Software Industry": 8,
    "Extensive Work Experience": 8,
    "Feature Selection": 8,
    "GPT Models": 8,
    "Generative AI Models Technical Aspects of Security and Ethics": 8,
    "Generative AI Models Technical Aspects of Security and Ethics in Financial Services": 8,
    "Generative Model": 8,
    "Image Processing Software": 8,
    "LangChain": 8,
    "Lifecycle Management": 8,
    "Linux": 8,
    "MLOps": 8,
    "Manufacturing Automation": 8,
    "Model Context Protocol (MCP)": 8,
    "Model Driven Development": 8,
    "Ontology": 8,
    "Operations Capability": 8,
    "Performance Management": 8,
    "Problem Identification": 8,
    "Project Management Support": 8,
    "Providing expert advice": 8,
    "Qwen": 8,
    "Reinforcement Learning from Human Feedback (RLHF)": 8,
    "Relational Databases": 8,
    "Reliability Analysis": 8,
    "Representation Learning": 8,
    "Roadmap": 8,
    "Semantic Layer": 8,
    "Semantic Search": 8,
    "SoC": 8,
    "Software Development Methodologies": 8,
    "Stochastic": 8,
    "Supply chain management software": 8,
    "Technical Leadership": 8,
    "Television Research": 8,
    "Testing": 8,
    "Tuning": 8,
    "Workflow Solutions": 8,
    "hardware acceleration": 8,
    "large datasets": 8,
    "Analytical Methods Development": 6,
    "Application Development": 6,
    "Classification": 6,
    "Cloud Services": 6,
    "Collaboration With Stakeholders": 6,
    "Continuous Quality Improvement": 6,
    "Cybersecurity": 6,
    "Dashboards": 6,
    "Data Infrastructure": 6,
    "Debugging": 6,
    "Design of Experiments": 6,
    "Development Tools": 6,
    "Flutter": 6,
    "Full Stack Development": 6,
    "Industry Experience": 6,
    "Information Technology": 6,
    "JavaScript": 6,
    "Liaise With Technical Teams": 6,
    "Low Latency": 6,
    "MCITP": 6,
    "MES": 6,
    "Management": 6,
    "Prescriptive Analytics": 6,
    "Process Modelling": 6,
    "Product Improvement": 6,
    "Product Management": 6,
    "Production Deployment": 6,
    "Regulated Financial Services": 6,
    "SSO": 6,
    "Scala": 6,
    "Scalable Architecture": 6,
    "Site Reliability Engineering": 6,
    "Solution Architecture": 6,
    "Stakeholder Engagement": 6,
    "Statistical Analysis": 6,
    "Technical Design": 6,
    "Technology Planning": 6,
    "TypeScript": 6,
    "Unix Scripting": 6,
    "Workflow": 6,
    "Workflow Analysis": 6,
    "data cube": 6,
    "data integration projects": 6,
    "AIOps": 4,
    "AWS Lambda": 4,
    "Agent Orchestration": 4,
    "Applied Mathematics": 4,
    "Architectural Visualization": 4,
    "Automated Operation Monitoring": 4,
    "Automation Studio": 4,
    "Azure Machine Learning": 4,
    "Back End Infrastructure": 4,
    "Business Optimization": 4,
    "Cloud Infrastructure": 4,
    "Computer Hardware": 4,
    "Creative Thinking": 4,
    "Cross-Functional Team Leadership": 4,
    "Data Analysis": 4,
    "Data Quality Assurance": 4,
    "Database Optimization": 4,
    "Design Patterns": 4,
    "Design for Maintainability": 4,
    "Distillation": 4,
    "ETL Tools": 4,
    "Education": 4,
    "Endpoint Security": 4,
    "Engineering Support": 4,
    "Enterprise Search": 4,
    "Enterprise Systems": 4,
    "Failure Analysis": 4,
    "Failure Modes": 4,
    "Feature-Driven Development": 4,
    "Front-end Development": 4,
    "Function Calling": 4,
    "GPU Programming": 4,
    "GitHub": 4,
    "GitHub Copilot": 4,
    "Hand Tools": 4,
    "Improve Usability": 4,
    "Incident Handling": 4,
    "Interpret Business Needs": 4,
    "LLM Security": 4,
    "LLMOps": 4,
    "Learning Platform": 4,
    "Liaising With Architects": 4,
    "Lifestyle": 4,
    "Mathematical Skills": 4,
    "Mentoring for Developers": 4,
    "Middleware Components": 4,
    "Model Validation": 4,
    "Monitor Kpis": 4,
    "Monitoring Trends": 4,
    "Neural Networks": 4,
    "OEE": 4,
    "OpenAI Codex": 4,
    "Operational Management": 4,
    "Operations": 4,
    "Operations Management": 4,
    "Oracle Machine Learning": 4,
    "Orchestration": 4,
    "Partnerships": 4,
    "Physics": 4,
    "Pico": 4,
    "Pipeline Management": 4,
    "Prediction": 4,
    "Predictive Modeling": 4,
    "Process Engineering": 4,
    "Product Lifecycle Management": 4,
    "Product Strategy": 4,
    "Production System": 4,
    "Project Coordination": 4,
    "Project Team Management": 4,
    "Quantitative Analysis": 4,
    "REST APIs development": 4,
    "Reproducibility": 4,
    "Research Design": 4,
    "Root Cause Analysis": 4,
    "SIEM": 4,
    "Scripting": 4,
    "Service Level Agreement": 4,
    "Single Sign-On": 4,
    "Software": 4,
    "Software Architecture": 4,
    "Software Development Lifecycle": 4,
    "Software Integration": 4,
    "Software Testing": 4,
    "Subject Matter Expert": 4,
    "Technical Skillset": 4,
    "Technological Proficiency": 4,
    "Technology Commercialization": 4,
    "Test Automation": 4,
    "User Interface Design": 4,
    "Validation Procedures": 4,
    "WIP": 4,
    "Work Under Pressure": 4,
    "Work With Product Managers": 4,
    "Workflow Automation": 4,
    "Workflow Software": 4,
    "delivering KPIs": 4,
    "health monitoring software": 4,
    "policies & procedures": 4,
    "requirements assessment": 4,
    "scikit-learn": 4,
    "A/B testing": 2,
    "AI Red Teaming": 2,
    "AOP": 2,
    "API Gateway": 2,
    "ARIMA": 2,
    "ATP": 2,
    "ATS": 2,
    "Access Control Management": 2,
    "Access Control System": 2,
    "Accountability": 2,
    "Accuracy and Precision": 2,
    "Adobe Spark": 2,
    "Adoption": 2,
    "Advanced Engineering": 2,
    "Advanced Robotics": 2,
    "Agile": 2,
    "Agile Delivery": 2,
    "Agile Software Development": 2,
    "Airflow": 2,
    "Algorithm Analysis": 2,
    "Amazon Bedrock": 2,
    "Analyse Product Performance": 2,
    "Analysis of Business Problemsandneeds": 2,
    "Analytics Support": 2,
    "Ansible": 2,
    "Apache Spark": 2,
    "Application Maintenance Support": 2,
    "Architectural Details": 2,
    "Articulate Communicator": 2,
    "Audit Frameworks": 2,
    "Automated Software Testing": 2,
    "Automation Strategy": 2,
    "Automation Tools": 2,
    "Automotive Industry": 2,
    "Autonomous Vehicles": 2,
    "Autonomy iManage": 2,
    "Azure AI Search": 2,
    "Azure OpenAI": 2,
    "BIM (Building Information Modeling)": 2,
    "BIRT (Business Intelligence and Reporting Tools)": 2,
    "Big Data Analytics": 2,
    "Biomedical Devices": 2,
    "Biomedical Sciences": 2,
    "Budget": 2,
    "Bug Fixing": 2,
    "Build Prototypes": 2,
    "Building Science": 2,
    "Business Applications": 2,
    "Business Data Analysis": 2,
    "Business Performance Analysis": 2,
    "Business Requirement Analysis": 2,
    "Business Systems": 2,
    "Business Unit Purchasing": 2,
    "CDM": 2,
    "CMMS": 2,
    "Candidate Screening": 2,
    "Certifications": 2,
    "Clean Code": 2,
    "Clinical Data Management": 2,
    "Cloud Storage": 2,
    "Code Development": 2,
    "Code Review": 2,
    "Collaborating With Product Managers": 2,
    "Commercial Opportunities": 2,
    "Communicating With Agents": 2,
    "Competency Mapping": 2,
    "Component Based Development": 2,
    "Computational Intelligence": 2,
    "Computerized Maintenance Management System": 2,
    "Computing Infrastructure": 2,
    "Concept Development": 2,
    "Confidentiality": 2,
    "Construction": 2,
    "Containerization": 2,
    "Content Ingest Operations": 2,
    "Creating communication strategies": 2,
    "Customer Experience Innovation": 2,
    "Customer Segmentation": 2,
    "Customer Support": 2,
    "DCS": 2,
    "Data Access": 2,
    "Data Acquisition": 2,
    "Data Acquisition System": 2,
    "Data Architecture": 2,
    "Data Center Architecture": 2,
    "Data Exploration": 2,
    "Data Governance": 2,
    "Data Handling": 2,
    "Data Ingestion": 2,
    "Data Integration": 2,
    "Data Integrity": 2,
    "Data Lake": 2,
    "Data Lineage": 2,
    "Data Maintenance": 2,
    "Data Marketing": 2,
    "Data Marts": 2,
    "Data Migration Services": 2,
    "Data Modelling": 2,
    "Data Planning": 2,
    "Data Quality Management": 2,
    "Data Retrieval": 2,
    "Data Services Business": 2,
    "Data Storytelling and Visualisation": 2,
    "Data Structures": 2,
    "Data Transformation": 2,
    "Database Analysis": 2,
    "Database Systems": 2,
    "Decision Support Systems": 2,
    "Develop Business Applications": 2,
    "Development Reviews": 2,
    "Digital Business": 2,
    "Digital Insight & Analytics": 2,
    "Diversity": 2,
    "Drive Awareness": 2,
    "Dynamics": 2,
    "E-Commerce Platforms": 2,
    "E2e Testing": 2,
    "ESP": 2,
    "ETL": 2,
    "Educational Background": 2,
    "Elastic": 2,
    "Electrical": 2,
    "Embedding": 2,
    "Embedding Models": 2,
    "End-User Marketing": 2,
    "Energy Consultancy": 2,
    "Engineering Leadership": 2,
    "Engineering Management": 2,
    "Engineering Opportunities-": 2,
    "Enterprise Applications": 2,
    "Enterprise Valuation": 2,
    "EnterpriseDB": 2,
    "Environmental Monitoring": 2,
    "Equipment Design": 2,
    "Equipment Quality": 2,
    "Equities": 2,
    "Evaluation Methodology": 2,
    "Event-Driven Architecture (EDA)": 2,
    "Exploratory Data Analysis": 2,
    "FOCAL": 2,
    "Facilities Management": 2,
    "FastAPI": 2,
    "Ffmpeg": 2,
    "Financial Services": 2,
    "Focus Groups": 2,
    "Forecasting Models": 2,
    "Foundation Design": 2,
    "Foundations": 2,
    "Front-End Architecture": 2,
    "GCC": 2,
    "GPGPU": 2,
    "GUI Testing Tools": 2,
    "Gather Feedback": 2,
    "Generative AI Model Development and Fine Tuning": 2,
    "Global Engineering": 2,
    "Go to Market Strategies": 2,
    "Google Analytics": 2,
    "Google Cloud": 2,
    "Graduate Recruitment": 2,
    "Hardware Interfacing": 2,
    "Hardware delivery": 2,
    "Healthcare": 2,
    "High Level Architecture": 2,
    "High Speed Ethernet": 2,
    "Identifying New Business Opportunities": 2,
    "Image Classification": 2,
    "Image Processing and Industrial Vision Inspection": 2,
    "Implementation of Best Practices": 2,
    "Implementation of Digital Strategy": 2,
    "Implementing Budgets": 2,
    "Industry Research": 2,
    "Industry Stakeholders": 2,
    "Infiniband": 2,
    "Influencing Key Stakeholders": 2,
    "Infrastructure Automation": 2,
    "Integrated Planning": 2,
    "Integration Modules": 2,
    "Intelligent Agents": 2,
    "Interacting with team members": 2,
    "Interviewing": 2,
    "Issue Escalation": 2,
    "Issue Handling": 2,
    "Iteration Planning": 2,
    "Knowledge Transfer": 2,
    "LEED AP": 2,
    "LSTM": 2,
    "Language Services": 2,
    "Large-scale Data Analysis": 2,
    "Learning Framework Development": 2,
    "Library Science": 2,
    "MES Software": 2,
    "MFC": 2,
    "MLflow": 2,
    "Managing Ambiguity": 2,
    "Mandarin Chinese": 2,
    "Manufacturing Execution Systems": 2,
    "Market Research": 2,
    "Mathematical Modeling": 2,
    "Mechanical Engineering": 2,
    "Mechanical Engineering Management": 2,
    "Medical Degree": 2,
    "Methods&techniques": 2,
    "Metrics": 2,
    "Middleware Solution": 2,
    "Model Based Software Development": 2,
    "Model Quantisation": 2,
    "Modern Architecture": 2,
    "Monetization": 2,
    "MongoDB": 2,
    "Monitor Hardware": 2,
    "Natural Language Programming": 2,
    "Network Performance": 2,
    "New Venture Development": 2,
    "Node.js": 2,
    "OAuth": 2,
    "Object Detection": 2,
    "Online Services": 2,
    "Operational Metrics": 2,
    "Operational Planning": 2,
    "Operational Process Analysis": 2,
    "Operations & Services": 2,
    "Optimize Production Processes": 2,
    "Options Trading": 2,
    "Partnership Development": 2,
    "Pattern Recognition": 2,
    "Patterns": 2,
    "Peer Review": 2,
    "Performance Enhancement": 2,
    "Performance Improvement": 2,
    "Physical Education": 2,
    "Policy Management": 2,
    "Portfolio Administration": 2,
    "PostgreSQL": 2,
    "Potential Risks": 2,
    "Power BI": 2,
    "Predictive Maintenance": 2,
    "Presentation Skills": 2,
    "Product Launch": 2,
    "Production Design": 2,
    "Production Engineering": 2,
    "Production Work": 2,
    "Programming Languages": 2,
    "Programming tools": 2,
    "Project Management": 2,
    "Project Quality Management": 2,
    "Project Status Reporting": 2,
    "Prototype": 2,
    "Quality and Performance": 2,
    "Quick Learning": 2,
    "R Programming": 2,
    "RESTful API": 2,
    "Real-time Simulation": 2,
    "Recommender Systems": 2,
    "Recovery Procedures": 2,
    "Registration": 2,
    "Regression": 2,
    "Regulatory Compliance": 2,
    "Reliability Requirements": 2,
    "Requirements Gathering": 2,
    "Research Methods": 2,
    "Research Support": 2,
    "Researching New Technologies": 2,
    "Resource Allocation": 2,
    "Responsible AI and Generative AI Practices in Financial Services": 2,
    "Retention Management": 2,
    "SQL Programming": 2,
    "Salary Negotiation": 2,
    "Security Compliance": 2,
    "Security Controls": 2,
    "Security Test": 2,
    "Shipping Management": 2,
    "Soft Skills": 2,
    "Software Deployment": 2,
    "Software Design": 2,
    "Software Development": 2,
    "Software Implementation": 2,
    "Software Quality Engineering": 2,
    "Software Standards": 2,
    "Solution Delivery": 2,
    "Spark SQL": 2,
    "Stakeholder Engagement and Management": 2,
    "Statistical Consulting": 2,
    "Statistical Modelling": 2,
    "Statistical forecasting": 2,
    "Storage Layout": 2,
    "Strategic Workforce Planning": 2,
    "System Deployment": 2,
    "System Implementation": 2,
    "System Specification": 2,
    "System Testing": 2,
    "Systems Integration": 2,
    "Systems Thinking Application": 2,
    "Tailwind CSS": 2,
    "Tape": 2,
    "Team Mentoring": 2,
    "Technical Deployment": 2,
    "Technical Instruction": 2,
    "Technical Presentations": 2,
    "Technical Product Development": 2,
    "Technical Project Delivery": 2,
    "Technical Report Writing": 2,
    "Technology Adoption and Innovation": 2,
    "Technology Consulting": 2,
    "Technology Education": 2,
    "Tenancy Management": 2,
    "Tenure": 2,
    "Test Engineering": 2,
    "Time Series Analysis": 2,
    "Time Series Forecasting": 2,
    "Timely Delivery": 2,
    "Tooling": 2,
    "Tools Development": 2,
    "Tools Software": 2,
    "Total Rewards Strategies": 2,
    "Track Record Of Dependability": 2,
    "Training Needs Analysis": 2,
    "Transformer": 2,
    "Transition Planning": 2,
    "Translate Into Technical Requirements": 2,
    "Travel Agency": 2,
    "Travel Technology": 2,
    "Use Case Analysis": 2,
    "User Feedback": 2,
    "User Stories": 2,
    "Vector Search": 2,
    "Virtual Worlds": 2,
    "Web Applications": 2,
    "Windows Azure platform": 2,
    "Work Life Balance": 2,
    "Work Preparation": 2,
    "Workflow Development": 2,
    "Workflow Management": 2,
    "Workflow Orchestration": 2,
    "Working alongside Product Teams": 2,
    "Writing": 2,
    "Written English": 2,
    "Xcode": 2,
    "benchmarking analysis": 2,
    "computational skills": 2,
    "computing solutions": 2,
    "design database schemas": 2,
    "development of test strategies": 2,
    "evaluation of software": 2,
    "governance requirements": 2,
    "implementing monitoring tools": 2,
    "leading stakeholders": 2,
    "operational knowledge": 2,
    "organizational pain-points": 2,
    "product roadmap strategies": 2,
    "requirements from stakeholders": 2,
    "scalable solutions": 2,
    "scientific software": 2,
    "software lifecycle methodologies": 2,
    "software-engineering concepts": 2,
    "support of IT projects": 2,
    "work processes": 2
  },
  "doc_freq": {
    "Design": 665,
    "Development": 552,
    "Python": 551,
    "Software": 444,
    "Pipelines": 373,
    "Programming": 362,
    "Management": 351,
    "Security": 333,
    "AWS": 327,
    "Machine Learning": 322,
    "Governance": 296,
    "LLMs": 291,
    "Data Science": 277,
    "Scalability": 270,
    "Agents": 264,
    "Software Engineering": 230,
    "Kubernetes": 226,
    "CI/CD": 225,
    "Language Models": 223,
    "PyTorch": 223,
    "Evaluation": 220,
    "Monitoring": 217,
    "Optimization": 214,
    "Artificial Intelligence": 210,
    "Testing": 210,
    "API": 205,
    "AI Agents": 200,
    "TensorFlow": 199,
    "Prompt Engineering": 189,
    "Deployment": 165,
    "AI Governance": 154,
    "Deep Learning": 142,
    "Retrieval-Augmented Generation (RAG)": 140,
    "Model Deployment": 128,
    "Workflow": 127,
    "Azure AI": 125,
    "Pinecone": 124,
    "Responsible AI": 124,
    "Model Training": 123,
    "LlamaIndex": 120,
    "Data Engineering": 118,
    "Validation": 117,
    "FAISS": 111,
    "Rest Apis": 111,
    "AI Models": 109,
    "Java": 109,
    "Gemini": 101,
    "GCP": 98,
    "Generative AI": 96,
    "Architecture": 89,
    "Stakeholder Management": 89,
    "Docker": 87,
    "Energy": 85,
    "Computer Vision": 81,
    "MLOps": 79,
    "AutoGen": 76,
    "Model Evaluation": 73,
    "LangChain": 70,
    "SQL": 69,
    "Tuning": 67,
    "Operations": 66,
    "Edge": 64,
    "Feature Engineering": 62,
    "Statistics": 60,
    "Experimentation": 58,
    "Orchestration": 58,
    "C++": 55,
    "Modelling": 55,
    "Knowledge Sharing": 54,
    "Analytical and Problem-Solving Skills": 50,
    "API Development": 46,
    "Metrics": 45,
    "Microsoft Azure": 45,
    "Agile": 43,
    "Mathematics": 43,
    "Software Development": 43,
    "Certifications": 41,
    "Patterns": 41,
    "Dashboards": 40,
    "Google Cloud": 40,
    "Multi-Agent Systems": 39,
    "Roadmap": 39,
    "scikit-learn": 39,
    "Authentication": 38,
    "Google Cloud Platform": 38,
    "Performance Tuning": 38,
    "Application Development": 36,
    "Reinforcement Learning": 34,
    "Information Technology": 33,
    "Scripting": 30,
    "Open Source": 29,
    "Data Solutions": 28,
    "Enterprise Software": 28,
    "TypeScript": 28,
    "Authorization": 27,
    "Benchmarking": 27,
    "Containerization": 26,
    "Data Analysis": 26,
    "Diversity": 26,
    "Coding Standards": 25,
    "PySpark": 25,
    "Stakeholder Engagement": 25,
    "Tooling": 25,
    "Predictive Analytics": 24,
    "Programming Languages": 24,
    "Enterprise Systems": 23,
    "JavaScript": 23,
    "Model Context Protocol (MCP)": 23,
    "Technical Leadership": 23,
    "Workflow Automation": 23,
    "Cloud Technologies": 22,
    "GitHub": 22,
    "Production Deployment": 22,
    "Adoption": 21,
    "Classification": 21,
    "Debugging": 21,
    "Electrical Engineering": 21,
    "Enterprise Applications": 21,
    "Profiling": 21,
    "Azure OpenAI": 20,
    "Chatbot": 20,
    "Data Governance": 20,
    "Financial Services": 20,
    "Partnerships": 20,
    "Conferences": 19,
    "Context Engineering": 19,
    "Product Management": 19,
    "Registration": 19,
    "Writing": 19,
    "Batch Processing": 18,
    "Function Calling": 18,
    "Prototype": 18,
    "Solution Architecture": 18,
    "Subject Matter Expert": 18,
    "AI Safety": 17,
    "Alteryx": 17,
    "Education": 17,
    "FastAPI": 17,
    "Keras": 17,
    "Production Support": 17,
    "Relational Databases": 17,
    "Reproducibility": 17,
    "Scala": 17,
    "leading technical teams": 17,
    "Backend Development": 16,
    "Cloud Services": 16,
    "Design Patterns": 16,
    "Root Cause Analysis": 16,
    "Transformer": 16,
    "Lifecycle Management": 15,
    "Linux": 14,
    "MLflow": 14,
    "Project Management": 14,
    "Data Mining": 13,
    "Predictive Maintenance": 13,
    "Regression": 13,
    "Regulatory Compliance": 13,
    "Build and Deploy": 12,
    "Cloud Deployment": 12,
    "Cloudera": 12,
    "Clustering": 12,
    "Embedding": 12,
    "Professional Experience": 12,
    "SSO": 12,
    "Semantic Search": 12,
    "Soft Skills": 12,
    "Software Development Lifecycle": 12,
    "Technical Design": 12,
    "Cloud Infrastructure": 11,
    "Deployment Automation": 11,
    "Failure Modes": 11,
    "Healthcare": 11,
    "Power BI": 11,
    "Technical Development": 11,
    "scalable solutions": 11,
    "AI Evaluation": 10,
    "Academic Writing": 10,
    "Accountability": 10,
    "Azure AI Search": 10,
    "Business Applications": 10,
    "Cisco": 10,
    "Cost Management": 10,
    "Data Visualisation": 10,
    "Data Warehousing": 10,
    "Fine Tuning": 10,
    "Genesys": 10,
    "Intelligent Reasoning": 10,
    "LLMOps": 10,
    "Node.js": 10,
    "Prediction": 10,
    "Security Controls": 10,
    "SoC": 10,
    "Software Verification": 10,
    "Stochastic": 10,
    "User Feedback": 10,
    "Data Ingestion": 9,
    "ETL": 9,
    "Electrical": 9,
    "MES": 9,
    "Platform Modernization": 9,
    "large datasets": 9,
    "Competitive Advantage": 8,
    "Compiler": 8,
    "Cybersecurity": 8,
    "Data Pipeline": 8,
    "Data Transformation": 8,
    "Development Tools": 8,
    "Distillation": 8,
    "Enterprise Architecture": 8,
    "Industry Experience": 8,
    "Learning Platform": 8,
    "Middleware Components": 8,
    "Natural Language Processing": 8,
    "Prescriptive Analytics": 8,
    "Qwen": 8,
    "Representation Learning": 8,
    "Single Sign-On": 8,
    "Statistical Modelling": 8,
    "Vector Search": 8,
    "Web Applications": 8,
    "API Gateway": 7,
    "Applied Mathematics": 7,
    "Data Access": 7,
    "Data Architecture": 7,
    "Data Structures": 7,
    "MongoDB": 7,
    "PostgreSQL": 7,
    "Product Strategy": 7,
    "Site Reliability Engineering": 7,
    "Technology Consulting": 7,
    ".NET": 6,
    "AIOps": 6,
    "ATS": 6,
    "Agent Orchestration": 6,
    "Airflow": 6,
    "Data Integration": 6,
    "Data Retrieval": 6,
    "Design of Experiments": 6,
    "Endpoint Security": 6,
    "Flutter": 6,
    "GitHub Copilot": 6,
    "Physics": 6,
    "Presentation Skills": 6,
    "Tailwind CSS": 6,
    "User Stories": 6,
    "Workflow Orchestration": 6,
    "data cube": 6,
    "Automation Tools": 5,
    "Construction": 5,
    "Customer Segmentation": 5,
    "Data Infrastructure": 5,
    "Data Modelling": 5,
    "Educational Background": 5,
    "Embedding Models": 5,
    "Full Stack Development": 5,
    "Global Engineering": 5,
    "Incident Handling": 5,
    "Innovator": 5,
    "Knowledge Transfer": 5,
    "Neural Networks": 5,
    "Object Detection": 5,
    "Operational Metrics": 5,
    "Prompt Design": 5,
    "SIEM": 5,
    "Test Automation": 5,
    "AI Red Teaming": 4,
    "Agile Delivery": 4,
    "Azure DevOps": 4,
    "Budget": 4,
    "Build Prototypes": 4,
    "Clean Code": 4,
    "Code Review": 4,
    "Customer Support": 4,
    "Enterprise Search": 4,
    "Exploratory Data Analysis": 4,
    "Foundations": 4,
    "Front-end Development": 4,
    "Image Classification": 4,
    "Improve Usability": 4,
    "LSTM": 4,
    "Mathematical Skills": 4,
    "OEE": 4,
    "Pico": 4,
    "Software Architecture": 4,
    "Solution Delivery": 4,
    "WIP": 4,
    "governance requirements": 4,
    "A/B testing": 3,
    "Agile Software Development": 3,
    "Apache Spark": 3,
    "Bug Fixing": 3,
    "Data Lake": 3,
    "Database Systems": 3,
    "Platform Management": 3,
    "Potential Risks": 3,
    "Software Design": 3,
    "Timely Delivery": 3,
    "AOP": 2,
    "ARIMA": 2,
    "ATP": 2,
    "Algorithm Development": 2,
    "Ansible": 2,
    "Automotive Industry": 2,
    "Autonomous Vehicles": 2,
    "Azure Machine Learning": 2,
    "Big Data Analytics": 2,
    "Business Systems": 2,
    "CMMS": 2,
    "Candidate Screening": 2,
    "Commercial Opportunities": 2,
    "Confidentiality": 2,
    "DCS": 2,
    "Data Acquisition": 2,
    "Data Exploration": 2,
    "Data Marts": 2,
    "ESP": 2,
    "Engineering Management": 2,
    "Engineering Support": 2,
    "Environmental Monitoring": 2,
    "Equities": 2,
    "Facilities Management": 2,
    "Feature Selection": 2,
    "Ffmpeg": 2,
    "Forecasting Models": 2,
    "Infiniband": 2,
    "Infrastructure Automation": 2,
    "Intelligent Agents": 2,
    "LEED AP": 2,
    "Lifestyle": 2,
    "Market Research": 2,
    "Model Validation": 2,
    "Monetization": 2,
    "Peer Review": 2,
    "Performance Management": 2,
    "Pipeline Development": 2,
    "Product Launch": 2,
    "Quantitative Analysis": 2,
    "RESTful API": 2,
    "Recommender Systems": 2,
    "Resource Allocation": 2,
    "Software Development Tools": 2,
    "Software Integration": 2,
    "Software Testing": 2,
    "Software as a Service (SaaS)": 2,
    "Storage Layout": 2,
    "System Testing": 2,
    "Technical Infrastructure": 2,
    "Tenure": 2,
    "Time Series Analysis": 2,
    "Validation Procedures": 2,
    "operational knowledge": 2,
    "scientific software": 2,
    "Data Handling": 1,
    "Dynamics": 1,
    "Engineering Leadership": 1,
    "FOCAL": 1,
    "Mechanical Engineering": 1,
    "Production Engineering": 1,
    "Programming tools": 1,
    "Project Leadership": 1,
    "Real-time Simulation": 1,
    "Reliability Requirements": 1,
    "Research Methods": 1,
    "Spark SQL": 1,
    "Written English": 1
  }
}