{
  "_written_by": "skill_extract.py",
  "_comment": "Skill vocabulary harvested from MyCareersFuture's structured tags, used to read skills out of descriptions from sources that publish none. `doc_freq` counts how many descriptions each term appeared in -- terms common enough to be filler are filtered out at extraction time. Safe to delete; it rebuilds from the next fetch.",
  "term_count": 904,
  "documents": 833,
  "terms": {
    "AI Agents": 178,
    "Artificial Intelligence": 153,
    "Design": 150,
    "LLMs": 129,
    "Machine Learning": 120,
    "Python": 116,
    "Data Science": 106,
    "Azure AI": 94,
    "Generative AI Application Development and Deployment": 89,
    "AI Safety": 88,
    "Language Models": 86,
    "AI Evaluation": 80,
    "Retrieval-Augmented Generation (RAG)": 78,
    "Kubernetes": 75,
    "Liaising with cross functional teams": 73,
    "Development": 62,
    "Enterprise Integration Solution": 60,
    "CI/CD": 58,
    "Prompt Engineering": 56,
    "Scalability": 52,
    "Fine Tuning": 51,
    "Chatbot": 50,
    "Programming": 49,
    "Cost Management": 48,
    "PyTorch": 47,
    "Engaging Stakeholders": 45,
    "Security": 44,
    "AWS": 42,
    "Enterprise Software": 42,
    "Data Pipeline": 41,
    "Generative AI Model Evaluation": 40,
    "Governance": 40,
    "Liaising With Internal Stakeholders": 40,
    "Modelling": 40,
    "Operational Workflow": 40,
    "Responsible AI": 40,
    "Rest Apis": 40,
    "TensorFlow": 40,
    "AI Models": 39,
    "Java": 39,
    "Pinecone": 38,
    "Artificial Intelligence Application": 37,
    "Model Deployment": 36,
    "C++": 30,
    "Deep Learning": 30,
    "Platform Management": 30,
    "Data Engineering": 29,
    "Pipelines": 28,
    "Model Training": 27,
    "GCP": 26,
    "Google Cloud Platform": 26,
    "Natural Language Processing": 25,
    "AI Governance": 24,
    "Automation Management in Product Development": 22,
    "API Development": 21,
    "Benchmarking": 21,
    "Computer Vision": 21,
    "Knowledge Sharing": 21,
    "Analytical and Problem-Solving Skills": 20,
    "Algorithm Optimization": 19,
    "Deployment": 19,
    "Evaluation": 19,
    "SQL": 19,
    "Cloud Deployment": 18,
    "Docker Container": 18,
    "FAISS": 18,
    "Software Engineering": 18,
    "Statistics": 18,
    "Model Evaluation": 17,
    "Stakeholder Management": 17,
    "Artificial Intelligence Ethics and Governance": 16,
    "Optimization": 16,
    "integrated workflow": 16,
    "Agent Management System": 15,
    "Agents": 15,
    "Generative AI": 15,
    "Leadership": 15,
    "Mathematics": 15,
    "Multi-Agent Systems": 15,
    "Process Flows": 15,
    "Statistical Knowledge": 15,
    "Teamwork": 15,
    "Utility Industry": 15,
    "Collaboration": 14,
    "Continuous Improvement Techniques": 14,
    "Cross Functional Project Management": 14,
    "Monitoring": 14,
    "Predictive Analytics": 14,
    "Production Support": 14,
    "Generative AI Application Development and Deployment in Financial Services": 13,
    "Reinforcement Learning": 13,
    "Reporting": 13,
    "Technology Expertise": 13,
    "large datasets": 13,
    "Architecture": 12,
    "Authorization": 12,
    "Build and Deploy": 12,
    "Cloud Technologies": 12,
    "Coding Standards": 12,
    "Collaborate With Engineers": 12,
    "Collaboration Solutions": 12,
    "Communication": 12,
    "Data Mining": 12,
    "Electrical Engineering": 12,
    "Enterprise Security Solutions": 12,
    "Ethical and Responsible Generative AI Adoption": 12,
    "Generative AI Prompt Engineering": 12,
    "Keras": 12,
    "Knowledge Database": 12,
    "Pipeline Development": 12,
    "Platform Modernization": 12,
    "Vision Language Models (VLMs)": 12,
    "Work in A Fast Paced Environment": 12,
    "Big Data Framework": 11,
    "Cloudera": 11,
    "Create Documentation": 11,
    "Data Solutions": 11,
    "Data Warehousing": 11,
    "Experimentation": 11,
    "Hadoop Database": 11,
    "Large Systems Integration": 11,
    "Power Plants": 11,
    "Project Leadership": 11,
    "Prompt Design": 11,
    "PySpark": 11,
    "Reliability Testing": 11,
    "Software Debugging": 11,
    "Virtual Server": 11,
    "knowledge of the latest developments": 11,
    "mid-term adjustments": 11,
    "API": 10,
    "Academic Writing": 10,
    "Adversarial Machine Learning": 10,
    "Agentic Memory Management": 10,
    "Application Architecture": 10,
    "Business Intelligence and Data Analytics": 10,
    "Cisco": 10,
    "Code Maintenance": 10,
    "Code Repository": 10,
    "Collaborate With Internal Team": 10,
    "Communicating With Business": 10,
    "Competitive Advantage": 10,
    "Conferences": 10,
    "Context Engineering": 10,
    "Data Visualisation": 10,
    "Database DevOps": 10,
    "Deep Foundations": 10,
    "Deployment Automation": 10,
    "Design-Build": 10,
    "Digital and Physical Prototyping": 10,
    "Docker": 10,
    "Energy": 10,
    "Enterprise Integration": 10,
    "Feature Engineering": 10,
    "Gemini": 10,
    "Generative AI Innovation, Research and Development, and Innovation Management": 10,
    "Genesys": 10,
    "Implemented Code": 10,
    "Innovator": 10,
    "Intelligent Reasoning": 10,
    "Job Descriptions": 10,
    "Liaising with departments": 10,
    "LlamaIndex": 10,
    "Manuscript Development": 10,
    "Microsoft Azure": 10,
    "Mission Critical Systems": 10,
    "Model Driven Development": 10,
    "Open Source": 10,
    "Open-Source Intelligence (OSINT)": 10,
    "POS": 10,
    "Partner Solutions": 10,
    "Performance Tuning": 10,
    "Practice Development": 10,
    "Productivity Improvement": 10,
    "Professional Experience": 10,
    "Profiling": 10,
    "React.js": 10,
    "Resolve Technical and Operational Issues": 10,
    "Robust Design": 10,
    "SIP": 10,
    "Saas Solutions": 10,
    "Software Development Tools": 10,
    "Software Product Development": 10,
    "Software Verification": 10,
    "Software as a Service (SaaS)": 10,
    "Systems Architecture": 10,
    "Technical Development": 10,
    "Technical Infrastructure": 10,
    "Technology Implementation": 10,
    "Training Delivery": 10,
    "Validation": 10,
    "Virtual Production Workflow Design": 10,
    "Voice Solutions": 10,
    "automation applications": 10,
    "leading technical teams": 10,
    "mentorship to junior staff": 10,
    "Adobe Edge Animate": 9,
    "Android NDK": 9,
    "Architectural Technology": 9,
    "Azure DevOps": 9,
    "Compiler": 9,
    "Compression technology": 9,
    "Data Orchestration": 9,
    "Data Structures": 9,
    "Extensive Work Experience": 9,
    "Feature Selection": 9,
    "LangChain": 9,
    "Linux": 9,
    "Performance Management": 9,
    "Problem Identification": 9,
    "Providing expert advice": 9,
    "Reinforcement Learning from Human Feedback (RLHF)": 9,
    "Representation Learning": 9,
    "Software Development Methodologies": 9,
    "Stochastic": 9,
    "hardware acceleration": 9,
    ".NET": 8,
    "AI Content Generation for Visual Art Images": 8,
    "Algorithm Development": 8,
    "Alteryx": 8,
    "Apache OpenNLP": 8,
    "Audit Tools": 8,
    "Authentication": 8,
    "AutoGen": 8,
    "Automatic Storage and Retrieval System": 8,
    "Autonomous Maintenance": 8,
    "Backend Development": 8,
    "Batch Processing": 8,
    "Benchmark Test": 8,
    "Business Analysis Planning": 8,
    "Clustering": 8,
    "Computer Proficiency": 8,
    "Cybersecurity Engineering": 8,
    "Develops Software Solutions": 8,
    "Edge": 8,
    "Enterprise Architecture": 8,
    "Enterprise Software Industry": 8,
    "GPT Models": 8,
    "Generative AI Models Technical Aspects of Security and Ethics": 8,
    "Generative AI Models Technical Aspects of Security and Ethics in Financial Services": 8,
    "Generative Model": 8,
    "Image Processing Software": 8,
    "Lifecycle Management": 8,
    "MLOps": 8,
    "Manufacturing Automation": 8,
    "Model Context Protocol (MCP)": 8,
    "Ontology": 8,
    "Operations Capability": 8,
    "Problem Solving": 8,
    "Project Management Support": 8,
    "Qwen": 8,
    "Relational Databases": 8,
    "Reliability Analysis": 8,
    "Roadmap": 8,
    "Semantic Layer": 8,
    "Semantic Search": 8,
    "SoC": 8,
    "Supply chain management software": 8,
    "Technical Leadership": 8,
    "Television Research": 8,
    "Testing": 8,
    "Troubleshooting": 8,
    "Tuning": 8,
    "Workflow Solutions": 8,
    "Collaboration With Stakeholders": 7,
    "Data Infrastructure": 7,
    "Debugging": 7,
    "Development Tools": 7,
    "Liaise With Technical Teams": 7,
    "Management": 7,
    "Scala": 7,
    "Software Development": 7,
    "Stakeholder Engagement": 7,
    "Statistical Analysis": 7,
    "Workflow": 7,
    "Workflow Analysis": 7,
    "Analytical Methods Development": 6,
    "Analytical Skills": 6,
    "Application Development": 6,
    "Classification": 6,
    "Cloud Services": 6,
    "Continuous Quality Improvement": 6,
    "Cybersecurity": 6,
    "Dashboards": 6,
    "Design of Experiments": 6,
    "Flutter": 6,
    "Full Stack Development": 6,
    "Industry Experience": 6,
    "Information Technology": 6,
    "JavaScript": 6,
    "Low Latency": 6,
    "MCITP": 6,
    "MES": 6,
    "Model Validation": 6,
    "Prediction": 6,
    "Prescriptive Analytics": 6,
    "Process Modelling": 6,
    "Product Improvement": 6,
    "Product Management": 6,
    "Production Deployment": 6,
    "Regulated Financial Services": 6,
    "SSO": 6,
    "Scalable Architecture": 6,
    "Scripting": 6,
    "Site Reliability Engineering": 6,
    "Solution Architecture": 6,
    "Technical Design": 6,
    "Technology Planning": 6,
    "TypeScript": 6,
    "Unix Scripting": 6,
    "data cube": 6,
    "data integration projects": 6,
    "Azure Machine Learning": 5,
    "Business Optimization": 5,
    "Business Requirement Analysis": 5,
    "C Language": 5,
    "Engineering Support": 5,
    "Hand Tools": 5,
    "Partnerships": 5,
    "Subject Matter Expert": 5,
    "requirements assessment": 5,
    "scikit-learn": 5,
    "AIOps": 4,
    "AWS Lambda": 4,
    "Agent Orchestration": 4,
    "Analysis of Business Problemsandneeds": 4,
    "Applied Mathematics": 4,
    "Architectural Visualization": 4,
    "Automated Operation Monitoring": 4,
    "Automation Studio": 4,
    "Back End Infrastructure": 4,
    "Cloud Infrastructure": 4,
    "Computer Hardware": 4,
    "Creative Thinking": 4,
    "Cross-Functional Team Leadership": 4,
    "DBMS": 4,
    "Data Analysis": 4,
    "Data Governance": 4,
    "Data Quality Assurance": 4,
    "Database Optimization": 4,
    "Design Patterns": 4,
    "Design for Maintainability": 4,
    "Distillation": 4,
    "Documentation": 4,
    "ETL Tools": 4,
    "Education": 4,
    "Efficiency": 4,
    "Endpoint Security": 4,
    "Enterprise Search": 4,
    "Enterprise Systems": 4,
    "Failure Analysis": 4,
    "Failure Modes": 4,
    "Feature-Driven Development": 4,
    "Front-end Development": 4,
    "Function Calling": 4,
    "GPU Programming": 4,
    "GitHub": 4,
    "GitHub Copilot": 4,
    "Improve Usability": 4,
    "Incident Handling": 4,
    "Initiative": 4,
    "Interpret Business Needs": 4,
    "LLM Security": 4,
    "LLMOps": 4,
    "Learning Platform": 4,
    "Liaising With Architects": 4,
    "Lifestyle": 4,
    "Mathematical Skills": 4,
    "Mentoring for Developers": 4,
    "Middleware Components": 4,
    "Monitor Kpis": 4,
    "Monitoring Trends": 4,
    "Neural Networks": 4,
    "OEE": 4,
    "OpenAI Codex": 4,
    "Operational Management": 4,
    "Operations": 4,
    "Operations Management": 4,
    "Oracle Machine Learning": 4,
    "Orchestration": 4,
    "Physics": 4,
    "Pico": 4,
    "Pipeline Management": 4,
    "Predictive Modeling": 4,
    "Process Engineering": 4,
    "Product Lifecycle Management": 4,
    "Product Strategy": 4,
    "Production System": 4,
    "Project Coordination": 4,
    "Project Team Management": 4,
    "Quantitative Analysis": 4,
    "REST APIs development": 4,
    "Reproducibility": 4,
    "Research Design": 4,
    "Root Cause Analysis": 4,
    "SIEM": 4,
    "Service Level Agreement": 4,
    "Single Sign-On": 4,
    "Software": 4,
    "Software Architecture": 4,
    "Software Development Lifecycle": 4,
    "Software Integration": 4,
    "Software Testing": 4,
    "Technical Skillset": 4,
    "Technological Proficiency": 4,
    "Technology Commercialization": 4,
    "Test Automation": 4,
    "User Interface Design": 4,
    "Validation Procedures": 4,
    "WIP": 4,
    "Work Under Pressure": 4,
    "Work With Product Managers": 4,
    "Workflow Automation": 4,
    "Workflow Software": 4,
    "delivering KPIs": 4,
    "health monitoring software": 4,
    "policies & procedures": 4,
    "A/B testing": 3,
    "Advanced Robotics": 3,
    "CVS": 3,
    "Containerization": 3,
    "Data Quality Management": 3,
    "Development Reviews": 3,
    "Electrical": 3,
    "Hardware delivery": 3,
    "Interpersonal Skills": 3,
    "Large-scale Data Analysis": 3,
    "Monetization": 3,
    "Performance Improvement": 3,
    "Physical Education": 3,
    "Power BI": 3,
    "Problem Analysis": 3,
    "Recommender Systems": 3,
    "Researching New Technologies": 3,
    "Resource Allocation": 3,
    "Software Deployment": 3,
    "System Deployment": 3,
    "Tenure": 3,
    "Therapeutic Areas": 3,
    "Tooling": 3,
    "Total Rewards Strategies": 3,
    "Virtual Worlds": 3,
    "Working alongside Product Teams": 3,
    "scalable solutions": 3,
    "ACL": 2,
    "ACMS": 2,
    "AI Red Teaming": 2,
    "AOP": 2,
    "API Gateway": 2,
    "ARIMA": 2,
    "ATP": 2,
    "ATS": 2,
    "Access Control Management": 2,
    "Access Control System": 2,
    "Accountability": 2,
    "Accuracy and Precision": 2,
    "Adaptability": 2,
    "Adobe Spark": 2,
    "Adoption": 2,
    "Advanced Engineering": 2,
    "Agile": 2,
    "Agile & Waterfall Methodologies": 2,
    "Agile Delivery": 2,
    "Agile Software Development": 2,
    "Airflow": 2,
    "Algorithm Analysis": 2,
    "Algorithms": 2,
    "Amazon Bedrock": 2,
    "Analyse Product Performance": 2,
    "Analytical Approach": 2,
    "Analytics Support": 2,
    "Ansible": 2,
    "Apache Spark": 2,
    "Application Maintenance Support": 2,
    "Applications Integration": 2,
    "Architectural Details": 2,
    "Articulate Communicator": 2,
    "Audit Frameworks": 2,
    "Automated Software Testing": 2,
    "Automation Strategy": 2,
    "Automation Tools": 2,
    "Automotive Industry": 2,
    "Autonomous Vehicles": 2,
    "Autonomy iManage": 2,
    "Azure AI Search": 2,
    "Azure OpenAI": 2,
    "BDD": 2,
    "BIM (Building Information Modeling)": 2,
    "BIRT (Business Intelligence and Reporting Tools)": 2,
    "Big Data Analytics": 2,
    "Biomedical Devices": 2,
    "Biomedical Sciences": 2,
    "Budget": 2,
    "Bug Fixing": 2,
    "Build Prototypes": 2,
    "Building Science": 2,
    "Business Applications": 2,
    "Business Data Analysis": 2,
    "Business Performance Analysis": 2,
    "Business Systems": 2,
    "Business Unit Purchasing": 2,
    "CDM": 2,
    "CMMS": 2,
    "CPT": 2,
    "Candidate Screening": 2,
    "Certifications": 2,
    "Clean Code": 2,
    "Clinical Data Management": 2,
    "Cloud Storage": 2,
    "Code Development": 2,
    "Code Review": 2,
    "Collaborating With Product Managers": 2,
    "Commercial Opportunities": 2,
    "Communicating With Agents": 2,
    "Competency Mapping": 2,
    "Complex Data Sources": 2,
    "Component Based Development": 2,
    "Computational Intelligence": 2,
    "Computer Programming": 2,
    "Computerized Maintenance Management System": 2,
    "Computing Infrastructure": 2,
    "Concept Development": 2,
    "Confidentiality": 2,
    "Construction": 2,
    "Content Ingest Operations": 2,
    "Creating communication strategies": 2,
    "Customer Experience Innovation": 2,
    "Customer Segmentation": 2,
    "Customer Support": 2,
    "DCS": 2,
    "Data Access": 2,
    "Data Acquisition": 2,
    "Data Acquisition System": 2,
    "Data Architecture": 2,
    "Data Center Architecture": 2,
    "Data Exploration": 2,
    "Data Handling": 2,
    "Data Ingestion": 2,
    "Data Integration": 2,
    "Data Integrity": 2,
    "Data Lake": 2,
    "Data Lineage": 2,
    "Data Maintenance": 2,
    "Data Marketing": 2,
    "Data Marts": 2,
    "Data Migration Services": 2,
    "Data Modelling": 2,
    "Data Planning": 2,
    "Data Retrieval": 2,
    "Data Services Business": 2,
    "Data Storytelling and Visualisation": 2,
    "Data Transformation": 2,
    "Data Wrangling": 2,
    "Database Administration": 2,
    "Database Analysis": 2,
    "Database Systems": 2,
    "Decision Support Systems": 2,
    "Develop Business Applications": 2,
    "Digital Business": 2,
    "Digital Insight & Analytics": 2,
    "Diversity": 2,
    "Drive Awareness": 2,
    "Dynamics": 2,
    "E-Commerce": 2,
    "E-Commerce Platforms": 2,
    "E2e Testing": 2,
    "EDA": 2,
    "ESP": 2,
    "ETL": 2,
    "Educational Background": 2,
    "Elastic": 2,
    "Embedding": 2,
    "Embedding Models": 2,
    "End-User Marketing": 2,
    "Energy Consultancy": 2,
    "Engineering Leadership": 2,
    "Engineering Management": 2,
    "Engineering Opportunities-": 2,
    "Enterprise Applications": 2,
    "Enterprise Valuation": 2,
    "EnterpriseDB": 2,
    "Environmental Monitoring": 2,
    "Equipment Design": 2,
    "Equipment Quality": 2,
    "Equities": 2,
    "Evaluation Methodology": 2,
    "Event-Driven Architecture (EDA)": 2,
    "Exploratory Data Analysis": 2,
    "FOCAL": 2,
    "Facilities Management": 2,
    "Fast-paced": 2,
    "FastAPI": 2,
    "Ffmpeg": 2,
    "Financial Services": 2,
    "Focus Groups": 2,
    "Forecasting Models": 2,
    "Foundation Design": 2,
    "Foundations": 2,
    "Front-End Architecture": 2,
    "GCC": 2,
    "GPGPU": 2,
    "GUI Testing Tools": 2,
    "Gather Feedback": 2,
    "Generative AI Model Development and Fine Tuning": 2,
    "Global E-commerce": 2,
    "Global Engineering": 2,
    "Go to Market Strategies": 2,
    "Google Analytics": 2,
    "Google Cloud": 2,
    "Graduate Recruitment": 2,
    "Hardware Interfacing": 2,
    "Healthcare": 2,
    "High Level Architecture": 2,
    "High Speed Ethernet": 2,
    "Hyperparameter Tuning": 2,
    "Identifying New Business Opportunities": 2,
    "Image Classification": 2,
    "Image Processing and Industrial Vision Inspection": 2,
    "Implementation of Best Practices": 2,
    "Implementation of Digital Strategy": 2,
    "Implementing Budgets": 2,
    "Industry Research": 2,
    "Industry Stakeholders": 2,
    "Infiniband": 2,
    "Influencing Key Stakeholders": 2,
    "Information Retrieval": 2,
    "Infrastructure Automation": 2,
    "Integrated Planning": 2,
    "Integration Modules": 2,
    "Intelligent Agents": 2,
    "Interacting with team members": 2,
    "Interviewing": 2,
    "Issue Escalation": 2,
    "Issue Handling": 2,
    "Iteration Planning": 2,
    "Knowledge Transfer": 2,
    "LEED AP": 2,
    "LSTM": 2,
    "Language Services": 2,
    "Learning Framework Development": 2,
    "Library Science": 2,
    "MES Software": 2,
    "MFC": 2,
    "MLflow": 2,
    "Managing Ambiguity": 2,
    "Mandarin Chinese": 2,
    "Manufacturing Execution Systems": 2,
    "Market Research": 2,
    "Mathematical Modeling": 2,
    "Mechanical Engineering": 2,
    "Mechanical Engineering Management": 2,
    "Medical Degree": 2,
    "Methods&techniques": 2,
    "Metrics": 2,
    "Middleware Solution": 2,
    "Model Based Software Development": 2,
    "Model Quantisation": 2,
    "Modern Architecture": 2,
    "MongoDB": 2,
    "Monitor Hardware": 2,
    "Multimodal AI": 2,
    "Multitasking": 2,
    "Natural Language Programming": 2,
    "Network Performance": 2,
    "New Venture Development": 2,
    "Node.js": 2,
    "OAuth": 2,
    "Object Detection": 2,
    "Onboarding": 2,
    "Online Advertising": 2,
    "Online Services": 2,
    "Operational Metrics": 2,
    "Operational Planning": 2,
    "Operational Process Analysis": 2,
    "Operations & Services": 2,
    "Optimize Production Processes": 2,
    "Options Trading": 2,
    "Partnership Development": 2,
    "Passionate about Work": 2,
    "Pattern Recognition": 2,
    "Patterns": 2,
    "Peer Review": 2,
    "Performance Enhancement": 2,
    "Policy Management": 2,
    "Portfolio Administration": 2,
    "PostgreSQL": 2,
    "Potential Risks": 2,
    "Predictive Maintenance": 2,
    "Presentation Skills": 2,
    "Product Launch": 2,
    "Production Design": 2,
    "Production Engineering": 2,
    "Production Environment": 2,
    "Production Work": 2,
    "Programming Languages": 2,
    "Programming tools": 2,
    "Project Management": 2,
    "Project Quality Management": 2,
    "Project Status Reporting": 2,
    "Prototype": 2,
    "Quality and Performance": 2,
    "Quick Learning": 2,
    "R Programming": 2,
    "RESTful API": 2,
    "Real-time Simulation": 2,
    "Recovery Procedures": 2,
    "Registration": 2,
    "Regression": 2,
    "Regulatory Compliance": 2,
    "Reliability Requirements": 2,
    "Requirements Gathering": 2,
    "Research Methods": 2,
    "Research Support": 2,
    "Responsible AI and Generative AI Practices in Financial Services": 2,
    "Retention Management": 2,
    "Running": 2,
    "SQL Programming": 2,
    "Salary Negotiation": 2,
    "Scripting Languages": 2,
    "Search Algorithm": 2,
    "Security Compliance": 2,
    "Security Controls": 2,
    "Security Test": 2,
    "Shipping Management": 2,
    "Soft Skills": 2,
    "Software Design": 2,
    "Software Implementation": 2,
    "Software Quality Engineering": 2,
    "Software Standards": 2,
    "Solution Delivery": 2,
    "Spark SQL": 2,
    "Stakeholder Engagement and Management": 2,
    "Statistical Consulting": 2,
    "Statistical Modelling": 2,
    "Statistical forecasting": 2,
    "Storage Layout": 2,
    "Strategic Workforce Planning": 2,
    "System Implementation": 2,
    "System Specification": 2,
    "System Testing": 2,
    "Systems Integration": 2,
    "Systems Thinking Application": 2,
    "Tailwind CSS": 2,
    "Tape": 2,
    "Team Mentoring": 2,
    "Technical Consultation": 2,
    "Technical Deployment": 2,
    "Technical Instruction": 2,
    "Technical Presentations": 2,
    "Technical Product Development": 2,
    "Technical Project Delivery": 2,
    "Technical Report Writing": 2,
    "Technology Adoption and Innovation": 2,
    "Technology Consulting": 2,
    "Technology Education": 2,
    "Tenancy Management": 2,
    "Test Engineering": 2,
    "Time Series Analysis": 2,
    "Time Series Forecasting": 2,
    "Timely Delivery": 2,
    "Tools Development": 2,
    "Tools Software": 2,
    "Track Record Of Dependability": 2,
    "Training": 2,
    "Training Needs Analysis": 2,
    "Transformer": 2,
    "Transition Planning": 2,
    "Translate Into Technical Requirements": 2,
    "Travel Agency": 2,
    "Travel Technology": 2,
    "Use Case Analysis": 2,
    "User Feedback": 2,
    "User Stories": 2,
    "Vector Search": 2,
    "Web Applications": 2,
    "Windows Azure platform": 2,
    "Work Life Balance": 2,
    "Work Preparation": 2,
    "Workflow Development": 2,
    "Workflow Management": 2,
    "Workflow Orchestration": 2,
    "Writing": 2,
    "Written English": 2,
    "Xcode": 2,
    "benchmarking analysis": 2,
    "computational skills": 2,
    "computing solutions": 2,
    "conference papers": 2,
    "design database schemas": 2,
    "development of test strategies": 2,
    "evaluation of software": 2,
    "governance requirements": 2,
    "implementing monitoring tools": 2,
    "leading stakeholders": 2,
    "operational knowledge": 2,
    "organizational pain-points": 2,
    "product roadmap strategies": 2,
    "requirements from stakeholders": 2,
    "scientific software": 2,
    "software lifecycle methodologies": 2,
    "software-engineering concepts": 2,
    "support of IT projects": 2,
    "work processes": 2,
    "APAC": 1,
    "Application Deployment": 1,
    "Archtics": 1,
    "Assisting Executives": 1,
    "Audio": 1,
    "Build Automation": 1,
    "Business Impact Analysis": 1,
    "Business Understanding": 1,
    "COM": 1,
    "Capacity Planning": 1,
    "Collaborative Filtering": 1,
    "Commodities": 1,
    "Competitive Strategies": 1,
    "Conceptualization": 1,
    "Container Operations": 1,
    "Content Security": 1,
    "Core Analysis": 1,
    "Creative Solutions": 1,
    "Creativity": 1,
    "CrewAI": 1,
    "Customer Retention": 1,
    "Data Warehouse Systems": 1,
    "Deliver Ongoing Business Intelligence": 1,
    "Demand and Supply Analysis": 1,
    "Developing Skills": 1,
    "Digital Image Processing": 1,
    "Digital Scanner": 1,
    "E-Commerce Strategy": 1,
    "Ecosystem Services": 1,
    "Factor Analysis": 1,
    "Factoring": 1,
    "GMP Environment": 1,
    "Git": 1,
    "High Availability": 1,
    "Hive": 1,
    "IBM Cloud or Watson": 1,
    "Idea Generation": 1,
    "Improve User Experience": 1,
    "Industrial Engineering": 1,
    "Information Literacy": 1,
    "Information Visualization": 1,
    "Innovation": 1,
    "International Conferences": 1,
    "Journals": 1,
    "Key Management": 1,
    "LangGraph": 1,
    "Live Video Streaming": 1,
    "Logistic Regression": 1,
    "Logistics": 1,
    "Mining": 1,
    "NIR": 1,
    "NumPy": 1,
    "Online Video Marketing": 1,
    "OpenCV": 1,
    "Organisational Strategy Formulation": 1,
    "Organization and Coordination Skills": 1,
    "Pain Management": 1,
    "Pandas": 1,
    "Personalization": 1,
    "Photo Research": 1,
    "Photojournalism": 1,
    "Precipitation": 1,
    "Pricing Strategy": 1,
    "Privacy Law": 1,
    "Proactive": 1,
    "Relationship Building": 1,
    "Replenishment": 1,
    "Represent team": 1,
    "Resolving Product Problems": 1,
    "Response Rate": 1,
    "Role Modelling": 1,
    "Search Analysis": 1,
    "Search Engine Optimisation (SEO)": 1,
    "Search Server": 1,
    "Segmentation": 1,
    "Semantics": 1,
    "Social Skills": 1,
    "Stability": 1,
    "Statistical Analysis Software": 1,
    "System Dynamics": 1,
    "System Improvements": 1,
    "Task Completion": 1,
    "TikTok": 1,
    "Traceability": 1,
    "Transportation Planning": 1,
    "Video Analytics": 1,
    "WSDL": 1,
    "Web Content Optimization": 1,
    "Workflow Engine": 1,
    "Yahoo! Search Marketing": 1,
    "business scenarios": 1,
    "candidate searches": 1,
    "cutting-edge technology": 1,
    "end-to-end marketing": 1,
    "enhance user experience": 1,
    "hands-on skills": 1,
    "improve conversion rates": 1,
    "online competitions": 1,
    "product development strategies": 1,
    "storage capacity": 1,
    "technical studies": 1
  },
  "doc_freq": {
    "Design": 718,
    "Development": 592,
    "Python": 582,
    "Software": 495,
    "Communication": 453,
    "Programming": 393,
    "Pipelines": 390,
    "Management": 389,
    "Machine Learning": 357,
    "Security": 346,
    "AWS": 337,
    "Governance": 304,
    "LLMs": 299,
    "Data Science": 288,
    "Scalability": 278,
    "Agents": 273,
    "Software Engineering": 246,
    "Collaboration": 240,
    "Kubernetes": 240,
    "PyTorch": 240,
    "Optimization": 238,
    "CI/CD": 230,
    "Language Models": 230,
    "Evaluation": 228,
    "Monitoring": 227,
    "Testing": 219,
    "Artificial Intelligence": 216,
    "TensorFlow": 215,
    "API": 213,
    "AI Agents": 205,
    "Prompt Engineering": 190,
    "Deployment": 183,
    "Leadership": 171,
    "Deep Learning": 156,
    "AI Governance": 155,
    "Retrieval-Augmented Generation (RAG)": 140,
    "Efficiency": 138,
    "Model Deployment": 132,
    "Model Training": 128,
    "Workflow": 128,
    "Responsible AI": 126,
    "Azure AI": 125,
    "Data Engineering": 124,
    "Pinecone": 124,
    "Java": 122,
    "LlamaIndex": 121,
    "Validation": 121,
    "Architecture": 113,
    "AI Models": 112,
    "FAISS": 111,
    "Rest Apis": 111,
    "GCP": 104,
    "Energy": 102,
    "Gemini": 101,
    "Generative AI": 101,
    "Docker": 100,
    "Stakeholder Management": 90,
    "MLOps": 87,
    "Operations": 87,
    "Training": 87,
    "Computer Vision": 86,
    "SQL": 79,
    "AutoGen": 76,
    "Model Evaluation": 75,
    "LangChain": 71,
    "Documentation": 70,
    "Tuning": 70,
    "Reporting": 69,
    "Statistics": 69,
    "Edge": 67,
    "Experimentation": 66,
    "C++": 65,
    "Feature Engineering": 64,
    "Orchestration": 64,
    "Diversity": 59,
    "Knowledge Sharing": 56,
    "Modelling": 56,
    "Software Development": 56,
    "Fast-paced": 55,
    "Mathematics": 51,
    "Metrics": 51,
    "Patterns": 51,
    "Analytical and Problem-Solving Skills": 50,
    "Agile": 48,
    "API Development": 46,
    "Roadmap": 46,
    "Troubleshooting": 46,
    "Microsoft Azure": 45,
    "Certifications": 43,
    "scikit-learn": 43,
    "Dashboards": 41,
    "Multi-Agent Systems": 41,
    "Authentication": 40,
    "Google Cloud": 40,
    "Performance Tuning": 39,
    "Reinforcement Learning": 39,
    "Google Cloud Platform": 38,
    "Programming Languages": 38,
    "Scripting": 37,
    "Teamwork": 37,
    "Application Development": 36,
    "Tooling": 36,
    "Information Technology": 34,
    "Data Analysis": 33,
    "Open Source": 31,
    "Algorithms": 30,
    "Conferences": 30,
    "TypeScript": 30,
    "Authorization": 29,
    "Benchmarking": 28,
    "Containerization": 28,
    "Data Solutions": 28,
    "Enterprise Software": 28,
    "Debugging": 27,
    "JavaScript": 27,
    "Writing": 27,
    "Adoption": 26,
    "GitHub": 26,
    "Innovation": 26,
    "Technical Leadership": 26,
    "Classification": 25,
    "Coding Standards": 25,
    "PySpark": 25,
    "Stakeholder Engagement": 25,
    "Enterprise Systems": 24,
    "Predictive Analytics": 24,
    "COM": 23,
    "Data Governance": 23,
    "Financial Services": 23,
    "Model Context Protocol (MCP)": 23,
    "Partnerships": 23,
    "Product Management": 23,
    "Workflow Automation": 23,
    "Cloud Technologies": 22,
    "Electrical Engineering": 22,
    "Enterprise Applications": 22,
    "Initiative": 22,
    "Production Deployment": 22,
    "Profiling": 22,
    "Registration": 22,
    "Data Mining": 21,
    "Scala": 21,
    "Azure OpenAI": 20,
    "Batch Processing": 20,
    "Chatbot": 20,
    "Prototype": 20,
    "Context Engineering": 19,
    "Design Patterns": 19,
    "Function Calling": 19,
    "Backend Development": 18,
    "Education": 18,
    "Solution Architecture": 18,
    "Subject Matter Expert": 18,
    "AI Safety": 17,
    "Alteryx": 17,
    "Cloud Services": 17,
    "FastAPI": 17,
    "Keras": 17,
    "Production Support": 17,
    "Relational Databases": 17,
    "Reproducibility": 17,
    "leading technical teams": 17,
    "Lifecycle Management": 16,
    "MLflow": 16,
    "Pico": 16,
    "Prediction": 16,
    "Regression": 16,
    "Root Cause Analysis": 16,
    "Transformer": 16,
    "large datasets": 16,
    "Linux": 15,
    "Power BI": 15,
    "Project Management": 15,
    "Running": 15,
    "Creativity": 14,
    "Data Structures": 14,
    "Regulatory Compliance": 14,
    "Cloudera": 13,
    "Embedding": 13,
    "Predictive Maintenance": 13,
    "Professional Experience": 13,
    "SSO": 13,
    "Semantic Search": 13,
    "Technical Design": 13,
    "Build and Deploy": 12,
    "Cloud Deployment": 12,
    "Clustering": 12,
    "Deployment Automation": 12,
    "Failure Modes": 12,
    "Interpersonal Skills": 12,
    "Representation Learning": 12,
    "Soft Skills": 12,
    "Software Development Lifecycle": 12,
    "Stochastic": 12,
    "Cloud Infrastructure": 11,
    "Electrical": 11,
    "Healthcare": 11,
    "Industry Experience": 11,
    "Node.js": 11,
    "Technical Development": 11,
    "User Feedback": 11,
    "scalable solutions": 11,
    "AI Evaluation": 10,
    "Academic Writing": 10,
    "Accountability": 10,
    "Azure AI Search": 10,
    "Business Applications": 10,
    "Cisco": 10,
    "Cost Management": 10,
    "Data Architecture": 10,
    "Data Ingestion": 10,
    "Data Pipeline": 10,
    "Data Visualisation": 10,
    "Data Warehousing": 10,
    "ETL": 10,
    "Fine Tuning": 10,
    "Genesys": 10,
    "Intelligent Reasoning": 10,
    "LLMOps": 10,
    "Learning Platform": 10,
    "Natural Language Processing": 10,
    "Platform Modernization": 10,
    "Security Controls": 10,
    "SoC": 10,
    "Software Verification": 10,
    "Compiler": 9,
    "Data Infrastructure": 9,
    "Data Transformation": 9,
    "Development Tools": 9,
    "Distillation": 9,
    "Global Engineering": 9,
    "MES": 9,
    "Mining": 9,
    "PostgreSQL": 9,
    "Product Strategy": 9,
    "Single Sign-On": 9,
    "API Gateway": 8,
    "Analytical Skills": 8,
    "Applied Mathematics": 8,
    "Competitive Advantage": 8,
    "Construction": 8,
    "Cybersecurity": 8,
    "Data Access": 8,
    "Enterprise Architecture": 8,
    "Middleware Components": 8,
    "MongoDB": 8,
    "Neural Networks": 8,
    "Onboarding": 8,
    "Prescriptive Analytics": 8,
    "Problem Solving": 8,
    "Qwen": 8,
    "Site Reliability Engineering": 8,
    "Stability": 8,
    "Statistical Modelling": 8,
    "Technology Consulting": 8,
    "Vector Search": 8,
    "Web Applications": 8,
    "Adaptability": 7,
    "Airflow": 7,
    "Data Integration": 7,
    "Exploratory Data Analysis": 7,
    "Recommender Systems": 7,
    "TikTok": 7,
    "cutting-edge technology": 7,
    ".NET": 6,
    "A/B testing": 6,
    "AIOps": 6,
    "ATS": 6,
    "Agent Orchestration": 6,
    "Automation Tools": 6,
    "Customer Segmentation": 6,
    "Data Retrieval": 6,
    "Design of Experiments": 6,
    "E-Commerce": 6,
    "Educational Background": 6,
    "Embedding Models": 6,
    "Endpoint Security": 6,
    "Flutter": 6,
    "GitHub Copilot": 6,
    "Information Retrieval": 6,
    "Object Detection": 6,
    "Physics": 6,
    "Presentation Skills": 6,
    "Tailwind CSS": 6,
    "User Stories": 6,
    "Workflow Orchestration": 6,
    "data cube": 6,
    "Customer Support": 5,
    "Data Modelling": 5,
    "Front-end Development": 5,
    "Full Stack Development": 5,
    "Git": 5,
    "Global E-commerce": 5,
    "Incident Handling": 5,
    "Innovator": 5,
    "Knowledge Transfer": 5,
    "Operational Metrics": 5,
    "Proactive": 5,
    "Prompt Design": 5,
    "SIEM": 5,
    "Tenure": 5,
    "Test Automation": 5,
    "ACL": 4,
    "AI Red Teaming": 4,
    "Agile Delivery": 4,
    "Apache Spark": 4,
    "Azure DevOps": 4,
    "Budget": 4,
    "Build Prototypes": 4,
    "Clean Code": 4,
    "Code Review": 4,
    "DBMS": 4,
    "Data Lake": 4,
    "Database Systems": 4,
    "Engineering Management": 4,
    "Enterprise Search": 4,
    "Foundations": 4,
    "Hive": 4,
    "Image Classification": 4,
    "Improve Usability": 4,
    "Journals": 4,
    "LSTM": 4,
    "LangGraph": 4,
    "Mathematical Skills": 4,
    "OEE": 4,
    "Segmentation": 4,
    "Software Architecture": 4,
    "Solution Delivery": 4,
    "Timely Delivery": 4,
    "WIP": 4,
    "governance requirements": 4,
    "Agile Software Development": 3,
    "Bug Fixing": 3,
    "Data Wrangling": 3,
    "Ffmpeg": 3,
    "High Availability": 3,
    "Intelligent Agents": 3,
    "Monetization": 3,
    "NumPy": 3,
    "Pandas": 3,
    "Platform Management": 3,
    "Potential Risks": 3,
    "Resource Allocation": 3,
    "Search Algorithm": 3,
    "Software Design": 3,
    "Traceability": 3,
    "AOP": 2,
    "ARIMA": 2,
    "ATP": 2,
    "Algorithm Development": 2,
    "Ansible": 2,
    "Automotive Industry": 2,
    "Autonomous Vehicles": 2,
    "Azure Machine Learning": 2,
    "Big Data Analytics": 2,
    "Business Systems": 2,
    "CMMS": 2,
    "CPT": 2,
    "Candidate Screening": 2,
    "Commercial Opportunities": 2,
    "Conceptualization": 2,
    "Confidentiality": 2,
    "CrewAI": 2,
    "DCS": 2,
    "Data Acquisition": 2,
    "Data Exploration": 2,
    "Data Marts": 2,
    "Dynamics": 2,
    "EDA": 2,
    "ESP": 2,
    "Engineering Leadership": 2,
    "Engineering Support": 2,
    "Environmental Monitoring": 2,
    "Equities": 2,
    "Facilities Management": 2,
    "Feature Selection": 2,
    "Forecasting Models": 2,
    "Hyperparameter Tuning": 2,
    "Infiniband": 2,
    "Infrastructure Automation": 2,
    "LEED AP": 2,
    "Lifestyle": 2,
    "Logistic Regression": 2,
    "Market Research": 2,
    "Model Validation": 2,
    "Online Advertising": 2,
    "OpenCV": 2,
    "Peer Review": 2,
    "Performance Management": 2,
    "Personalization": 2,
    "Pipeline Development": 2,
    "Product Launch": 2,
    "Production Environment": 2,
    "Project Leadership": 2,
    "Quantitative Analysis": 2,
    "RESTful API": 2,
    "Relationship Building": 2,
    "Reliability Requirements": 2,
    "Research Methods": 2,
    "Software Development Tools": 2,
    "Software Integration": 2,
    "Software Testing": 2,
    "Software as a Service (SaaS)": 2,
    "Spark SQL": 2,
    "Storage Layout": 2,
    "System Testing": 2,
    "Technical Infrastructure": 2,
    "Time Series Analysis": 2,
    "Validation Procedures": 2,
    "Written English": 2,
    "operational knowledge": 2,
    "scientific software": 2,
    "APAC": 1,
    "Audio": 1,
    "Capacity Planning": 1,
    "Content Security": 1,
    "Customer Retention": 1,
    "Data Handling": 1,
    "Database Administration": 1,
    "FOCAL": 1,
    "Failure Analysis": 1,
    "Industrial Engineering": 1,
    "Logistics": 1,
    "Mechanical Engineering": 1,
    "Online Services": 1,
    "Precipitation": 1,
    "Predictive Modeling": 1,
    "Production Engineering": 1,
    "Programming tools": 1,
    "Real-time Simulation": 1,
    "Replenishment": 1,
    "Scripting Languages": 1,
    "Semantics": 1,
    "Statistical Analysis": 1,
    "Task Completion": 1,
    "Transportation Planning": 1,
    "Video Analytics": 1,
    "business scenarios": 1
  }
}