{
  "_written_by": "skill_extract.py",
  "_comment": "Skill vocabulary harvested from MyCareersFuture's structured tags, used to read skills out of descriptions from sources that publish none. `doc_freq` counts how many descriptions each term appeared in -- terms common enough to be filler are filtered out at extraction time. Safe to delete; it rebuilds from the next fetch.",
  "term_count": 904,
  "documents": 2229,
  "terms": {
    "AI Agents": 280,
    "Artificial Intelligence": 275,
    "Design": 238,
    "Machine Learning": 223,
    "LLMs": 195,
    "Python": 187,
    "Data Science": 184,
    "Azure AI": 149,
    "AI Safety": 146,
    "Language Models": 135,
    "Generative AI Application Development and Deployment": 131,
    "Liaising with cross functional teams": 126,
    "AI Evaluation": 125,
    "Retrieval-Augmented Generation (RAG)": 119,
    "Kubernetes": 110,
    "PyTorch": 110,
    "Development": 92,
    "Enterprise Integration Solution": 92,
    "Programming": 90,
    "TensorFlow": 88,
    "Prompt Engineering": 86,
    "CI/CD": 82,
    "Scalability": 82,
    "Chatbot": 80,
    "Fine Tuning": 80,
    "Cost Management": 76,
    "Data Pipeline": 74,
    "Engaging Stakeholders": 74,
    "Artificial Intelligence Application": 72,
    "AI Models": 68,
    "Security": 68,
    "Enterprise Software": 66,
    "Pipelines": 65,
    "Generative AI Model Evaluation": 64,
    "Governance": 64,
    "Liaising With Internal Stakeholders": 64,
    "Modelling": 64,
    "Operational Workflow": 64,
    "Rest Apis": 64,
    "Java": 63,
    "Pinecone": 62,
    "Responsible AI": 59,
    "AWS": 54,
    "Computer Vision": 54,
    "Model Training": 54,
    "Deep Learning": 53,
    "Model Deployment": 50,
    "C++": 48,
    "Platform Management": 48,
    "Data Engineering": 46,
    "Natural Language Processing": 43,
    "large datasets": 38,
    "AI Governance": 37,
    "Analytical and Problem-Solving Skills": 36,
    "GCP": 36,
    "Google Cloud Platform": 36,
    "API Development": 35,
    "Algorithm Optimization": 34,
    "Collaborate With Engineers": 34,
    "Automation Management in Product Development": 33,
    "Knowledge Sharing": 33,
    "Software Development": 32,
    "Benchmarking": 31,
    "Docker Container": 30,
    "Evaluation": 30,
    "FAISS": 30,
    "Data Structures": 29,
    "Cloud Deployment": 28,
    "Continuous Improvement Techniques": 28,
    "Model Evaluation": 28,
    "Reinforcement Learning": 28,
    "Statistics": 28,
    "Data Mining": 27,
    "Agent Management System": 26,
    "Linux": 25,
    "Deployment": 24,
    "SQL": 24,
    "Software Engineering": 24,
    "Stakeholder Management": 24,
    "Therapeutic Areas": 24,
    "Utility Industry": 24,
    "Practice Development": 23,
    "Artificial Intelligence Ethics and Governance": 22,
    "Data Warehousing": 22,
    "Generative AI": 22,
    "Multi-Agent Systems": 22,
    "Optimization": 22,
    "Performance Tuning": 22,
    "integrated workflow": 22,
    "Experimentation": 21,
    "Mathematics": 21,
    "Agents": 20,
    "C Language": 20,
    "Cross Functional Project Management": 20,
    "Deep Foundations": 20,
    "Extensive Work Experience": 20,
    "Monitoring": 20,
    "Process Flows": 20,
    "Statistical Knowledge": 20,
    "Authorization": 18,
    "Build and Deploy": 18,
    "Cloud Technologies": 18,
    "Coding Standards": 18,
    "DBMS": 18,
    "Enterprise Security Solutions": 18,
    "Ethical and Responsible Generative AI Adoption": 18,
    "Generative AI Application Development and Deployment in Financial Services": 18,
    "Generative AI Prompt Engineering": 18,
    "Keras": 18,
    "Knowledge Database": 18,
    "Multimodal AI": 18,
    "Platform Modernization": 18,
    "Technology Expertise": 18,
    "Work in A Fast Paced Environment": 18,
    "Database DevOps": 17,
    "Digital and Physical Prototyping": 17,
    "Electrical Engineering": 17,
    "Liaising with departments": 17,
    "Vision Language Models (VLMs)": 17,
    "API": 16,
    "Academic Writing": 16,
    "Adversarial Machine Learning": 16,
    "Application Architecture": 16,
    "Big Data Framework": 16,
    "CVS": 16,
    "Cisco": 16,
    "Cloudera": 16,
    "Code Maintenance": 16,
    "Code Repository": 16,
    "Collaborate With Internal Team": 16,
    "Collaboration Solutions": 16,
    "Communicating With Business": 16,
    "Competitive Advantage": 16,
    "Conferences": 16,
    "Context Engineering": 16,
    "Create Documentation": 16,
    "Data Solutions": 16,
    "Data Visualisation": 16,
    "Deployment Automation": 16,
    "Design-Build": 16,
    "Development Tools": 16,
    "Enterprise Integration": 16,
    "Feature Engineering": 16,
    "Gemini": 16,
    "Generative AI Innovation, Research and Development, and Innovation Management": 16,
    "Genesys": 16,
    "Hadoop Database": 16,
    "Implemented Code": 16,
    "Innovator": 16,
    "Intelligent Reasoning": 16,
    "Job Descriptions": 16,
    "Large Systems Integration": 16,
    "LlamaIndex": 16,
    "Manuscript Development": 16,
    "Microsoft Azure": 16,
    "Mission Critical Systems": 16,
    "Model Driven Development": 16,
    "Model Validation": 16,
    "Open Source": 16,
    "Open-Source Intelligence (OSINT)": 16,
    "POS": 16,
    "Partner Solutions": 16,
    "Pipeline Development": 16,
    "Power Plants": 16,
    "Productivity Improvement": 16,
    "Professional Experience": 16,
    "Profiling": 16,
    "Project Leadership": 16,
    "Prompt Design": 16,
    "PySpark": 16,
    "Reliability Testing": 16,
    "Resolve Technical and Operational Issues": 16,
    "Robust Design": 16,
    "SIP": 16,
    "Saas Solutions": 16,
    "Software Debugging": 16,
    "Software Development Tools": 16,
    "Software Product Development": 16,
    "Software Verification": 16,
    "Software as a Service (SaaS)": 16,
    "Systems Architecture": 16,
    "Technical Development": 16,
    "Technical Infrastructure": 16,
    "Technology Implementation": 16,
    "Testing": 16,
    "Training Delivery": 16,
    "Validation": 16,
    "Virtual Production Workflow Design": 16,
    "Virtual Server": 16,
    "Voice Solutions": 16,
    "knowledge of the latest developments": 16,
    "leading technical teams": 16,
    "mentorship to junior staff": 16,
    "mid-term adjustments": 16,
    "Agentic Memory Management": 15,
    "Alteryx": 15,
    "Autonomous Maintenance": 15,
    "Generative Model": 15,
    "Problem Analysis": 15,
    "Scripting": 15,
    ".NET": 14,
    "Analysis of Business Problemsandneeds": 14,
    "Apache OpenNLP": 14,
    "Audit Tools": 14,
    "Automatic Storage and Retrieval System": 14,
    "Azure DevOps": 14,
    "Batch Processing": 14,
    "Benchmark Test": 14,
    "Business Requirement Analysis": 14,
    "Computational Intelligence": 14,
    "Cybersecurity Engineering": 14,
    "Data Governance": 14,
    "Data Orchestration": 14,
    "Energy": 14,
    "Feature Selection": 14,
    "GPT Models": 14,
    "Generative AI Models Technical Aspects of Security and Ethics": 14,
    "Generative AI Models Technical Aspects of Security and Ethics in Financial Services": 14,
    "Manufacturing Automation": 14,
    "Ontology": 14,
    "Operations Capability": 14,
    "Predictive Analytics": 14,
    "Problem Identification": 14,
    "Production Support": 14,
    "Qwen": 14,
    "React.js": 14,
    "Reinforcement Learning from Human Feedback (RLHF)": 14,
    "Relational Databases": 14,
    "Representation Learning": 14,
    "Semantic Layer": 14,
    "Semantic Search": 14,
    "SoC": 14,
    "Software Development Methodologies": 14,
    "Stochastic": 14,
    "Supply chain management software": 14,
    "Tuning": 14,
    "AI Content Generation for Visual Art Images": 13,
    "Adobe Edge Animate": 13,
    "Android NDK": 13,
    "Architectural Technology": 13,
    "AutoGen": 13,
    "Compiler": 13,
    "Compression technology": 13,
    "Docker": 13,
    "Edge": 13,
    "Image Processing Software": 13,
    "Model Context Protocol (MCP)": 13,
    "Performance Management": 13,
    "Providing expert advice": 13,
    "Stakeholder Engagement": 13,
    "Television Research": 13,
    "hardware acceleration": 13,
    "ACL": 12,
    "Agile & Waterfall Methodologies": 12,
    "Algorithms": 12,
    "Applications Integration": 12,
    "Architecture": 12,
    "Backend Development": 12,
    "Classification": 12,
    "Collaboration With Stakeholders": 12,
    "Data Infrastructure": 12,
    "Database Administration": 12,
    "EDA": 12,
    "Hyperparameter Tuning": 12,
    "Information Retrieval": 12,
    "International Conferences": 12,
    "Online Advertising": 12,
    "Prediction": 12,
    "Production Environment": 12,
    "Scala": 12,
    "Technical Consultation": 12,
    "Workflow Analysis": 12,
    "automation applications": 12,
    "conference papers": 12,
    "Computer Programming": 11,
    "Debugging": 11,
    "Agent Orchestration": 10,
    "Authentication": 10,
    "Azure Machine Learning": 10,
    "Business Intelligence and Data Analytics": 10,
    "Business Optimization": 10,
    "Data Analysis": 10,
    "Flutter": 10,
    "GitHub": 10,
    "Hand Tools": 10,
    "LangChain": 10,
    "Passionate about Work": 10,
    "Reliability Analysis": 10,
    "Search Algorithm": 10,
    "scikit-learn": 10,
    "Technological Proficiency": 9,
    "Algorithm Development": 8,
    "Analytical Approach": 8,
    "Business Analysis Planning": 8,
    "Clustering": 8,
    "Computer Proficiency": 8,
    "Containerization": 8,
    "Data Ingestion": 8,
    "Data Quality Management": 8,
    "Design Patterns": 8,
    "Develops Software Solutions": 8,
    "E-Commerce": 8,
    "Enterprise Architecture": 8,
    "Enterprise Software Industry": 8,
    "Full Stack Development": 8,
    "Global E-commerce": 8,
    "Industrial Engineering": 8,
    "Learning Platform": 8,
    "Lifecycle Management": 8,
    "MCITP": 8,
    "MLOps": 8,
    "Management": 8,
    "Monetization": 8,
    "Operational Management": 8,
    "Project Management Support": 8,
    "Recommender Systems": 8,
    "Researching New Technologies": 8,
    "Roadmap": 8,
    "SSO": 8,
    "Statistical Modelling": 8,
    "Technical Leadership": 8,
    "Tools Software": 8,
    "Workflow": 8,
    "Workflow Solutions": 8,
    "Working alongside Product Teams": 8,
    "computational skills": 8,
    "requirements from stakeholders": 8,
    "Data Modelling": 7,
    "Analytical Methods Development": 6,
    "Android": 6,
    "Apple Ios": 6,
    "Application Deployment": 6,
    "Application Development": 6,
    "Application Frameworks": 6,
    "Assisting Executives": 6,
    "Audio": 6,
    "Build Automation": 6,
    "CUDA": 6,
    "Cloud Services": 6,
    "Collaborative Filtering": 6,
    "Commodities": 6,
    "Complex Problem Solving": 6,
    "Computational Mathematics": 6,
    "Computer Vision Technology": 6,
    "Conceptualization": 6,
    "Container Operations": 6,
    "Content Security": 6,
    "Continuous Quality Improvement": 6,
    "Creative Solutions": 6,
    "Cyber Security": 6,
    "Cybersecurity": 6,
    "Dashboards": 6,
    "Data Warehouse Systems": 6,
    "Data Wrangling": 6,
    "Design of Experiments": 6,
    "Developing Skills": 6,
    "E-Commerce Strategy": 6,
    "Ecosystem Services": 6,
    "Engineering Support": 6,
    "Factor Analysis": 6,
    "Factoring": 6,
    "Front-end Development": 6,
    "Function Calling": 6,
    "Grant Administration": 6,
    "Hardware": 6,
    "Head Injury": 6,
    "High Availability": 6,
    "Hive": 6,
    "Idea Generation": 6,
    "Impact Assessment": 6,
    "Improve Usability": 6,
    "Improve User Experience": 6,
    "Industry Experience": 6,
    "Information Technology": 6,
    "Information Visualization": 6,
    "Intellectual Property Law": 6,
    "Interface with engineers": 6,
    "Internships": 6,
    "JavaScript": 6,
    "Journals": 6,
    "Liaise With Technical Teams": 6,
    "Logic": 6,
    "Logistic Regression": 6,
    "Low Latency": 6,
    "MES": 6,
    "Machine Vision": 6,
    "Middleware Components": 6,
    "Mining": 6,
    "NIR": 6,
    "NumPy": 6,
    "OpenAI Codex": 6,
    "Operations Management": 6,
    "Pandas": 6,
    "Partnerships": 6,
    "Preparation of Technical Documents": 6,
    "Prescriptive Analytics": 6,
    "Privacy Law": 6,
    "Process Modelling": 6,
    "Product Demonstration": 6,
    "Product Improvement": 6,
    "Product Management": 6,
    "Production Deployment": 6,
    "Project Lifecycle Management": 6,
    "Project Portfolio Management": 6,
    "Project Specification": 6,
    "Quality Improvement and Safe Practices": 6,
    "Regulated Financial Services": 6,
    "Relationship Building": 6,
    "Represent team": 6,
    "Research": 6,
    "Research & Development": 6,
    "Research Industry": 6,
    "Resolving Product Problems": 6,
    "Sand Control": 6,
    "Scalable Architecture": 6,
    "Search Analysis": 6,
    "Signal Processing Algorithms": 6,
    "Single Sign-On": 6,
    "Site Reliability Engineering": 6,
    "Software": 6,
    "Software Integration": 6,
    "Solution Architecture": 6,
    "Standards Compliance": 6,
    "Statistical Analysis": 6,
    "Statistical Analysis Software": 6,
    "Subject Matter Expert": 6,
    "Task Completion": 6,
    "Technical Design": 6,
    "Technical Skillset": 6,
    "Technical Support": 6,
    "Technical Writing": 6,
    "Technology Planning": 6,
    "Test Automation": 6,
    "Traceability": 6,
    "Training Courses": 6,
    "Training Set": 6,
    "TypeScript": 6,
    "Unix Administration": 6,
    "Unix Scripting": 6,
    "Vision": 6,
    "Web Content Optimization": 6,
    "Workflow Engine": 6,
    "Workflow Software": 6,
    "Yahoo! Search Marketing": 6,
    "candidate searches": 6,
    "data cube": 6,
    "data integration projects": 6,
    "delivering KPIs": 6,
    "enhance user experience": 6,
    "hands-on skills": 6,
    "online competitions": 6,
    "product development strategies": 6,
    "proposal documents": 6,
    "requirements assessment": 6,
    "visualization system": 6,
    "AI Literacy": 5,
    "Archtics": 5,
    "Competitive Strategies": 5,
    "Cross Functional Team Building": 5,
    "Databricks": 5,
    "Digital Image Processing": 5,
    "Git": 5,
    "Information Literacy": 5,
    "OpenCV": 5,
    "Organisational Strategy Formulation": 5,
    "Organization and Coordination Skills": 5,
    "Pain Management": 5,
    "Personalization": 5,
    "Photo Research": 5,
    "Photojournalism": 5,
    "Precipitation": 5,
    "Response Rate": 5,
    "Search Engine Optimisation (SEO)": 5,
    "Search Server": 5,
    "Segmentation": 5,
    "Semantics": 5,
    "Solve Technical Problems": 5,
    "Stability": 5,
    "TikTok": 5,
    "Video Analytics": 5,
    "cutting-edge technology": 5,
    "improve system performance": 5,
    "knowledge of data networking": 5,
    "A/B testing": 4,
    "AIOps": 4,
    "AWS Lambda": 4,
    "Applied Mathematics": 4,
    "Architectural Visualization": 4,
    "Automated Operation Monitoring": 4,
    "Automation Studio": 4,
    "Back End Infrastructure": 4,
    "Cloud Infrastructure": 4,
    "Computer Hardware": 4,
    "Creative Thinking": 4,
    "Cross-Functional Team Leadership": 4,
    "Data Quality Assurance": 4,
    "Database Optimization": 4,
    "Design for Maintainability": 4,
    "Distillation": 4,
    "ETL Tools": 4,
    "Education": 4,
    "Endpoint Security": 4,
    "Enterprise Search": 4,
    "Enterprise Systems": 4,
    "Failure Analysis": 4,
    "Failure Modes": 4,
    "Feature-Driven Development": 4,
    "GPU Programming": 4,
    "GitHub Copilot": 4,
    "Incident Handling": 4,
    "Interpret Business Needs": 4,
    "LLM Security": 4,
    "LLMOps": 4,
    "Large-scale Data Analysis": 4,
    "Liaising With Architects": 4,
    "Lifestyle": 4,
    "Mathematical Skills": 4,
    "Mentoring for Developers": 4,
    "Monitor Kpis": 4,
    "Monitoring Trends": 4,
    "Neural Networks": 4,
    "OEE": 4,
    "Operations": 4,
    "Oracle Machine Learning": 4,
    "Orchestration": 4,
    "Performance Improvement": 4,
    "Physics": 4,
    "Pico": 4,
    "Pipeline Management": 4,
    "Predictive Modeling": 4,
    "Process Engineering": 4,
    "Product Lifecycle Management": 4,
    "Product Strategy": 4,
    "Production System": 4,
    "Project Coordination": 4,
    "Project Team Management": 4,
    "Quantitative Analysis": 4,
    "REST APIs development": 4,
    "Reproducibility": 4,
    "Research Design": 4,
    "Root Cause Analysis": 4,
    "SIEM": 4,
    "Service Level Agreement": 4,
    "Software Architecture": 4,
    "Software Development Lifecycle": 4,
    "Software Testing": 4,
    "Technology Commercialization": 4,
    "User Interface Design": 4,
    "Validation Procedures": 4,
    "WIP": 4,
    "Work Under Pressure": 4,
    "Work With Product Managers": 4,
    "Workflow Automation": 4,
    "health monitoring software": 4,
    "policies & procedures": 4,
    "scalable solutions": 4,
    "AI Red Teaming": 2,
    "AOP": 2,
    "API Gateway": 2,
    "ARIMA": 2,
    "ATP": 2,
    "ATS": 2,
    "Access Control Management": 2,
    "Access Control System": 2,
    "Accountability": 2,
    "Accuracy and Precision": 2,
    "Adobe Spark": 2,
    "Adoption": 2,
    "Advanced Engineering": 2,
    "Advanced Robotics": 2,
    "Agile": 2,
    "Agile Delivery": 2,
    "Agile Software Development": 2,
    "Airflow": 2,
    "Algorithm Analysis": 2,
    "Amazon Bedrock": 2,
    "Analyse Product Performance": 2,
    "Analytics Support": 2,
    "Ansible": 2,
    "Apache Spark": 2,
    "Application Maintenance Support": 2,
    "Architectural Details": 2,
    "Articulate Communicator": 2,
    "Audit Frameworks": 2,
    "Automated Software Testing": 2,
    "Automation Strategy": 2,
    "Automation Tools": 2,
    "Automotive Industry": 2,
    "Autonomous Vehicles": 2,
    "Autonomy iManage": 2,
    "Azure AI Search": 2,
    "Azure OpenAI": 2,
    "BDD": 2,
    "BIM (Building Information Modeling)": 2,
    "BIRT (Business Intelligence and Reporting Tools)": 2,
    "Big Data Analytics": 2,
    "Biomedical Devices": 2,
    "Biomedical Sciences": 2,
    "Budget": 2,
    "Bug Fixing": 2,
    "Build Prototypes": 2,
    "Building Science": 2,
    "Business Applications": 2,
    "Business Data Analysis": 2,
    "Business Impact Analysis": 2,
    "Business Performance Analysis": 2,
    "Business Systems": 2,
    "Business Unit Purchasing": 2,
    "CDM": 2,
    "CMMS": 2,
    "CPT": 2,
    "Candidate Screening": 2,
    "Capacity Planning": 2,
    "Certifications": 2,
    "Clean Code": 2,
    "Clinical Data Management": 2,
    "Cloud Storage": 2,
    "Code Development": 2,
    "Code Review": 2,
    "Collaborating With Product Managers": 2,
    "Commercial Opportunities": 2,
    "Communicating With Agents": 2,
    "Competency Mapping": 2,
    "Component Based Development": 2,
    "Computerized Maintenance Management System": 2,
    "Computing Infrastructure": 2,
    "Concept Development": 2,
    "Confidentiality": 2,
    "Construction": 2,
    "Content Ingest Operations": 2,
    "Core Analysis": 2,
    "Creating communication strategies": 2,
    "CrewAI": 2,
    "Customer Experience Innovation": 2,
    "Customer Retention": 2,
    "Customer Segmentation": 2,
    "Customer Support": 2,
    "DCS": 2,
    "Data Access": 2,
    "Data Acquisition": 2,
    "Data Acquisition System": 2,
    "Data Architecture": 2,
    "Data Center Architecture": 2,
    "Data Exploration": 2,
    "Data Handling": 2,
    "Data Integration": 2,
    "Data Integrity": 2,
    "Data Lake": 2,
    "Data Lineage": 2,
    "Data Maintenance": 2,
    "Data Marketing": 2,
    "Data Marts": 2,
    "Data Migration Services": 2,
    "Data Planning": 2,
    "Data Retrieval": 2,
    "Data Services Business": 2,
    "Data Storytelling and Visualisation": 2,
    "Data Transformation": 2,
    "Database Analysis": 2,
    "Database Systems": 2,
    "Decision Support Systems": 2,
    "Develop Business Applications": 2,
    "Developing Frameworks": 2,
    "Development Reviews": 2,
    "Digital Business": 2,
    "Digital Insight & Analytics": 2,
    "Digital Scanner": 2,
    "Diversity": 2,
    "Drive Awareness": 2,
    "Dynamics": 2,
    "E-Commerce Platforms": 2,
    "E2e Testing": 2,
    "ESP": 2,
    "ETL": 2,
    "Educational Background": 2,
    "Elastic": 2,
    "Electrical": 2,
    "Embedding": 2,
    "Embedding Models": 2,
    "End-User Marketing": 2,
    "Energy Consultancy": 2,
    "Engineering Leadership": 2,
    "Engineering Management": 2,
    "Engineering Opportunities-": 2,
    "Enterprise Applications": 2,
    "Enterprise Valuation": 2,
    "EnterpriseDB": 2,
    "Environmental Monitoring": 2,
    "Equipment Design": 2,
    "Equipment Quality": 2,
    "Equities": 2,
    "Evaluation Methodology": 2,
    "Event-Driven Architecture (EDA)": 2,
    "Exploratory Data Analysis": 2,
    "FOCAL": 2,
    "Facilities Management": 2,
    "FastAPI": 2,
    "Ffmpeg": 2,
    "Financial Services": 2,
    "Focus Groups": 2,
    "Forecasting Models": 2,
    "Foundation Design": 2,
    "Foundations": 2,
    "Front-End Architecture": 2,
    "GCC": 2,
    "GPGPU": 2,
    "GUI Testing Tools": 2,
    "Gather Feedback": 2,
    "Generative AI Model Development and Fine Tuning": 2,
    "Global Engineering": 2,
    "Go to Market Strategies": 2,
    "Google Analytics": 2,
    "Google Cloud": 2,
    "Graduate Recruitment": 2,
    "Hardware Interfacing": 2,
    "Hardware delivery": 2,
    "Healthcare": 2,
    "High Level Architecture": 2,
    "High Speed Ethernet": 2,
    "IBM Cloud or Watson": 2,
    "Identifying New Business Opportunities": 2,
    "Image Classification": 2,
    "Image Processing and Industrial Vision Inspection": 2,
    "Implementation of Best Practices": 2,
    "Implementation of Digital Strategy": 2,
    "Implementing Budgets": 2,
    "Industry Research": 2,
    "Industry Stakeholders": 2,
    "Infiniband": 2,
    "Influencing Key Stakeholders": 2,
    "Infrastructure Automation": 2,
    "Integrated Planning": 2,
    "Integration Modules": 2,
    "Intelligent Agents": 2,
    "Interacting with team members": 2,
    "Interviewing": 2,
    "Issue Escalation": 2,
    "Issue Handling": 2,
    "Iteration Planning": 2,
    "Knowledge Transfer": 2,
    "LEED AP": 2,
    "LSTM": 2,
    "LangGraph": 2,
    "Language Services": 2,
    "Learning Framework Development": 2,
    "Library Science": 2,
    "Logistics": 2,
    "MES Software": 2,
    "MFC": 2,
    "MLflow": 2,
    "Managing Ambiguity": 2,
    "Mandarin Chinese": 2,
    "Manufacturing Execution Systems": 2,
    "Market Research": 2,
    "Mathematical Modeling": 2,
    "Mechanical Engineering": 2,
    "Mechanical Engineering Management": 2,
    "Medical Degree": 2,
    "Methods&techniques": 2,
    "Metrics": 2,
    "Middleware Solution": 2,
    "Model Based Software Development": 2,
    "Model Quantisation": 2,
    "Modern Architecture": 2,
    "MongoDB": 2,
    "Monitor Hardware": 2,
    "Natural Language Programming": 2,
    "Network Performance": 2,
    "New Venture Development": 2,
    "Node.js": 2,
    "OAuth": 2,
    "Object Detection": 2,
    "Online Services": 2,
    "Operational Metrics": 2,
    "Operational Planning": 2,
    "Operational Process Analysis": 2,
    "Operations & Services": 2,
    "Optimize Production Processes": 2,
    "Options Trading": 2,
    "Partnership Development": 2,
    "Pattern Recognition": 2,
    "Patterns": 2,
    "Peer Review": 2,
    "Performance Enhancement": 2,
    "Physical Education": 2,
    "Policy Management": 2,
    "Portfolio Administration": 2,
    "PostgreSQL": 2,
    "Potential Risks": 2,
    "Power BI": 2,
    "Predictive Maintenance": 2,
    "Presentation Skills": 2,
    "Pricing Strategy": 2,
    "Product Launch": 2,
    "Production Design": 2,
    "Production Engineering": 2,
    "Production Work": 2,
    "Programming Languages": 2,
    "Programming tools": 2,
    "Project Management": 2,
    "Project Quality Management": 2,
    "Project Status Reporting": 2,
    "Prototype": 2,
    "Quality and Performance": 2,
    "Quick Learning": 2,
    "R Programming": 2,
    "RESTful API": 2,
    "Real-time Simulation": 2,
    "Recovery Procedures": 2,
    "Registration": 2,
    "Regression": 2,
    "Regulatory Compliance": 2,
    "Reliability Requirements": 2,
    "Requirements Gathering": 2,
    "Research Methods": 2,
    "Research Support": 2,
    "Resource Allocation": 2,
    "Responsible AI and Generative AI Practices in Financial Services": 2,
    "Retention Management": 2,
    "SQL Programming": 2,
    "Salary Negotiation": 2,
    "Security Compliance": 2,
    "Security Controls": 2,
    "Security Test": 2,
    "Shipping Management": 2,
    "Soft Skills": 2,
    "Software Deployment": 2,
    "Software Design": 2,
    "Software Implementation": 2,
    "Software Quality Engineering": 2,
    "Software Standards": 2,
    "Solution Delivery": 2,
    "Spark SQL": 2,
    "Stakeholder Engagement and Management": 2,
    "Statistical Consulting": 2,
    "Statistical forecasting": 2,
    "Storage Layout": 2,
    "Strategic Workforce Planning": 2,
    "System Deployment": 2,
    "System Implementation": 2,
    "System Specification": 2,
    "System Testing": 2,
    "Systems Integration": 2,
    "Systems Thinking Application": 2,
    "Tailwind CSS": 2,
    "Tape": 2,
    "Team Mentoring": 2,
    "Technical Deployment": 2,
    "Technical Instruction": 2,
    "Technical Presentations": 2,
    "Technical Product Development": 2,
    "Technical Project Delivery": 2,
    "Technical Report Writing": 2,
    "Technology Adoption and Innovation": 2,
    "Technology Consulting": 2,
    "Technology Education": 2,
    "Tenancy Management": 2,
    "Tenure": 2,
    "Test Engineering": 2,
    "Time Series Analysis": 2,
    "Time Series Forecasting": 2,
    "Timely Delivery": 2,
    "Tooling": 2,
    "Tools Development": 2,
    "Total Rewards Strategies": 2,
    "Track Record Of Dependability": 2,
    "Training Needs Analysis": 2,
    "Transformer": 2,
    "Transition Planning": 2,
    "Translate Into Technical Requirements": 2,
    "Transportation Planning": 2,
    "Travel Agency": 2,
    "Travel Technology": 2,
    "Use Case Analysis": 2,
    "User Feedback": 2,
    "User Stories": 2,
    "Vector Search": 2,
    "Virtual Worlds": 2,
    "Web Applications": 2,
    "Windows Azure platform": 2,
    "Work Life Balance": 2,
    "Work Preparation": 2,
    "Workflow Development": 2,
    "Workflow Management": 2,
    "Workflow Orchestration": 2,
    "Writing": 2,
    "Written English": 2,
    "Xcode": 2,
    "benchmarking analysis": 2,
    "computing solutions": 2,
    "design database schemas": 2,
    "development of test strategies": 2,
    "evaluation of software": 2,
    "governance requirements": 2,
    "implementing monitoring tools": 2,
    "leading stakeholders": 2,
    "operational knowledge": 2,
    "organizational pain-points": 2,
    "product roadmap strategies": 2,
    "scientific software": 2,
    "software lifecycle methodologies": 2,
    "software-engineering concepts": 2,
    "support of IT projects": 2,
    "work processes": 2
  },
  "doc_freq": {
    "Design": 1715,
    "Development": 1456,
    "Python": 1415,
    "Software": 1262,
    "Programming": 963,
    "Pipelines": 949,
    "Management": 928,
    "Machine Learning": 844,
    "Security": 821,
    "AWS": 778,
    "Deployment": 692,
    "Scalability": 654,
    "Governance": 629,
    "Agents": 616,
    "Data Science": 601,
    "LLMs": 598,
    "Software Engineering": 577,
    "Kubernetes": 560,
    "Optimization": 556,
    "PyTorch": 546,
    "Evaluation": 539,
    "API": 511,
    "Monitoring": 500,
    "Artificial Intelligence": 498,
    "TensorFlow": 489,
    "Testing": 487,
    "Architecture": 479,
    "CI/CD": 473,
    "Docker": 465,
    "Language Models": 442,
    "AI Agents": 416,
    "Deep Learning": 382,
    "Operations": 382,
    "MLOps": 362,
    "Prompt Engineering": 355,
    "Generative AI": 352,
    "Java": 339,
    "Data Engineering": 328,
    "SQL": 325,
    "Model Deployment": 310,
    "LangChain": 309,
    "Model Training": 289,
    "Research": 287,
    "Energy": 286,
    "AI Models": 280,
    "Workflow": 277,
    "AI Governance": 273,
    "Diversity": 266,
    "Algorithms": 265,
    "Vision": 264,
    "LlamaIndex": 262,
    "Orchestration": 260,
    "Pinecone": 257,
    "Validation": 257,
    "Software Development": 251,
    "Azure AI": 250,
    "Retrieval-Augmented Generation (RAG)": 246,
    "Patterns": 241,
    "FAISS": 238,
    "Computer Vision": 235,
    "GCP": 234,
    "Responsible AI": 216,
    "Rest Apis": 215,
    "Gemini": 207,
    "Tooling": 206,
    "Programming Languages": 203,
    "Containerization": 189,
    "Mathematics": 189,
    "C++": 186,
    "Edge": 179,
    "Scripting": 176,
    "Agile": 175,
    "Tuning": 172,
    "scikit-learn": 172,
    "Model Evaluation": 170,
    "Writing": 170,
    "Application Development": 165,
    "Stakeholder Management": 150,
    "Google Cloud": 149,
    "Feature Engineering": 147,
    "Statistics": 147,
    "AutoGen": 142,
    "Roadmap": 136,
    "Knowledge Sharing": 134,
    "Modelling": 133,
    "Analytical and Problem-Solving Skills": 132,
    "Data Analysis": 132,
    "Debugging": 132,
    "Open Source": 131,
    "Prototype": 128,
    "Certifications": 124,
    "TypeScript": 122,
    "Azure OpenAI": 121,
    "Enterprise Applications": 120,
    "Microsoft Azure": 117,
    "Metrics": 115,
    "GitHub": 114,
    "JavaScript": 114,
    "Reinforcement Learning": 113,
    "Classification": 112,
    "Technical Leadership": 110,
    "Experimentation": 109,
    "Data Solutions": 108,
    "Stability": 105,
    "Authentication": 104,
    "FastAPI": 102,
    "Financial Services": 99,
    "Data Governance": 98,
    "Education": 97,
    "Linux": 96,
    "LangGraph": 94,
    "Enterprise Systems": 92,
    "ETL": 90,
    "Performance Tuning": 89,
    "Workflow Automation": 89,
    "API Development": 85,
    "Git": 85,
    "Predictive Analytics": 85,
    "Web Applications": 83,
    "MongoDB": 82,
    "Data Integration": 81,
    "Hardware": 79,
    "Scala": 79,
    "Multi-Agent Systems": 78,
    "Cloud Services": 77,
    "Conferences": 73,
    "PostgreSQL": 73,
    "Information Technology": 70,
    "Dashboards": 69,
    "Data Structures": 69,
    "Product Management": 69,
    "Solution Architecture": 69,
    "Pandas": 68,
    "Partnerships": 67,
    "CrewAI": 65,
    "Healthcare": 65,
    "TikTok": 65,
    "Data Mining": 64,
    "Google Cloud Platform": 64,
    "Regulatory Compliance": 64,
    "Soft Skills": 64,
    "cutting-edge technology": 64,
    "Mining": 63,
    "Regression": 63,
    "Keras": 62,
    "Chatbot": 61,
    "large datasets": 61,
    "Data Ingestion": 59,
    "Budget": 58,
    "Authorization": 57,
    "Production Deployment": 57,
    "Adoption": 55,
    "Global Engineering": 55,
    "Natural Language Processing": 55,
    "Node.js": 55,
    "Project Management": 55,
    "ATS": 54,
    "Coding Standards": 53,
    "Data Infrastructure": 53,
    "Segmentation": 53,
    "Data Transformation": 52,
    "Distillation": 52,
    "Context Engineering": 51,
    "Pico": 51,
    "Power BI": 51,
    "Data Architecture": 50,
    "High Availability": 50,
    "Lifecycle Management": 50,
    "Airflow": 49,
    "Electrical": 49,
    "Electrical Engineering": 49,
    "Internships": 49,
    "Registration": 49,
    "scalable solutions": 49,
    "Batch Processing": 48,
    "Design Patterns": 48,
    "Azure AI Search": 47,
    "Cloud Infrastructure": 47,
    "Backend Development": 46,
    "PySpark": 45,
    "Benchmarking": 44,
    "Enterprise Software": 43,
    "Exploratory Data Analysis": 43,
    "Industry Experience": 43,
    "Stakeholder Engagement": 43,
    "Embedding": 42,
    "Prediction": 42,
    "Software Architecture": 42,
    "Data Lake": 41,
    "Relational Databases": 41,
    "AI Safety": 40,
    "Build Prototypes": 40,
    "Hive": 40,
    "MLflow": 40,
    "Physics": 40,
    "Transformer": 40,
    "Cloud Technologies": 39,
    "Model Context Protocol (MCP)": 39,
    "Build and Deploy": 38,
    "Function Calling": 38,
    "Information Retrieval": 38,
    "Professional Experience": 38,
    "Profiling": 38,
    "Root Cause Analysis": 38,
    "Statistical Modelling": 38,
    "Accountability": 37,
    "E-Commerce": 37,
    "Object Detection": 37,
    "Apache Spark": 36,
    "Data Retrieval": 36,
    "User Feedback": 36,
    "Data Modelling": 34,
    "LLMOps": 34,
    "OpenCV": 34,
    "Data Warehousing": 32,
    "Representation Learning": 32,
    "Technical Writing": 32,
    "Vector Search": 32,
    "Data Access": 31,
    "Databricks": 31,
    "Reproducibility": 31,
    "Alteryx": 30,
    "Applied Mathematics": 30,
    "Construction": 30,
    "Cybersecurity": 30,
    "GitHub Copilot": 30,
    "SSO": 30,
    "AWS Lambda": 29,
    "Failure Modes": 29,
    "Semantic Search": 29,
    "Subject Matter Expert": 29,
    "leading technical teams": 29,
    "Azure Machine Learning": 28,
    "Neural Networks": 28,
    "NumPy": 28,
    "Recommender Systems": 28,
    "Agent Orchestration": 27,
    "MES": 27,
    "Traceability": 27,
    "Workflow Orchestration": 27,
    "Competitive Advantage": 26,
    "Production Environment": 26,
    "Single Sign-On": 26,
    "Code Review": 25,
    "Data Pipeline": 25,
    "ACL": 24,
    "Tailwind CSS": 24,
    "Technical Design": 24,
    "Customer Segmentation": 23,
    "Data Wrangling": 23,
    "Engineering Management": 23,
    "Predictive Maintenance": 23,
    "Product Strategy": 23,
    "Site Reliability Engineering": 23,
    "Tenure": 23,
    "Academic Writing": 22,
    "Audio": 22,
    "Fine Tuning": 22,
    "Image Classification": 22,
    "Production Support": 22,
    "Technical Support": 22,
    "DBMS": 21,
    "Cloudera": 20,
    "Confidentiality": 20,
    "Innovator": 20,
    "Learning Platform": 20,
    "Prescriptive Analytics": 20,
    "Qwen": 20,
    "RESTful API": 20,
    "Software Development Lifecycle": 20,
    "Android": 19,
    "Intelligent Reasoning": 19,
    "Software Verification": 19,
    "Technology Consulting": 19,
    "Written English": 19,
    "Cloud Deployment": 18,
    "EDA": 18,
    "Stochastic": 18,
    "Database Administration": 17,
    "Deployment Automation": 17,
    "Embedding Models": 17,
    "Engineering Leadership": 17,
    "Reliability Requirements": 17,
    "Technical Development": 17,
    "Ansible": 16,
    "Automation Tools": 16,
    "Cisco": 16,
    "Cost Management": 16,
    "Genesys": 16,
    "Security Controls": 16,
    "SoC": 16,
    "System Testing": 16,
    "AI Literacy": 15,
    "Business Applications": 15,
    "Development Tools": 15,
    "Hyperparameter Tuning": 15,
    "Logic": 15,
    "Platform Modernization": 15,
    "CUDA": 14,
    "Data Marts": 14,
    "ETL Tools": 14,
    "Lifestyle": 14,
    "Video Analytics": 14,
    "AI Evaluation": 13,
    "Compiler": 13,
    "Data Visualisation": 13,
    "Dynamics": 13,
    "Journals": 13,
    "Knowledge Transfer": 13,
    "Personalization": 13,
    "Clustering": 12,
    "Conceptualization": 12,
    "Cyber Security": 12,
    "GCC": 12,
    "Logistic Regression": 12,
    "Online Advertising": 12,
    "Relationship Building": 12,
    "Statistical Analysis": 12,
    "API Gateway": 11,
    "Educational Background": 11,
    "Full Stack Development": 11,
    "Prompt Design": 11,
    "Spark SQL": 11,
    "Test Automation": 11,
    ".NET": 10,
    "AI Red Teaming": 10,
    "Collaborative Filtering": 10,
    "Flutter": 10,
    "Foundations": 10,
    "Middleware Components": 10,
    "Programming tools": 10,
    "governance requirements": 10,
    "Database Systems": 9,
    "Failure Analysis": 9,
    "Multimodal AI": 9,
    "Software Design": 9,
    "Timely Delivery": 9,
    "Azure DevOps": 8,
    "Data Lineage": 8,
    "Elastic": 8,
    "Enterprise Architecture": 8,
    "Infrastructure Automation": 8,
    "Intelligent Agents": 8,
    "Monetization": 8,
    "Platform Management": 8,
    "Software Integration": 8,
    "Software Testing": 8,
    "Validation Procedures": 8,
    "scientific software": 8,
    "A/B testing": 7,
    "Ffmpeg": 7,
    "Mechanical Engineering": 7,
    "Production Engineering": 7,
    "Real-time Simulation": 7,
    "Research Methods": 7,
    "enhance user experience": 7,
    "AIOps": 6,
    "Capacity Planning": 6,
    "Code Repository": 6,
    "Content Security": 6,
    "Customer Support": 6,
    "Design of Experiments": 6,
    "Digital Image Processing": 6,
    "Endpoint Security": 6,
    "Front-end Development": 6,
    "Global E-commerce": 6,
    "Google Analytics": 6,
    "Improve Usability": 6,
    "International Conferences": 6,
    "OAuth": 6,
    "Online Services": 6,
    "Presentation Skills": 6,
    "Software Deployment": 6,
    "System Implementation": 6,
    "User Stories": 6,
    "Work Under Pressure": 6,
    "data cube": 6,
    "improve system performance": 6,
    "Data Quality Management": 5,
    "GPT Models": 5,
    "Improve User Experience": 5,
    "Incident Handling": 5,
    "Model Validation": 5,
    "Operational Metrics": 5,
    "Precipitation": 5,
    "SIEM": 5,
    "Search Algorithm": 5,
    "Semantics": 5,
    "System Deployment": 5,
    "Task Completion": 5,
    "Agile Delivery": 4,
    "Clean Code": 4,
    "Enterprise Search": 4,
    "LSTM": 4,
    "Mathematical Skills": 4,
    "OEE": 4,
    "Operational Planning": 4,
    "Solution Delivery": 4,
    "WIP": 4,
    "Agile Software Development": 3,
    "Bug Fixing": 3,
    "Logistics": 3,
    "Pattern Recognition": 3,
    "Potential Risks": 3,
    "AOP": 2,
    "ARIMA": 2,
    "ATP": 2,
    "Algorithm Development": 2,
    "Automotive Industry": 2,
    "Autonomous Vehicles": 2,
    "Big Data Analytics": 2,
    "Business Systems": 2,
    "CMMS": 2,
    "CPT": 2,
    "Candidate Screening": 2,
    "Commercial Opportunities": 2,
    "DCS": 2,
    "Data Acquisition": 2,
    "Data Exploration": 2,
    "ESP": 2,
    "Engineering Support": 2,
    "Environmental Monitoring": 2,
    "Equities": 2,
    "Facilities Management": 2,
    "Feature Selection": 2,
    "Forecasting Models": 2,
    "Industrial Engineering": 2,
    "Infiniband": 2,
    "LEED AP": 2,
    "Market Research": 2,
    "Peer Review": 2,
    "Performance Management": 2,
    "Pipeline Development": 2,
    "Predictive Modeling": 2,
    "Product Launch": 2,
    "Quantitative Analysis": 2,
    "Resource Allocation": 2,
    "Software Development Tools": 2,
    "Software as a Service (SaaS)": 2,
    "Storage Layout": 2,
    "Technical Infrastructure": 2,
    "Time Series Analysis": 2,
    "Transportation Planning": 2,
    "operational knowledge": 2,
    "Customer Retention": 1,
    "Data Handling": 1,
    "FOCAL": 1,
    "Project Leadership": 1
  }
}