{
  "_written_by": "skill_extract.py",
  "_comment": "Skill vocabulary harvested from MyCareersFuture's structured tags, used to read skills out of descriptions from sources that publish none. `doc_freq` counts how many descriptions each term appeared in -- terms common enough to be filler are filtered out at extraction time. Safe to delete; it rebuilds from the next fetch.",
  "term_count": 904,
  "documents": 2006,
  "terms": {
    "AI Agents": 263,
    "Artificial Intelligence": 257,
    "Design": 223,
    "Machine Learning": 206,
    "LLMs": 185,
    "Python": 178,
    "Data Science": 171,
    "Azure AI": 141,
    "AI Safety": 139,
    "Language Models": 128,
    "Generative AI Application Development and Deployment": 125,
    "AI Evaluation": 120,
    "Liaising with cross functional teams": 119,
    "Retrieval-Augmented Generation (RAG)": 113,
    "Kubernetes": 104,
    "PyTorch": 100,
    "Development": 87,
    "Enterprise Integration Solution": 87,
    "Programming": 85,
    "Prompt Engineering": 81,
    "TensorFlow": 81,
    "CI/CD": 78,
    "Scalability": 77,
    "Chatbot": 75,
    "Fine Tuning": 75,
    "Cost Management": 72,
    "Engaging Stakeholders": 69,
    "Data Pipeline": 68,
    "Artificial Intelligence Application": 66,
    "Security": 64,
    "AI Models": 63,
    "Enterprise Software": 62,
    "Generative AI Model Evaluation": 60,
    "Governance": 60,
    "Java": 60,
    "Liaising With Internal Stakeholders": 60,
    "Modelling": 60,
    "Operational Workflow": 60,
    "Rest Apis": 60,
    "Pipelines": 59,
    "Pinecone": 58,
    "Responsible AI": 57,
    "AWS": 52,
    "Computer Vision": 50,
    "Deep Learning": 50,
    "Model Training": 49,
    "Model Deployment": 47,
    "C++": 45,
    "Platform Management": 45,
    "Data Engineering": 43,
    "Natural Language Processing": 42,
    "AI Governance": 36,
    "GCP": 35,
    "Google Cloud Platform": 35,
    "API Development": 34,
    "Analytical and Problem-Solving Skills": 33,
    "large datasets": 33,
    "Automation Management in Product Development": 32,
    "Knowledge Sharing": 32,
    "Algorithm Optimization": 31,
    "Benchmarking": 30,
    "Collaborate With Engineers": 30,
    "Docker Container": 28,
    "Evaluation": 28,
    "FAISS": 28,
    "Cloud Deployment": 27,
    "Data Structures": 27,
    "Software Development": 27,
    "Model Evaluation": 26,
    "Statistics": 26,
    "Continuous Improvement Techniques": 25,
    "Data Mining": 25,
    "Reinforcement Learning": 25,
    "Agent Management System": 24,
    "Deployment": 23,
    "Linux": 23,
    "SQL": 23,
    "Software Engineering": 23,
    "Stakeholder Management": 23,
    "Utility Industry": 23,
    "Practice Development": 22,
    "Artificial Intelligence Ethics and Governance": 21,
    "Generative AI": 21,
    "Mathematics": 21,
    "Multi-Agent Systems": 21,
    "Optimization": 21,
    "integrated workflow": 21,
    "Data Warehousing": 20,
    "Experimentation": 20,
    "Performance Tuning": 20,
    "Therapeutic Areas": 20,
    "Agents": 19,
    "C Language": 19,
    "Cross Functional Project Management": 19,
    "Monitoring": 19,
    "Process Flows": 19,
    "Statistical Knowledge": 19,
    "Deep Foundations": 18,
    "Extensive Work Experience": 18,
    "Authorization": 17,
    "Build and Deploy": 17,
    "Cloud Technologies": 17,
    "Coding Standards": 17,
    "Database DevOps": 17,
    "Digital and Physical Prototyping": 17,
    "Electrical Engineering": 17,
    "Enterprise Security Solutions": 17,
    "Ethical and Responsible Generative AI Adoption": 17,
    "Generative AI Application Development and Deployment in Financial Services": 17,
    "Generative AI Prompt Engineering": 17,
    "Keras": 17,
    "Knowledge Database": 17,
    "Liaising with departments": 17,
    "Platform Modernization": 17,
    "Technology Expertise": 17,
    "Vision Language Models (VLMs)": 17,
    "Work in A Fast Paced Environment": 17,
    "Pipeline Development": 16,
    "API": 15,
    "Academic Writing": 15,
    "Adversarial Machine Learning": 15,
    "Agentic Memory Management": 15,
    "Alteryx": 15,
    "Application Architecture": 15,
    "Autonomous Maintenance": 15,
    "Big Data Framework": 15,
    "CVS": 15,
    "Cisco": 15,
    "Cloudera": 15,
    "Code Maintenance": 15,
    "Code Repository": 15,
    "Collaborate With Internal Team": 15,
    "Collaboration Solutions": 15,
    "Communicating With Business": 15,
    "Competitive Advantage": 15,
    "Conferences": 15,
    "Context Engineering": 15,
    "Create Documentation": 15,
    "DBMS": 15,
    "Data Solutions": 15,
    "Data Visualisation": 15,
    "Deployment Automation": 15,
    "Design-Build": 15,
    "Development Tools": 15,
    "Enterprise Integration": 15,
    "Feature Engineering": 15,
    "Gemini": 15,
    "Generative AI Innovation, Research and Development, and Innovation Management": 15,
    "Generative Model": 15,
    "Genesys": 15,
    "Hadoop Database": 15,
    "Implemented Code": 15,
    "Innovator": 15,
    "Intelligent Reasoning": 15,
    "Job Descriptions": 15,
    "Large Systems Integration": 15,
    "LlamaIndex": 15,
    "Manuscript Development": 15,
    "Microsoft Azure": 15,
    "Mission Critical Systems": 15,
    "Model Driven Development": 15,
    "Multimodal AI": 15,
    "Open Source": 15,
    "Open-Source Intelligence (OSINT)": 15,
    "POS": 15,
    "Partner Solutions": 15,
    "Power Plants": 15,
    "Problem Analysis": 15,
    "Productivity Improvement": 15,
    "Professional Experience": 15,
    "Profiling": 15,
    "Project Leadership": 15,
    "Prompt Design": 15,
    "PySpark": 15,
    "Reliability Testing": 15,
    "Resolve Technical and Operational Issues": 15,
    "Robust Design": 15,
    "SIP": 15,
    "Saas Solutions": 15,
    "Software Debugging": 15,
    "Software Development Tools": 15,
    "Software Product Development": 15,
    "Software Verification": 15,
    "Software as a Service (SaaS)": 15,
    "Systems Architecture": 15,
    "Technical Development": 15,
    "Technical Infrastructure": 15,
    "Technology Implementation": 15,
    "Testing": 15,
    "Training Delivery": 15,
    "Validation": 15,
    "Virtual Production Workflow Design": 15,
    "Virtual Server": 15,
    "Voice Solutions": 15,
    "knowledge of the latest developments": 15,
    "leading technical teams": 15,
    "mentorship to junior staff": 15,
    "mid-term adjustments": 15,
    "Energy": 14,
    "Model Validation": 14,
    "Predictive Analytics": 14,
    "Production Support": 14,
    "React.js": 14,
    "Scripting": 14,
    ".NET": 13,
    "AI Content Generation for Visual Art Images": 13,
    "Adobe Edge Animate": 13,
    "Android NDK": 13,
    "Apache OpenNLP": 13,
    "Architectural Technology": 13,
    "Audit Tools": 13,
    "AutoGen": 13,
    "Automatic Storage and Retrieval System": 13,
    "Azure DevOps": 13,
    "Batch Processing": 13,
    "Benchmark Test": 13,
    "Compiler": 13,
    "Compression technology": 13,
    "Cybersecurity Engineering": 13,
    "Data Orchestration": 13,
    "Docker": 13,
    "Edge": 13,
    "Feature Selection": 13,
    "GPT Models": 13,
    "Generative AI Models Technical Aspects of Security and Ethics": 13,
    "Generative AI Models Technical Aspects of Security and Ethics in Financial Services": 13,
    "Image Processing Software": 13,
    "Manufacturing Automation": 13,
    "Model Context Protocol (MCP)": 13,
    "Ontology": 13,
    "Operations Capability": 13,
    "Performance Management": 13,
    "Problem Identification": 13,
    "Providing expert advice": 13,
    "Qwen": 13,
    "Reinforcement Learning from Human Feedback (RLHF)": 13,
    "Relational Databases": 13,
    "Representation Learning": 13,
    "Semantic Layer": 13,
    "Semantic Search": 13,
    "SoC": 13,
    "Software Development Methodologies": 13,
    "Stakeholder Engagement": 13,
    "Stochastic": 13,
    "Supply chain management software": 13,
    "Television Research": 13,
    "Tuning": 13,
    "hardware acceleration": 13,
    "Analysis of Business Problemsandneeds": 12,
    "Architecture": 12,
    "Backend Development": 12,
    "Business Requirement Analysis": 12,
    "Computational Intelligence": 12,
    "Data Governance": 12,
    "automation applications": 12,
    "Classification": 11,
    "Collaboration With Stakeholders": 11,
    "Data Infrastructure": 11,
    "Debugging": 11,
    "Prediction": 11,
    "Scala": 11,
    "Workflow Analysis": 11,
    "ACL": 10,
    "Agile & Waterfall Methodologies": 10,
    "Algorithms": 10,
    "Applications Integration": 10,
    "Authentication": 10,
    "Business Intelligence and Data Analytics": 10,
    "Computer Programming": 10,
    "Database Administration": 10,
    "EDA": 10,
    "Flutter": 10,
    "Hyperparameter Tuning": 10,
    "Information Retrieval": 10,
    "International Conferences": 10,
    "LangChain": 10,
    "Online Advertising": 10,
    "Passionate about Work": 10,
    "Production Environment": 10,
    "Reliability Analysis": 10,
    "Search Algorithm": 10,
    "Technical Consultation": 10,
    "conference papers": 10,
    "Agent Orchestration": 9,
    "Azure Machine Learning": 9,
    "Business Optimization": 9,
    "Data Analysis": 9,
    "GitHub": 9,
    "Hand Tools": 9,
    "Technological Proficiency": 9,
    "scikit-learn": 9,
    "Algorithm Development": 8,
    "Business Analysis Planning": 8,
    "Clustering": 8,
    "Computer Proficiency": 8,
    "Design Patterns": 8,
    "Develops Software Solutions": 8,
    "Enterprise Architecture": 8,
    "Enterprise Software Industry": 8,
    "Full Stack Development": 8,
    "Learning Platform": 8,
    "Lifecycle Management": 8,
    "MCITP": 8,
    "MLOps": 8,
    "Management": 8,
    "Operational Management": 8,
    "Project Management Support": 8,
    "Roadmap": 8,
    "SSO": 8,
    "Technical Leadership": 8,
    "Workflow": 8,
    "Workflow Solutions": 8,
    "Analytical Approach": 7,
    "Containerization": 7,
    "Data Ingestion": 7,
    "Data Modelling": 7,
    "Data Quality Management": 7,
    "E-Commerce": 7,
    "Global E-commerce": 7,
    "Industrial Engineering": 7,
    "Monetization": 7,
    "Recommender Systems": 7,
    "Researching New Technologies": 7,
    "Statistical Modelling": 7,
    "Tools Software": 7,
    "Working alongside Product Teams": 7,
    "computational skills": 7,
    "requirements from stakeholders": 7,
    "Analytical Methods Development": 6,
    "Application Development": 6,
    "Cloud Services": 6,
    "Continuous Quality Improvement": 6,
    "Cybersecurity": 6,
    "Dashboards": 6,
    "Design of Experiments": 6,
    "Engineering Support": 6,
    "Front-end Development": 6,
    "Function Calling": 6,
    "Improve Usability": 6,
    "Industry Experience": 6,
    "Information Technology": 6,
    "JavaScript": 6,
    "Liaise With Technical Teams": 6,
    "Low Latency": 6,
    "MES": 6,
    "Middleware Components": 6,
    "OpenAI Codex": 6,
    "Operations Management": 6,
    "Partnerships": 6,
    "Prescriptive Analytics": 6,
    "Process Modelling": 6,
    "Product Improvement": 6,
    "Product Management": 6,
    "Production Deployment": 6,
    "Regulated Financial Services": 6,
    "Scalable Architecture": 6,
    "Single Sign-On": 6,
    "Site Reliability Engineering": 6,
    "Software": 6,
    "Software Integration": 6,
    "Solution Architecture": 6,
    "Statistical Analysis": 6,
    "Subject Matter Expert": 6,
    "Technical Design": 6,
    "Technical Skillset": 6,
    "Technology Planning": 6,
    "Test Automation": 6,
    "TypeScript": 6,
    "Unix Scripting": 6,
    "Workflow Software": 6,
    "data cube": 6,
    "data integration projects": 6,
    "delivering KPIs": 6,
    "requirements assessment": 6,
    "AI Literacy": 5,
    "Android": 5,
    "Apple Ios": 5,
    "Application Deployment": 5,
    "Application Frameworks": 5,
    "Archtics": 5,
    "Assisting Executives": 5,
    "Audio": 5,
    "Build Automation": 5,
    "CUDA": 5,
    "Collaborative Filtering": 5,
    "Commodities": 5,
    "Competitive Strategies": 5,
    "Complex Problem Solving": 5,
    "Computational Mathematics": 5,
    "Computer Vision Technology": 5,
    "Conceptualization": 5,
    "Container Operations": 5,
    "Content Security": 5,
    "Creative Solutions": 5,
    "Cross Functional Team Building": 5,
    "Cyber Security": 5,
    "Data Warehouse Systems": 5,
    "Data Wrangling": 5,
    "Databricks": 5,
    "Developing Skills": 5,
    "Digital Image Processing": 5,
    "E-Commerce Strategy": 5,
    "Ecosystem Services": 5,
    "Factor Analysis": 5,
    "Factoring": 5,
    "Git": 5,
    "Grant Administration": 5,
    "Hardware": 5,
    "Head Injury": 5,
    "High Availability": 5,
    "Hive": 5,
    "Idea Generation": 5,
    "Impact Assessment": 5,
    "Improve User Experience": 5,
    "Information Literacy": 5,
    "Information Visualization": 5,
    "Intellectual Property Law": 5,
    "Interface with engineers": 5,
    "Internships": 5,
    "Journals": 5,
    "Logic": 5,
    "Logistic Regression": 5,
    "Machine Vision": 5,
    "Mining": 5,
    "NIR": 5,
    "NumPy": 5,
    "OpenCV": 5,
    "Organisational Strategy Formulation": 5,
    "Organization and Coordination Skills": 5,
    "Pain Management": 5,
    "Pandas": 5,
    "Personalization": 5,
    "Photo Research": 5,
    "Photojournalism": 5,
    "Precipitation": 5,
    "Preparation of Technical Documents": 5,
    "Privacy Law": 5,
    "Product Demonstration": 5,
    "Project Lifecycle Management": 5,
    "Project Portfolio Management": 5,
    "Project Specification": 5,
    "Quality Improvement and Safe Practices": 5,
    "Relationship Building": 5,
    "Represent team": 5,
    "Research": 5,
    "Research & Development": 5,
    "Research Industry": 5,
    "Resolving Product Problems": 5,
    "Response Rate": 5,
    "Sand Control": 5,
    "Search Analysis": 5,
    "Search Engine Optimisation (SEO)": 5,
    "Search Server": 5,
    "Segmentation": 5,
    "Semantics": 5,
    "Signal Processing Algorithms": 5,
    "Solve Technical Problems": 5,
    "Stability": 5,
    "Standards Compliance": 5,
    "Statistical Analysis Software": 5,
    "Task Completion": 5,
    "Technical Support": 5,
    "Technical Writing": 5,
    "TikTok": 5,
    "Traceability": 5,
    "Training Courses": 5,
    "Training Set": 5,
    "Unix Administration": 5,
    "Video Analytics": 5,
    "Vision": 5,
    "Web Content Optimization": 5,
    "Workflow Engine": 5,
    "Yahoo! Search Marketing": 5,
    "candidate searches": 5,
    "cutting-edge technology": 5,
    "enhance user experience": 5,
    "hands-on skills": 5,
    "improve system performance": 5,
    "knowledge of data networking": 5,
    "online competitions": 5,
    "product development strategies": 5,
    "proposal documents": 5,
    "visualization system": 5,
    "A/B testing": 4,
    "AIOps": 4,
    "AWS Lambda": 4,
    "Applied Mathematics": 4,
    "Architectural Visualization": 4,
    "Automated Operation Monitoring": 4,
    "Automation Studio": 4,
    "Back End Infrastructure": 4,
    "Cloud Infrastructure": 4,
    "Computer Hardware": 4,
    "Creative Thinking": 4,
    "Cross-Functional Team Leadership": 4,
    "Data Quality Assurance": 4,
    "Database Optimization": 4,
    "Design for Maintainability": 4,
    "Distillation": 4,
    "ETL Tools": 4,
    "Education": 4,
    "Endpoint Security": 4,
    "Enterprise Search": 4,
    "Enterprise Systems": 4,
    "Failure Analysis": 4,
    "Failure Modes": 4,
    "Feature-Driven Development": 4,
    "GPU Programming": 4,
    "GitHub Copilot": 4,
    "Incident Handling": 4,
    "Interpret Business Needs": 4,
    "LLM Security": 4,
    "LLMOps": 4,
    "Large-scale Data Analysis": 4,
    "Liaising With Architects": 4,
    "Lifestyle": 4,
    "Mathematical Skills": 4,
    "Mentoring for Developers": 4,
    "Monitor Kpis": 4,
    "Monitoring Trends": 4,
    "Neural Networks": 4,
    "OEE": 4,
    "Operations": 4,
    "Oracle Machine Learning": 4,
    "Orchestration": 4,
    "Performance Improvement": 4,
    "Physics": 4,
    "Pico": 4,
    "Pipeline Management": 4,
    "Predictive Modeling": 4,
    "Process Engineering": 4,
    "Product Lifecycle Management": 4,
    "Product Strategy": 4,
    "Production System": 4,
    "Project Coordination": 4,
    "Project Team Management": 4,
    "Quantitative Analysis": 4,
    "REST APIs development": 4,
    "Reproducibility": 4,
    "Research Design": 4,
    "Root Cause Analysis": 4,
    "SIEM": 4,
    "Service Level Agreement": 4,
    "Software Architecture": 4,
    "Software Development Lifecycle": 4,
    "Software Testing": 4,
    "Technology Commercialization": 4,
    "User Interface Design": 4,
    "Validation Procedures": 4,
    "WIP": 4,
    "Work Under Pressure": 4,
    "Work With Product Managers": 4,
    "Workflow Automation": 4,
    "health monitoring software": 4,
    "policies & procedures": 4,
    "scalable solutions": 4,
    "AI Red Teaming": 2,
    "AOP": 2,
    "API Gateway": 2,
    "ARIMA": 2,
    "ATP": 2,
    "ATS": 2,
    "Access Control Management": 2,
    "Access Control System": 2,
    "Accountability": 2,
    "Accuracy and Precision": 2,
    "Adobe Spark": 2,
    "Adoption": 2,
    "Advanced Engineering": 2,
    "Advanced Robotics": 2,
    "Agile": 2,
    "Agile Delivery": 2,
    "Agile Software Development": 2,
    "Airflow": 2,
    "Algorithm Analysis": 2,
    "Amazon Bedrock": 2,
    "Analyse Product Performance": 2,
    "Analytics Support": 2,
    "Ansible": 2,
    "Apache Spark": 2,
    "Application Maintenance Support": 2,
    "Architectural Details": 2,
    "Articulate Communicator": 2,
    "Audit Frameworks": 2,
    "Automated Software Testing": 2,
    "Automation Strategy": 2,
    "Automation Tools": 2,
    "Automotive Industry": 2,
    "Autonomous Vehicles": 2,
    "Autonomy iManage": 2,
    "Azure AI Search": 2,
    "Azure OpenAI": 2,
    "BDD": 2,
    "BIM (Building Information Modeling)": 2,
    "BIRT (Business Intelligence and Reporting Tools)": 2,
    "Big Data Analytics": 2,
    "Biomedical Devices": 2,
    "Biomedical Sciences": 2,
    "Budget": 2,
    "Bug Fixing": 2,
    "Build Prototypes": 2,
    "Building Science": 2,
    "Business Applications": 2,
    "Business Data Analysis": 2,
    "Business Impact Analysis": 2,
    "Business Performance Analysis": 2,
    "Business Systems": 2,
    "Business Unit Purchasing": 2,
    "CDM": 2,
    "CMMS": 2,
    "CPT": 2,
    "Candidate Screening": 2,
    "Capacity Planning": 2,
    "Certifications": 2,
    "Clean Code": 2,
    "Clinical Data Management": 2,
    "Cloud Storage": 2,
    "Code Development": 2,
    "Code Review": 2,
    "Collaborating With Product Managers": 2,
    "Commercial Opportunities": 2,
    "Communicating With Agents": 2,
    "Competency Mapping": 2,
    "Component Based Development": 2,
    "Computerized Maintenance Management System": 2,
    "Computing Infrastructure": 2,
    "Concept Development": 2,
    "Confidentiality": 2,
    "Construction": 2,
    "Content Ingest Operations": 2,
    "Core Analysis": 2,
    "Creating communication strategies": 2,
    "CrewAI": 2,
    "Customer Experience Innovation": 2,
    "Customer Retention": 2,
    "Customer Segmentation": 2,
    "Customer Support": 2,
    "DCS": 2,
    "Data Access": 2,
    "Data Acquisition": 2,
    "Data Acquisition System": 2,
    "Data Architecture": 2,
    "Data Center Architecture": 2,
    "Data Exploration": 2,
    "Data Handling": 2,
    "Data Integration": 2,
    "Data Integrity": 2,
    "Data Lake": 2,
    "Data Lineage": 2,
    "Data Maintenance": 2,
    "Data Marketing": 2,
    "Data Marts": 2,
    "Data Migration Services": 2,
    "Data Planning": 2,
    "Data Retrieval": 2,
    "Data Services Business": 2,
    "Data Storytelling and Visualisation": 2,
    "Data Transformation": 2,
    "Database Analysis": 2,
    "Database Systems": 2,
    "Decision Support Systems": 2,
    "Develop Business Applications": 2,
    "Developing Frameworks": 2,
    "Development Reviews": 2,
    "Digital Business": 2,
    "Digital Insight & Analytics": 2,
    "Digital Scanner": 2,
    "Diversity": 2,
    "Drive Awareness": 2,
    "Dynamics": 2,
    "E-Commerce Platforms": 2,
    "E2e Testing": 2,
    "ESP": 2,
    "ETL": 2,
    "Educational Background": 2,
    "Elastic": 2,
    "Electrical": 2,
    "Embedding": 2,
    "Embedding Models": 2,
    "End-User Marketing": 2,
    "Energy Consultancy": 2,
    "Engineering Leadership": 2,
    "Engineering Management": 2,
    "Engineering Opportunities-": 2,
    "Enterprise Applications": 2,
    "Enterprise Valuation": 2,
    "EnterpriseDB": 2,
    "Environmental Monitoring": 2,
    "Equipment Design": 2,
    "Equipment Quality": 2,
    "Equities": 2,
    "Evaluation Methodology": 2,
    "Event-Driven Architecture (EDA)": 2,
    "Exploratory Data Analysis": 2,
    "FOCAL": 2,
    "Facilities Management": 2,
    "FastAPI": 2,
    "Ffmpeg": 2,
    "Financial Services": 2,
    "Focus Groups": 2,
    "Forecasting Models": 2,
    "Foundation Design": 2,
    "Foundations": 2,
    "Front-End Architecture": 2,
    "GCC": 2,
    "GPGPU": 2,
    "GUI Testing Tools": 2,
    "Gather Feedback": 2,
    "Generative AI Model Development and Fine Tuning": 2,
    "Global Engineering": 2,
    "Go to Market Strategies": 2,
    "Google Analytics": 2,
    "Google Cloud": 2,
    "Graduate Recruitment": 2,
    "Hardware Interfacing": 2,
    "Hardware delivery": 2,
    "Healthcare": 2,
    "High Level Architecture": 2,
    "High Speed Ethernet": 2,
    "IBM Cloud or Watson": 2,
    "Identifying New Business Opportunities": 2,
    "Image Classification": 2,
    "Image Processing and Industrial Vision Inspection": 2,
    "Implementation of Best Practices": 2,
    "Implementation of Digital Strategy": 2,
    "Implementing Budgets": 2,
    "Industry Research": 2,
    "Industry Stakeholders": 2,
    "Infiniband": 2,
    "Influencing Key Stakeholders": 2,
    "Infrastructure Automation": 2,
    "Integrated Planning": 2,
    "Integration Modules": 2,
    "Intelligent Agents": 2,
    "Interacting with team members": 2,
    "Interviewing": 2,
    "Issue Escalation": 2,
    "Issue Handling": 2,
    "Iteration Planning": 2,
    "Knowledge Transfer": 2,
    "LEED AP": 2,
    "LSTM": 2,
    "LangGraph": 2,
    "Language Services": 2,
    "Learning Framework Development": 2,
    "Library Science": 2,
    "Logistics": 2,
    "MES Software": 2,
    "MFC": 2,
    "MLflow": 2,
    "Managing Ambiguity": 2,
    "Mandarin Chinese": 2,
    "Manufacturing Execution Systems": 2,
    "Market Research": 2,
    "Mathematical Modeling": 2,
    "Mechanical Engineering": 2,
    "Mechanical Engineering Management": 2,
    "Medical Degree": 2,
    "Methods&techniques": 2,
    "Metrics": 2,
    "Middleware Solution": 2,
    "Model Based Software Development": 2,
    "Model Quantisation": 2,
    "Modern Architecture": 2,
    "MongoDB": 2,
    "Monitor Hardware": 2,
    "Natural Language Programming": 2,
    "Network Performance": 2,
    "New Venture Development": 2,
    "Node.js": 2,
    "OAuth": 2,
    "Object Detection": 2,
    "Online Services": 2,
    "Operational Metrics": 2,
    "Operational Planning": 2,
    "Operational Process Analysis": 2,
    "Operations & Services": 2,
    "Optimize Production Processes": 2,
    "Options Trading": 2,
    "Partnership Development": 2,
    "Pattern Recognition": 2,
    "Patterns": 2,
    "Peer Review": 2,
    "Performance Enhancement": 2,
    "Physical Education": 2,
    "Policy Management": 2,
    "Portfolio Administration": 2,
    "PostgreSQL": 2,
    "Potential Risks": 2,
    "Power BI": 2,
    "Predictive Maintenance": 2,
    "Presentation Skills": 2,
    "Pricing Strategy": 2,
    "Product Launch": 2,
    "Production Design": 2,
    "Production Engineering": 2,
    "Production Work": 2,
    "Programming Languages": 2,
    "Programming tools": 2,
    "Project Management": 2,
    "Project Quality Management": 2,
    "Project Status Reporting": 2,
    "Prototype": 2,
    "Quality and Performance": 2,
    "Quick Learning": 2,
    "R Programming": 2,
    "RESTful API": 2,
    "Real-time Simulation": 2,
    "Recovery Procedures": 2,
    "Registration": 2,
    "Regression": 2,
    "Regulatory Compliance": 2,
    "Reliability Requirements": 2,
    "Requirements Gathering": 2,
    "Research Methods": 2,
    "Research Support": 2,
    "Resource Allocation": 2,
    "Responsible AI and Generative AI Practices in Financial Services": 2,
    "Retention Management": 2,
    "SQL Programming": 2,
    "Salary Negotiation": 2,
    "Security Compliance": 2,
    "Security Controls": 2,
    "Security Test": 2,
    "Shipping Management": 2,
    "Soft Skills": 2,
    "Software Deployment": 2,
    "Software Design": 2,
    "Software Implementation": 2,
    "Software Quality Engineering": 2,
    "Software Standards": 2,
    "Solution Delivery": 2,
    "Spark SQL": 2,
    "Stakeholder Engagement and Management": 2,
    "Statistical Consulting": 2,
    "Statistical forecasting": 2,
    "Storage Layout": 2,
    "Strategic Workforce Planning": 2,
    "System Deployment": 2,
    "System Implementation": 2,
    "System Specification": 2,
    "System Testing": 2,
    "Systems Integration": 2,
    "Systems Thinking Application": 2,
    "Tailwind CSS": 2,
    "Tape": 2,
    "Team Mentoring": 2,
    "Technical Deployment": 2,
    "Technical Instruction": 2,
    "Technical Presentations": 2,
    "Technical Product Development": 2,
    "Technical Project Delivery": 2,
    "Technical Report Writing": 2,
    "Technology Adoption and Innovation": 2,
    "Technology Consulting": 2,
    "Technology Education": 2,
    "Tenancy Management": 2,
    "Tenure": 2,
    "Test Engineering": 2,
    "Time Series Analysis": 2,
    "Time Series Forecasting": 2,
    "Timely Delivery": 2,
    "Tooling": 2,
    "Tools Development": 2,
    "Total Rewards Strategies": 2,
    "Track Record Of Dependability": 2,
    "Training Needs Analysis": 2,
    "Transformer": 2,
    "Transition Planning": 2,
    "Translate Into Technical Requirements": 2,
    "Transportation Planning": 2,
    "Travel Agency": 2,
    "Travel Technology": 2,
    "Use Case Analysis": 2,
    "User Feedback": 2,
    "User Stories": 2,
    "Vector Search": 2,
    "Virtual Worlds": 2,
    "Web Applications": 2,
    "Windows Azure platform": 2,
    "Work Life Balance": 2,
    "Work Preparation": 2,
    "Workflow Development": 2,
    "Workflow Management": 2,
    "Workflow Orchestration": 2,
    "Writing": 2,
    "Written English": 2,
    "Xcode": 2,
    "benchmarking analysis": 2,
    "computing solutions": 2,
    "design database schemas": 2,
    "development of test strategies": 2,
    "evaluation of software": 2,
    "governance requirements": 2,
    "implementing monitoring tools": 2,
    "leading stakeholders": 2,
    "operational knowledge": 2,
    "organizational pain-points": 2,
    "product roadmap strategies": 2,
    "scientific software": 2,
    "software lifecycle methodologies": 2,
    "software-engineering concepts": 2,
    "support of IT projects": 2,
    "work processes": 2
  },
  "doc_freq": {
    "Design": 1563,
    "Development": 1328,
    "Python": 1289,
    "Software": 1138,
    "Programming": 875,
    "Pipelines": 861,
    "Management": 846,
    "Machine Learning": 763,
    "Security": 745,
    "AWS": 708,
    "Deployment": 609,
    "Scalability": 595,
    "Governance": 577,
    "Agents": 560,
    "LLMs": 550,
    "Data Science": 545,
    "Software Engineering": 520,
    "Kubernetes": 505,
    "Optimization": 505,
    "PyTorch": 494,
    "Evaluation": 486,
    "API": 467,
    "Monitoring": 457,
    "Artificial Intelligence": 447,
    "TensorFlow": 446,
    "Testing": 444,
    "CI/CD": 433,
    "Architecture": 425,
    "Language Models": 410,
    "Docker": 406,
    "AI Agents": 380,
    "Deep Learning": 344,
    "Operations": 335,
    "Prompt Engineering": 330,
    "MLOps": 321,
    "Generative AI": 316,
    "Java": 310,
    "Data Engineering": 297,
    "SQL": 288,
    "LangChain": 276,
    "Model Deployment": 276,
    "Model Training": 263,
    "Energy": 262,
    "AI Models": 257,
    "AI Governance": 254,
    "Workflow": 253,
    "LlamaIndex": 240,
    "Diversity": 237,
    "Pinecone": 237,
    "Validation": 235,
    "Research": 234,
    "Azure AI": 232,
    "Orchestration": 228,
    "Retrieval-Augmented Generation (RAG)": 226,
    "Vision": 225,
    "Algorithms": 224,
    "Software Development": 224,
    "FAISS": 219,
    "Computer Vision": 213,
    "GCP": 213,
    "Patterns": 210,
    "Responsible AI": 200,
    "Rest Apis": 196,
    "Gemini": 189,
    "Tooling": 180,
    "Programming Languages": 175,
    "C++": 166,
    "Mathematics": 166,
    "Containerization": 163,
    "Edge": 160,
    "Agile": 157,
    "Model Evaluation": 155,
    "Scripting": 154,
    "Tuning": 154,
    "Writing": 152,
    "scikit-learn": 152,
    "Application Development": 145,
    "Stakeholder Management": 141,
    "AutoGen": 132,
    "Feature Engineering": 132,
    "Statistics": 132,
    "Google Cloud": 131,
    "Roadmap": 126,
    "Knowledge Sharing": 125,
    "Modelling": 123,
    "Analytical and Problem-Solving Skills": 120,
    "Data Analysis": 118,
    "Debugging": 115,
    "Open Source": 114,
    "Certifications": 112,
    "Prototype": 109,
    "Enterprise Applications": 107,
    "Microsoft Azure": 107,
    "Azure OpenAI": 106,
    "Metrics": 106,
    "TypeScript": 106,
    "Experimentation": 102,
    "GitHub": 101,
    "JavaScript": 101,
    "Reinforcement Learning": 99,
    "Classification": 98,
    "Technical Leadership": 98,
    "Data Solutions": 96,
    "Authentication": 95,
    "Stability": 93,
    "FastAPI": 89,
    "Financial Services": 87,
    "Data Governance": 85,
    "Linux": 85,
    "Education": 81,
    "Enterprise Systems": 81,
    "Performance Tuning": 81,
    "API Development": 80,
    "LangGraph": 80,
    "ETL": 79,
    "Workflow Automation": 77,
    "Predictive Analytics": 74,
    "Multi-Agent Systems": 73,
    "Git": 72,
    "Scala": 72,
    "Data Integration": 71,
    "MongoDB": 71,
    "Web Applications": 70,
    "Cloud Services": 68,
    "Conferences": 65,
    "Dashboards": 64,
    "Information Technology": 64,
    "Hardware": 63,
    "PostgreSQL": 62,
    "Product Management": 62,
    "Data Structures": 61,
    "Google Cloud Platform": 60,
    "Partnerships": 60,
    "Solution Architecture": 60,
    "Soft Skills": 58,
    "cutting-edge technology": 58,
    "Chatbot": 57,
    "Data Mining": 57,
    "Pandas": 57,
    "Regulatory Compliance": 57,
    "Healthcare": 56,
    "CrewAI": 55,
    "Keras": 55,
    "Mining": 55,
    "Regression": 55,
    "TikTok": 55,
    "Authorization": 54,
    "large datasets": 53,
    "Data Ingestion": 51,
    "Global Engineering": 50,
    "Production Deployment": 50,
    "Adoption": 49,
    "Budget": 49,
    "Coding Standards": 49,
    "Data Transformation": 48,
    "Natural Language Processing": 48,
    "Node.js": 48,
    "Project Management": 48,
    "High Availability": 47,
    "ATS": 46,
    "Data Infrastructure": 46,
    "Design Patterns": 46,
    "Context Engineering": 45,
    "Registration": 45,
    "Data Architecture": 44,
    "Electrical Engineering": 44,
    "Pico": 44,
    "Power BI": 44,
    "PySpark": 44,
    "Segmentation": 44,
    "Airflow": 43,
    "Batch Processing": 43,
    "Lifecycle Management": 43,
    "scalable solutions": 43,
    "Benchmarking": 42,
    "Distillation": 42,
    "Azure AI Search": 41,
    "Backend Development": 41,
    "Electrical": 41,
    "Cloud Infrastructure": 40,
    "Enterprise Software": 40,
    "Internships": 40,
    "Stakeholder Engagement": 39,
    "Model Context Protocol (MCP)": 38,
    "Prediction": 38,
    "AI Safety": 37,
    "Cloud Technologies": 37,
    "Embedding": 37,
    "Industry Experience": 37,
    "MLflow": 37,
    "Relational Databases": 37,
    "Exploratory Data Analysis": 36,
    "Function Calling": 36,
    "Profiling": 36,
    "Software Architecture": 36,
    "Transformer": 36,
    "Data Lake": 35,
    "Hive": 35,
    "Build Prototypes": 34,
    "Build and Deploy": 34,
    "Information Retrieval": 34,
    "Professional Experience": 34,
    "Root Cause Analysis": 34,
    "Accountability": 33,
    "Statistical Modelling": 33,
    "Data Modelling": 32,
    "LLMOps": 32,
    "Object Detection": 32,
    "Physics": 32,
    "User Feedback": 32,
    "Apache Spark": 31,
    "E-Commerce": 31,
    "Data Retrieval": 30,
    "Alteryx": 29,
    "OpenCV": 29,
    "SSO": 29,
    "Data Access": 28,
    "Data Warehousing": 28,
    "Representation Learning": 28,
    "Reproducibility": 28,
    "Vector Search": 28,
    "Construction": 27,
    "Databricks": 27,
    "Subject Matter Expert": 27,
    "leading technical teams": 27,
    "Applied Mathematics": 26,
    "Azure Machine Learning": 26,
    "Failure Modes": 26,
    "GitHub Copilot": 26,
    "Recommender Systems": 26,
    "Semantic Search": 26,
    "Technical Writing": 26,
    "AWS Lambda": 25,
    "Cybersecurity": 25,
    "Single Sign-On": 25,
    "Workflow Orchestration": 25,
    "Agent Orchestration": 24,
    "MES": 24,
    "Neural Networks": 24,
    "NumPy": 24,
    "Competitive Advantage": 23,
    "Data Pipeline": 23,
    "Engineering Management": 23,
    "Production Environment": 23,
    "Traceability": 23,
    "Predictive Maintenance": 22,
    "Production Support": 22,
    "Site Reliability Engineering": 22,
    "Technical Design": 22,
    "Code Review": 21,
    "Product Strategy": 21,
    "Tailwind CSS": 21,
    "ACL": 20,
    "Academic Writing": 20,
    "Customer Segmentation": 20,
    "Fine Tuning": 20,
    "Audio": 19,
    "Cloudera": 19,
    "Data Wrangling": 19,
    "Image Classification": 19,
    "Software Development Lifecycle": 19,
    "Innovator": 18,
    "Learning Platform": 18,
    "Prescriptive Analytics": 18,
    "Technical Support": 18,
    "Tenure": 18,
    "Cloud Deployment": 17,
    "Confidentiality": 17,
    "DBMS": 17,
    "Intelligent Reasoning": 17,
    "Qwen": 17,
    "RESTful API": 17,
    "Software Verification": 17,
    "Stochastic": 17,
    "Technology Consulting": 17,
    "Android": 16,
    "Deployment Automation": 16,
    "Engineering Leadership": 16,
    "Reliability Requirements": 16,
    "Technical Development": 16,
    "Written English": 16,
    "Business Applications": 15,
    "Cisco": 15,
    "Cost Management": 15,
    "Development Tools": 15,
    "Embedding Models": 15,
    "Genesys": 15,
    "Security Controls": 15,
    "SoC": 15,
    "Automation Tools": 14,
    "Database Administration": 14,
    "EDA": 14,
    "Platform Modernization": 14,
    "System Testing": 14,
    "Ansible": 13,
    "Compiler": 13,
    "Logic": 13,
    "AI Evaluation": 12,
    "AI Literacy": 12,
    "Clustering": 12,
    "Data Marts": 12,
    "Data Visualisation": 12,
    "ETL Tools": 12,
    "Hyperparameter Tuning": 12,
    "Knowledge Transfer": 12,
    "Lifestyle": 12,
    "Personalization": 12,
    "Video Analytics": 12,
    "API Gateway": 11,
    "CUDA": 11,
    "Dynamics": 11,
    "Journals": 11,
    ".NET": 10,
    "Conceptualization": 10,
    "Cyber Security": 10,
    "Educational Background": 10,
    "Flutter": 10,
    "Full Stack Development": 10,
    "GCC": 10,
    "Logistic Regression": 10,
    "Middleware Components": 10,
    "Online Advertising": 10,
    "Prompt Design": 10,
    "Relationship Building": 10,
    "Spark SQL": 10,
    "Statistical Analysis": 10,
    "Test Automation": 10,
    "AI Red Teaming": 9,
    "Foundations": 9,
    "Timely Delivery": 9,
    "governance requirements": 9,
    "Azure DevOps": 8,
    "Collaborative Filtering": 8,
    "Database Systems": 8,
    "Enterprise Architecture": 8,
    "Failure Analysis": 8,
    "Platform Management": 8,
    "Programming tools": 8,
    "Software Design": 8,
    "A/B testing": 7,
    "Data Lineage": 7,
    "Elastic": 7,
    "Ffmpeg": 7,
    "Infrastructure Automation": 7,
    "Intelligent Agents": 7,
    "Monetization": 7,
    "Multimodal AI": 7,
    "Software Integration": 7,
    "Software Testing": 7,
    "Validation Procedures": 7,
    "enhance user experience": 7,
    "scientific software": 7,
    "AIOps": 6,
    "Customer Support": 6,
    "Design of Experiments": 6,
    "Endpoint Security": 6,
    "Front-end Development": 6,
    "Global E-commerce": 6,
    "Improve Usability": 6,
    "Mechanical Engineering": 6,
    "Presentation Skills": 6,
    "Production Engineering": 6,
    "Real-time Simulation": 6,
    "Research Methods": 6,
    "User Stories": 6,
    "data cube": 6,
    "Code Repository": 5,
    "Content Security": 5,
    "Data Quality Management": 5,
    "Digital Image Processing": 5,
    "GPT Models": 5,
    "Google Analytics": 5,
    "Improve User Experience": 5,
    "Incident Handling": 5,
    "International Conferences": 5,
    "OAuth": 5,
    "Online Services": 5,
    "Operational Metrics": 5,
    "Precipitation": 5,
    "SIEM": 5,
    "Search Algorithm": 5,
    "Semantics": 5,
    "Software Deployment": 5,
    "System Deployment": 5,
    "System Implementation": 5,
    "Agile Delivery": 4,
    "Capacity Planning": 4,
    "Clean Code": 4,
    "Enterprise Search": 4,
    "LSTM": 4,
    "Mathematical Skills": 4,
    "Model Validation": 4,
    "OEE": 4,
    "Solution Delivery": 4,
    "Task Completion": 4,
    "WIP": 4,
    "Work Under Pressure": 4,
    "improve system performance": 4,
    "Agile Software Development": 3,
    "Bug Fixing": 3,
    "Logistics": 3,
    "Operational Planning": 3,
    "Potential Risks": 3,
    "AOP": 2,
    "ARIMA": 2,
    "ATP": 2,
    "Algorithm Development": 2,
    "Automotive Industry": 2,
    "Autonomous Vehicles": 2,
    "Big Data Analytics": 2,
    "Business Systems": 2,
    "CMMS": 2,
    "CPT": 2,
    "Candidate Screening": 2,
    "Commercial Opportunities": 2,
    "DCS": 2,
    "Data Acquisition": 2,
    "Data Exploration": 2,
    "ESP": 2,
    "Engineering Support": 2,
    "Environmental Monitoring": 2,
    "Equities": 2,
    "Facilities Management": 2,
    "Feature Selection": 2,
    "Forecasting Models": 2,
    "Industrial Engineering": 2,
    "Infiniband": 2,
    "LEED AP": 2,
    "Market Research": 2,
    "Pattern Recognition": 2,
    "Peer Review": 2,
    "Performance Management": 2,
    "Pipeline Development": 2,
    "Predictive Modeling": 2,
    "Product Launch": 2,
    "Quantitative Analysis": 2,
    "Resource Allocation": 2,
    "Software Development Tools": 2,
    "Software as a Service (SaaS)": 2,
    "Storage Layout": 2,
    "Technical Infrastructure": 2,
    "Time Series Analysis": 2,
    "Transportation Planning": 2,
    "operational knowledge": 2,
    "Customer Retention": 1,
    "Data Handling": 1,
    "FOCAL": 1,
    "Project Leadership": 1
  }
}